'use strict';

module.exports = {
    กรุงเทพมหานคร: {
        พระนคร: {
            subDistrict: [
                'พระบรมมหาราชวัง',
                'วังบูรพาภิรมย์',
                'วัดราชบพิธ',
                'สำราญราษฎร์',
                'ศาลเจ้าพ่อเสือ',
                'เสาชิงช้า',
                'บวรนิเวศ',
                'ตลาดยอด',
                'ชนะสงคราม',
                'บ้านพานถม',
                'บางขุนพรหม',
                'วัดสามพระยา'
            ],
            postalCodes: ['10200']
        },
        ดุสิต: {
            subDistrict: [
                'ดุสิต',
                'วชิรพยาบาล',
                'สวนจิตรลดา',
                'สี่แยกมหานาค',
                'ถนนนครไชยศรี'
            ],
            postalCodes: ['10300']
        },
        หนองจอก: {
            subDistrict: [
                'กระทุ่มราย',
                'หนองจอก',
                'คลองสิบ',
                'คลองสิบสอง',
                'โคกแฝด',
                'คู้ฝั่งเหนือ',
                'ลำผักชี',
                'ลำต้อยติ่ง'
            ],
            postalCodes: ['10530']
        },
        บางรัก: {
            subDistrict: [
                'มหาพฤฒาราม',
                'สีลม',
                'สุริยวงศ์',
                'บางรัก',
                'สี่พระยา'
            ],
            postalCodes: ['10500']
        },
        บางเขน: {
            subDistrict: ['อนุสาวรีย์', 'ท่าแร้ง'],
            postalCodes: ['10220']
        },
        บางกะปิ: {
            subDistrict: ['คลองจั่น', 'หัวหมาก'],
            postalCodes: ['10240']
        },
        ปทุมวัน: {
            subDistrict: ['รองเมือง', 'วังใหม่', 'ปทุมวัน', 'ลุมพินี'],
            postalCodes: ['10330']
        },
        ป้อมปราบศัตรูพ่าย: {
            subDistrict: [
                'ป้อมปราบ',
                'วัดเทพศิรินทร์',
                'คลองมหานาค',
                'บ้านบาตร',
                'วัดโสมนัส'
            ],
            postalCodes: ['10100']
        },
        พระโขนง: {
            subDistrict: ['บางจาก', 'พระโขนงใต้'],
            postalCodes: ['10260']
        },
        มีนบุรี: {
            subDistrict: ['มีนบุรี', 'แสนแสบ'],
            postalCodes: ['10510']
        },
        ลาดกระบัง: {
            subDistrict: [
                'ลาดกระบัง',
                'คลองสองต้นนุ่น',
                'คลองสามประเวศ',
                'ลำปลาทิว',
                'ทับยาว',
                'ขุมทอง'
            ],
            postalCodes: ['10520']
        },
        ยานนาวา: {
            subDistrict: ['ช่องนนทรี', 'บางโพงพาง'],
            postalCodes: ['10120']
        },
        สัมพันธวงศ์: {
            subDistrict: ['จักรวรรดิ', 'สัมพันธวงศ์', 'ตลาดน้อย'],
            postalCodes: ['10100']
        },
        พญาไท: {
            subDistrict: ['สามเสนใน', 'พญาไท'],
            postalCodes: ['10400']
        },
        ธนบุรี: {
            subDistrict: [
                'วัดกัลยาณ์',
                'หิรัญรูจี',
                'บางยี่เรือ',
                'บุคคโล',
                'ตลาดพลู',
                'ดาวคะนอง',
                'สำเหร่'
            ],
            postalCodes: ['10600']
        },
        บางกอกใหญ่: {
            subDistrict: ['วัดอรุณ', 'วัดท่าพระ'],
            postalCodes: ['10600']
        },
        ห้วยขวาง: {
            subDistrict: ['ห้วยขวาง', 'บางกะปิ', 'สามเสนนอก'],
            postalCodes: ['10310']
        },
        คลองสาน: {
            subDistrict: [
                'สมเด็จเจ้าพระยา',
                'คลองสาน',
                'บางลำภูล่าง',
                'คลองต้นไทร'
            ],
            postalCodes: ['10600']
        },
        ตลิ่งชัน: {
            subDistrict: [
                'คลองชักพระ',
                'ตลิ่งชัน',
                'ฉิมพลี',
                'บางพรม',
                'บางระมาด',
                'บางเชือกหนัง'
            ],
            postalCodes: ['10170']
        },
        บางกอกน้อย: {
            subDistrict: [
                'ศิริราช',
                'บ้านช่างหล่อ',
                'บางขุนนนท์',
                'บางขุนศรี',
                'อรุณอมรินทร์'
            ],
            postalCodes: ['10700']
        },
        บางขุนเทียน: {
            subDistrict: ['ท่าข้าม', 'แสมดำ'],
            postalCodes: ['10150']
        },
        ภาษีเจริญ: {
            subDistrict: [
                'บางหว้า',
                'บางด้วน',
                'บางจาก',
                'บางแวก',
                'คลองขวาง',
                'ปากคลองภาษีเจริญ',
                'คูหาสวรรค์'
            ],
            postalCodes: ['10160']
        },
        หนองแขม: {
            subDistrict: ['หนองแขม', 'หนองค้างพลู'],
            postalCodes: ['10160']
        },
        ราษฎร์บูรณะ: {
            subDistrict: ['ราษฎร์บูรณะ', 'บางปะกอก'],
            postalCodes: ['10140']
        },
        บางพลัด: {
            subDistrict: ['บางพลัด', 'บางอ้อ', 'บางบำหรุ', 'บางยี่ขัน'],
            postalCodes: ['10700']
        },
        ดินแดง: {
            subDistrict: ['ดินแดง', 'รัชดาภิเษก'],
            postalCodes: ['10400']
        },
        บึงกุ่ม: {
            subDistrict: ['คลองกุ่ม', 'นวมินทร์', 'นวลจันทร์'],
            postalCodes: ['10240', '10230']
        },
        สาทร: {
            subDistrict: ['ทุ่งวัดดอน', 'ยานนาวา', 'ทุ่งมหาเมฆ'],
            postalCodes: ['10120']
        },
        บางซื่อ: {
            subDistrict: ['บางซื่อ', 'วงศ์สว่าง'],
            postalCodes: ['10800']
        },
        จตุจักร: {
            subDistrict: [
                'ลาดยาว',
                'เสนานิคม',
                'จันทรเกษม',
                'จอมพล',
                'จตุจักร'
            ],
            postalCodes: ['10900']
        },
        บางคอแหลม: {
            subDistrict: ['บางคอแหลม', 'วัดพระยาไกร', 'บางโคล่'],
            postalCodes: ['10120']
        },
        ประเวศ: {
            subDistrict: ['ประเวศ', 'หนองบอน', 'ดอกไม้'],
            postalCodes: ['10250']
        },
        คลองเตย: {
            subDistrict: ['คลองเตย', 'คลองตัน', 'พระโขนง'],
            postalCodes: ['10110']
        },
        สวนหลวง: {
            subDistrict: ['สวนหลวง', 'อ่อนนุช', 'พัฒนาการ'],
            postalCodes: ['10250']
        },
        จอมทอง: {
            subDistrict: ['บางขุนเทียน', 'บางค้อ', 'บางมด', 'จอมทอง'],
            postalCodes: ['10150']
        },
        ดอนเมือง: {
            subDistrict: ['สีกัน', 'ดอนเมือง', 'สนามบิน'],
            postalCodes: ['10210']
        },
        ราชเทวี: {
            subDistrict: ['ทุ่งพญาไท', 'ถนนพญาไท', 'ถนนเพชรบุรี', 'มักกะสัน'],
            postalCodes: ['10400']
        },
        ลาดพร้าว: {
            subDistrict: ['ลาดพร้าว', 'จรเข้บัว'],
            postalCodes: ['10230']
        },
        วัฒนา: {
            subDistrict: ['คลองเตยเหนือ', 'คลองตันเหนือ', 'พระโขนงเหนือ'],
            postalCodes: ['10110']
        },
        บางแค: {
            subDistrict: ['บางแค', 'บางแคเหนือ', 'บางไผ่', 'หลักสอง'],
            postalCodes: ['10160']
        },
        หลักสี่: {
            subDistrict: ['ทุ่งสองห้อง', 'ตลาดบางเขน'],
            postalCodes: ['10210']
        },
        สายไหม: {
            subDistrict: ['สายไหม', 'ออเงิน', 'คลองถนน'],
            postalCodes: ['10220']
        },
        คันนายาว: {
            subDistrict: ['คันนายาว', 'รามอินทรา'],
            postalCodes: ['10230']
        },
        สะพานสูง: {
            subDistrict: ['สะพานสูง', 'ราษฎร์พัฒนา', 'ทับช้าง'],
            postalCodes: ['10240', '10250']
        },
        วังทองหลาง: {
            subDistrict: [
                'วังทองหลาง',
                'สะพานสอง',
                'คลองเจ้าคุณสิงห์',
                'พลับพลา'
            ],
            postalCodes: ['10310']
        },
        คลองสามวา: {
            subDistrict: [
                'สามวาตะวันตก',
                'สามวาตะวันออก',
                'บางชัน',
                'ทรายกองดิน',
                'ทรายกองดินใต้'
            ],
            postalCodes: ['10510']
        },
        บางนา: {
            subDistrict: ['บางนาเหนือ', 'บางนาใต้'],
            postalCodes: ['10260']
        },
        ทวีวัฒนา: {
            subDistrict: ['ทวีวัฒนา', 'ศาลาธรรมสพน์'],
            postalCodes: ['10170']
        },
        ทุ่งครุ: {
            subDistrict: ['บางมด', 'ทุ่งครุ'],
            postalCodes: ['10140']
        },
        บางบอน: {
            subDistrict: [
                'บางบอนเหนือ',
                'บางบอนใต้',
                'คลองบางพราน',
                'คลองบางบอน'
            ],
            postalCodes: ['10150']
        }
    },
    สมุทรปราการ: {
        เมืองสมุทรปราการ: {
            subDistrict: [
                'ปากน้ำ',
                'สำโรงเหนือ',
                'บางเมือง',
                'ท้ายบ้าน',
                'บางปูใหม่',
                'แพรกษา',
                'บางโปรง',
                'บางปู',
                'บางด้วน',
                'บางเมืองใหม่',
                'เทพารักษ์',
                'ท้ายบ้านใหม่',
                'แพรกษาใหม่'
            ],
            postalCodes: ['10270', '10280']
        },
        บางบ่อ: {
            subDistrict: [
                'บางบ่อ',
                'บ้านระกาศ',
                'บางพลีน้อย',
                'บางเพรียง',
                'คลองด่าน',
                'คลองสวน',
                'เปร็ง',
                'คลองนิยมยาตรา'
            ],
            postalCodes: ['10560', '10550']
        },
        บางพลี: {
            subDistrict: [
                'บางพลีใหญ่',
                'บางแก้ว',
                'บางปลา',
                'บางโฉลง',
                'ราชาเทวะ',
                'หนองปรือ'
            ],
            postalCodes: ['10540']
        },
        พระประแดง: {
            subDistrict: [
                'ตลาด',
                'บางพึ่ง',
                'บางจาก',
                'บางครุ',
                'บางหญ้าแพรก',
                'บางหัวเสือ',
                'สำโรงใต้',
                'บางยอ',
                'บางกะเจ้า',
                'บางน้ำผึ้ง',
                'บางกระสอบ',
                'บางกอบัว',
                'ทรงคนอง',
                'สำโรง',
                'สำโรงกลาง'
            ],
            postalCodes: ['10130']
        },
        พระสมุทรเจดีย์: {
            subDistrict: [
                'นาเกลือ',
                'บ้านคลองสวน',
                'แหลมฟ้าผ่า',
                'ปากคลองบางปลากด',
                'ในคลองบางปลากด'
            ],
            postalCodes: ['10290']
        },
        บางเสาธง: {
            subDistrict: ['บางเสาธง', 'ศีรษะจรเข้น้อย', 'ศีรษะจรเข้ใหญ่'],
            postalCodes: ['10570']
        }
    },
    นนทบุรี: {
        เมืองนนทบุรี: {
            subDistrict: [
                'สวนใหญ่',
                'ตลาดขวัญ',
                'บางเขน',
                'บางกระสอ',
                'ท่าทราย',
                'บางไผ่',
                'บางศรีเมือง',
                'บางกร่าง',
                'ไทรม้า',
                'บางรักน้อย'
            ],
            postalCodes: ['11000']
        },
        บางกรวย: {
            subDistrict: [
                'วัดชลอ',
                'บางกรวย',
                'บางสีทอง',
                'บางขนุน',
                'บางขุนกอง',
                'บางคูเวียง',
                'มหาสวัสดิ์',
                'ปลายบาง',
                'ศาลากลาง'
            ],
            postalCodes: ['11130']
        },
        บางใหญ่: {
            subDistrict: [
                'บางม่วง',
                'บางแม่นาง',
                'บางเลน',
                'เสาธงหิน',
                'บางใหญ่',
                'บ้านใหม่'
            ],
            postalCodes: ['11140']
        },
        บางบัวทอง: {
            subDistrict: [
                'โสนลอย',
                'บางบัวทอง',
                'บางรักใหญ่',
                'บางคูรัด',
                'ละหาร',
                'ลำโพ',
                'พิมลราช',
                'บางรักพัฒนา'
            ],
            postalCodes: ['11110']
        },
        ไทรน้อย: {
            subDistrict: [
                'ไทรน้อย',
                'ราษฎร์นิยม',
                'หนองเพรางาย',
                'ไทรใหญ่',
                'ขุนศรี',
                'คลองขวาง',
                'ทวีวัฒนา'
            ],
            postalCodes: ['11150']
        },
        ปากเกร็ด: {
            subDistrict: [
                'ปากเกร็ด',
                'บางตลาด',
                'บ้านใหม่',
                'บางพูด',
                'บางตะไนย์',
                'คลองพระอุดม',
                'ท่าอิฐ',
                'เกาะเกร็ด',
                'อ้อมเกร็ด',
                'คลองข่อย',
                'บางพลับ',
                'คลองเกลือ'
            ],
            postalCodes: ['11120']
        }
    },
    ปทุมธานี: {
        เมืองปทุมธานี: {
            subDistrict: [
                'บางปรอก',
                'บ้านใหม่',
                'บ้านกลาง',
                'บ้านฉาง',
                'บ้านกระแชง',
                'บางขะแยง',
                'บางคูวัด',
                'บางหลวง',
                'บางเดื่อ',
                'บางพูด',
                'บางพูน',
                'บางกะดี',
                'สวนพริกไทย',
                'หลักหก'
            ],
            postalCodes: ['12000']
        },
        คลองหลวง: {
            subDistrict: [
                'คลองหนึ่ง',
                'คลองสอง',
                'คลองสาม',
                'คลองสี่',
                'คลองห้า',
                'คลองหก',
                'คลองเจ็ด'
            ],
            postalCodes: ['12120']
        },
        ธัญบุรี: {
            subDistrict: [
                'ประชาธิปัตย์',
                'บึงยี่โถ',
                'รังสิต',
                'ลำผักกูด',
                'บึงสนั่น',
                'บึงน้ำรักษ์'
            ],
            postalCodes: ['12130', '12110']
        },
        หนองเสือ: {
            subDistrict: [
                'บึงบา',
                'บึงบอน',
                'บึงกาสาม',
                'บึงชำอ้อ',
                'หนองสามวัง',
                'ศาลาครุ',
                'นพรัตน์'
            ],
            postalCodes: ['12170']
        },
        ลาดหลุมแก้ว: {
            subDistrict: [
                'ระแหง',
                'ลาดหลุมแก้ว',
                'คูบางหลวง',
                'คูขวาง',
                'คลองพระอุดม',
                'บ่อเงิน',
                'หน้าไม้'
            ],
            postalCodes: ['12140']
        },
        ลำลูกกา: {
            subDistrict: [
                'คูคต',
                'ลาดสวาย',
                'บึงคำพร้อย',
                'ลำลูกกา',
                'บึงทองหลาง',
                'ลำไทร',
                'บึงคอไห',
                'พืชอุดม'
            ],
            postalCodes: ['12130', '12150']
        },
        สามโคก: {
            subDistrict: [
                'บางเตย',
                'คลองควาย',
                'สามโคก',
                'กระแชง',
                'บางโพธิ์เหนือ',
                'เชียงรากใหญ่',
                'บ้านปทุม',
                'บ้านงิ้ว',
                'เชียงรากน้อย',
                'บางกระบือ',
                'ท้ายเกาะ'
            ],
            postalCodes: ['12160']
        }
    },
    พระนครศรีอยุธยา: {
        พระนครศรีอยุธยา: {
            subDistrict: [
                'ประตูชัย',
                'กะมัง',
                'หอรัตนไชย',
                'หัวรอ',
                'ท่าวาสุกรี',
                'ไผ่ลิง',
                'ปากกราน',
                'ภูเขาทอง',
                'สำเภาล่ม',
                'สวนพริก',
                'คลองตะเคียน',
                'วัดตูม',
                'หันตรา',
                'ลุมพลี',
                'บ้านใหม่',
                'บ้านเกาะ',
                'คลองสวนพลู',
                'คลองสระบัว',
                'เกาะเรียน',
                'บ้านป้อม',
                'บ้านรุน'
            ],
            postalCodes: ['13000']
        },
        ท่าเรือ: {
            subDistrict: [
                'ท่าเรือ',
                'จำปา',
                'ท่าหลวง',
                'บ้านร่อม',
                'ศาลาลอย',
                'วังแดง',
                'โพธิ์เอน',
                'ปากท่า',
                'หนองขนาก',
                'ท่าเจ้าสนุก'
            ],
            postalCodes: ['13130', '18270']
        },
        นครหลวง: {
            subDistrict: [
                'นครหลวง',
                'ท่าช้าง',
                'บ่อโพง',
                'บ้านชุ้ง',
                'ปากจั่น',
                'บางระกำ',
                'บางพระครู',
                'แม่ลา',
                'หนองปลิง',
                'คลองสะแก',
                'สามไถ',
                'พระนอน'
            ],
            postalCodes: ['13260']
        },
        บางไทร: {
            subDistrict: [
                'บางไทร',
                'บางพลี',
                'สนามชัย',
                'บ้านแป้ง',
                'หน้าไม้',
                'บางยี่โท',
                'แคออก',
                'แคตก',
                'ช่างเหล็ก',
                'กระแชง',
                'บ้านกลึง',
                'ช้างน้อย',
                'ห่อหมก',
                'ไผ่พระ',
                'กกแก้วบูรพา',
                'ไม้ตรา',
                'บ้านม้า',
                'บ้านเกาะ',
                'ราชคราม',
                'ช้างใหญ่',
                'โพแตง',
                'เชียงรากน้อย',
                'โคกช้าง'
            ],
            postalCodes: ['13190', '13290']
        },
        บางบาล: {
            subDistrict: [
                'บางบาล',
                'วัดยม',
                'ไทรน้อย',
                'สะพานไทย',
                'มหาพราหมณ์',
                'กบเจา',
                'บ้านคลัง',
                'พระขาว',
                'น้ำเต้า',
                'ทางช้าง',
                'วัดตะกู',
                'บางหลวง',
                'บางหลวงโดด',
                'บางหัก',
                'บางชะนี',
                'บ้านกุ่ม'
            ],
            postalCodes: ['13250']
        },
        บางปะอิน: {
            subDistrict: [
                'บ้านเลน',
                'เชียงรากน้อย',
                'บ้านโพ',
                'บ้านกรด',
                'บางกระสั้น',
                'คลองจิก',
                'บ้านหว้า',
                'วัดยม',
                'บางประแดง',
                'สามเรือน',
                'เกาะเกิด',
                'บ้านพลับ',
                'บ้านแป้ง',
                'คุ้งลาน',
                'ตลิ่งชัน',
                'บ้านสร้าง',
                'ตลาดเกรียบ',
                'ขนอนหลวง'
            ],
            postalCodes: ['13160', '13180', '13170']
        },
        บางปะหัน: {
            subDistrict: [
                'บางปะหัน',
                'ขยาย',
                'บางเดื่อ',
                'เสาธง',
                'ทางกลาง',
                'บางเพลิง',
                'หันสัง',
                'บางนางร้า',
                'ตานิม',
                'ทับน้ำ',
                'บ้านม้า',
                'ขวัญเมือง',
                'บ้านลี่',
                'โพธิ์สามต้น',
                'พุทเลา',
                'ตาลเอน',
                'บ้านขล้อ'
            ],
            postalCodes: ['13220']
        },
        ผักไห่: {
            subDistrict: [
                'ผักไห่',
                'อมฤต',
                'บ้านแค',
                'ลาดน้ำเค็ม',
                'ตาลาน',
                'ท่าดินแดง',
                'ดอนลาน',
                'นาคู',
                'กุฎี',
                'ลำตะเคียน',
                'โคกช้าง',
                'จักราช',
                'หนองน้ำใหญ่',
                'ลาดชิด',
                'หน้าโคก',
                'บ้านใหญ่'
            ],
            postalCodes: ['13120', '13280']
        },
        ภาชี: {
            subDistrict: [
                'ภาชี',
                'โคกม่วง',
                'ระโสม',
                'หนองน้ำใส',
                'ดอนหญ้านาง',
                'ไผ่ล้อม',
                'กระจิว',
                'พระแก้ว'
            ],
            postalCodes: ['13140']
        },
        ลาดบัวหลวง: {
            subDistrict: [
                'ลาดบัวหลวง',
                'หลักชัย',
                'สามเมือง',
                'พระยาบันลือ',
                'สิงหนาท',
                'คู้สลอด',
                'คลองพระยาบันลือ'
            ],
            postalCodes: ['13230']
        },
        วังน้อย: {
            subDistrict: [
                'ลำตาเสา',
                'บ่อตาโล่',
                'วังน้อย',
                'ลำไทร',
                'สนับทึบ',
                'พยอม',
                'หันตะเภา',
                'วังจุฬา',
                'ข้าวงาม',
                'ชะแมบ'
            ],
            postalCodes: ['13170']
        },
        เสนา: {
            subDistrict: [
                'เสนา',
                'บ้านแพน',
                'เจ้าเจ็ด',
                'สามกอ',
                'บางนมโค',
                'หัวเวียง',
                'มารวิชัย',
                'บ้านโพธิ์',
                'รางจรเข้',
                'บ้านกระทุ่ม',
                'บ้านแถว',
                'ชายนา',
                'สามตุ่ม',
                'ลาดงา',
                'ดอนทอง',
                'บ้านหลวง',
                'เจ้าเสด็จ'
            ],
            postalCodes: ['13110']
        },
        บางซ้าย: {
            subDistrict: [
                'บางซ้าย',
                'แก้วฟ้า',
                'เต่าเล่า',
                'ปลายกลัด',
                'เทพมงคล',
                'วังพัฒนา'
            ],
            postalCodes: ['13270']
        },
        อุทัย: {
            subDistrict: [
                'คานหาม',
                'บ้านช้าง',
                'สามบัณฑิต',
                'บ้านหีบ',
                'หนองไม้ซุง',
                'อุทัย',
                'เสนา',
                'หนองน้ำส้ม',
                'โพสาวหาญ',
                'ธนู',
                'ข้าวเม่า'
            ],
            postalCodes: ['13210']
        },
        มหาราช: {
            subDistrict: [
                'หัวไผ่',
                'กะทุ่ม',
                'มหาราช',
                'น้ำเต้า',
                'บางนา',
                'โรงช้าง',
                'เจ้าปลุก',
                'พิตเพียน',
                'บ้านนา',
                'บ้านขวาง',
                'ท่าตอ',
                'บ้านใหม่'
            ],
            postalCodes: ['13150']
        },
        บ้านแพรก: {
            subDistrict: [
                'บ้านแพรก',
                'บ้านใหม่',
                'สำพะเนียง',
                'คลองน้อย',
                'สองห้อง'
            ],
            postalCodes: ['13240']
        }
    },
    อ่างทอง: {
        เมืองอ่างทอง: {
            subDistrict: [
                'ตลาดหลวง',
                'บางแก้ว',
                'ศาลาแดง',
                'ป่างิ้ว',
                'บ้านแห',
                'ตลาดกรวด',
                'มหาดไทย',
                'บ้านอิฐ',
                'หัวไผ่',
                'จำปาหล่อ',
                'โพสะ',
                'บ้านรี',
                'คลองวัว',
                'ย่านซื่อ'
            ],
            postalCodes: ['14000']
        },
        ไชโย: {
            subDistrict: [
                'จรเข้ร้อง',
                'ไชยภูมิ',
                'ชัยฤทธิ์',
                'เทวราช',
                'ราชสถิตย์',
                'ไชโย',
                'หลักฟ้า',
                'ชะไว',
                'ตรีณรงค์'
            ],
            postalCodes: ['14140']
        },
        ป่าโมก: {
            subDistrict: [
                'บางปลากด',
                'ป่าโมก',
                'สายทอง',
                'โรงช้าง',
                'บางเสด็จ',
                'นรสิงห์',
                'เอกราช',
                'โผงเผง'
            ],
            postalCodes: ['14130']
        },
        โพธิ์ทอง: {
            subDistrict: [
                'อ่างแก้ว',
                'อินทประมูล',
                'บางพลับ',
                'หนองแม่ไก่',
                'รำมะสัก',
                'บางระกำ',
                'โพธิ์รังนก',
                'องครักษ์',
                'โคกพุทรา',
                'ยางช้าย',
                'บ่อแร่',
                'ทางพระ',
                'สามง่าม',
                'บางเจ้าฉ่า',
                'คำหยาด'
            ],
            postalCodes: ['14120']
        },
        แสวงหา: {
            subDistrict: [
                'แสวงหา',
                'ศรีพราน',
                'บ้านพราน',
                'วังน้ำเย็น',
                'สีบัวทอง',
                'ห้วยไผ่',
                'จำลอง'
            ],
            postalCodes: ['14150']
        },
        วิเศษชัยชาญ: {
            subDistrict: [
                'ไผ่จำศีล',
                'ศาลเจ้าโรงทอง',
                'ไผ่ดำพัฒนา',
                'สาวร้องไห้',
                'ท่าช้าง',
                'ยี่ล้น',
                'บางจัก',
                'ห้วยคันแหลน',
                'คลองขนาก',
                'ไผ่วง',
                'สี่ร้อย',
                'ม่วงเตี้ย',
                'หัวตะพาน',
                'หลักแก้ว',
                'ตลาดใหม่'
            ],
            postalCodes: ['14110']
        },
        สามโก้: {
            subDistrict: [
                'สามโก้',
                'ราษฎรพัฒนา',
                'อบทม',
                'โพธิ์ม่วงพันธ์',
                'มงคลธรรมนิมิต'
            ],
            postalCodes: ['14160']
        }
    },
    ลพบุรี: {
        เมืองลพบุรี: {
            subDistrict: [
                'ทะเลชุบศร',
                'ท่าหิน',
                'กกโก',
                'โก่งธนู',
                'เขาพระงาม',
                'เขาสามยอด',
                'โคกกะเทียม',
                'โคกลำพาน',
                'โคกตูม',
                'งิ้วราย',
                'ดอนโพธิ์',
                'ตะลุง',
                'ท่าแค',
                'ท่าศาลา',
                'นิคมสร้างตนเอง',
                'บางขันหมาก',
                'บ้านข่อย',
                'ท้ายตลาด',
                'ป่าตาล',
                'พรหมมาสตร์',
                'โพธิ์เก้าต้น',
                'โพธิ์ตรุ',
                'สี่คลอง',
                'ถนนใหญ่'
            ],
            postalCodes: ['15000', '13240', '15160', '15210']
        },
        พัฒนานิคม: {
            subDistrict: [
                'พัฒนานิคม',
                'ช่องสาริกา',
                'มะนาวหวาน',
                'ดีลัง',
                'โคกสลุง',
                'ชอนน้อย',
                'หนองบัว',
                'ห้วยขุนราม',
                'น้ำสุด'
            ],
            postalCodes: ['15140', '15220', '18220']
        },
        โคกสำโรง: {
            subDistrict: [
                'โคกสำโรง',
                'เกาะแก้ว',
                'ถลุงเหล็ก',
                'หลุมข้าว',
                'ห้วยโป่ง',
                'คลองเกตุ',
                'สะแกราบ',
                'เพนียด',
                'วังเพลิง',
                'ดงมะรุม',
                'วังขอนขว้าง',
                'วังจั่น',
                'หนองแขม'
            ],
            postalCodes: ['15120']
        },
        ชัยบาดาล: {
            subDistrict: [
                'ลำนารายณ์',
                'ชัยนารายณ์',
                'ศิลาทิพย์',
                'ห้วยหิน',
                'ม่วงค่อม',
                'บัวชุม',
                'ท่าดินดำ',
                'มะกอกหวาน',
                'ซับตะเคียน',
                'นาโสม',
                'หนองยายโต๊ะ',
                'เกาะรัง',
                'ท่ามะนาว',
                'นิคมลำนารายณ์',
                'ชัยบาดาล',
                'บ้านใหม่สามัคคี',
                'เขาแหลม'
            ],
            postalCodes: ['15130', '15230', '15190']
        },
        ท่าวุ้ง: {
            subDistrict: [
                'ท่าวุ้ง',
                'บางคู้',
                'โพตลาดแก้ว',
                'บางลี่',
                'บางงา',
                'โคกสลุด',
                'เขาสมอคอน',
                'หัวสำโรง',
                'ลาดสาลี่',
                'บ้านเบิก',
                'มุจลินท์'
            ],
            postalCodes: ['15150', '15180']
        },
        บ้านหมี่: {
            subDistrict: [
                'ไผ่ใหญ่',
                'บ้านทราย',
                'บ้านกล้วย',
                'ดงพลับ',
                'บ้านชี',
                'พุคา',
                'หินปัก',
                'บางพึ่ง',
                'หนองทรายขาว',
                'บางกะพี้',
                'หนองเต่า',
                'โพนทอง',
                'บางขาม',
                'ดอนดึง',
                'ชอนม่วง',
                'หนองกระเบียน',
                'สายห้วยแก้ว',
                'มหาสอน',
                'บ้านหมี่',
                'เชียงงา',
                'หนองเมือง',
                'สนามแจง'
            ],
            postalCodes: ['15110', '15180']
        },
        ท่าหลวง: {
            subDistrict: [
                'ท่าหลวง',
                'แก่งผักกูด',
                'ซับจำปา',
                'หนองผักแว่น',
                'ทะเลวังวัด',
                'หัวลำ'
            ],
            postalCodes: ['15230']
        },
        สระโบสถ์: {
            subDistrict: [
                'สระโบสถ์',
                'มหาโพธิ',
                'ทุ่งท่าช้าง',
                'ห้วยใหญ่',
                'นิยมชัย'
            ],
            postalCodes: ['15240']
        },
        โคกเจริญ: {
            subDistrict: [
                'โคกเจริญ',
                'ยางราก',
                'หนองมะค่า',
                'วังทอง',
                'โคกแสมสาร'
            ],
            postalCodes: ['15250']
        },
        ลำสนธิ: {
            subDistrict: [
                'ลำสนธิ',
                'ซับสมบูรณ์',
                'หนองรี',
                'กุดตาเพชร',
                'เขารวก',
                'เขาน้อย'
            ],
            postalCodes: ['15190', '15130']
        },
        หนองม่วง: {
            subDistrict: [
                'หนองม่วง',
                'บ่อทอง',
                'ดงดินแดง',
                'ชอนสมบูรณ์',
                'ยางโทน',
                'ชอนสารเดช'
            ],
            postalCodes: ['15170']
        }
    },
    สิงห์บุรี: {
        เมืองสิงห์บุรี: {
            subDistrict: [
                'บางพุทรา',
                'บางมัญ',
                'โพกรวม',
                'ม่วงหมู่',
                'หัวไผ่',
                'ต้นโพธิ์',
                'จักรสีห์',
                'บางกระบือ'
            ],
            postalCodes: ['16000']
        },
        บางระจัน: {
            subDistrict: [
                'สิงห์',
                'ไม้ดัด',
                'เชิงกลัด',
                'โพชนไก่',
                'แม่ลา',
                'บ้านจ่า',
                'พักทัน',
                'สระแจง'
            ],
            postalCodes: ['16130']
        },
        ค่ายบางระจัน: {
            subDistrict: [
                'โพทะเล',
                'บางระจัน',
                'โพสังโฆ',
                'ท่าข้าม',
                'คอทราย',
                'หนองกระทุ่ม'
            ],
            postalCodes: ['16150']
        },
        พรหมบุรี: {
            subDistrict: [
                'พระงาม',
                'พรหมบุรี',
                'บางน้ำเชี่ยว',
                'บ้านหม้อ',
                'บ้านแป้ง',
                'หัวป่า',
                'โรงช้าง'
            ],
            postalCodes: ['16120', '16160']
        },
        ท่าช้าง: {
            subDistrict: ['ถอนสมอ', 'โพประจักษ์', 'วิหารขาว', 'พิกุลทอง'],
            postalCodes: ['16140']
        },
        อินทร์บุรี: {
            subDistrict: [
                'อินทร์บุรี',
                'ประศุก',
                'ทับยา',
                'งิ้วราย',
                'ชีน้ำร้าย',
                'ท่างาม',
                'น้ำตาล',
                'ทองเอน',
                'ห้วยชัน',
                'โพธิ์ชัย'
            ],
            postalCodes: ['16110']
        }
    },
    ชัยนาท: {
        เมืองชัยนาท: {
            subDistrict: [
                'ในเมือง',
                'บ้านกล้วย',
                'ท่าชัย',
                'ชัยนาท',
                'เขาท่าพระ',
                'หาดท่าเสา',
                'ธรรมามูล',
                'เสือโฮก',
                'นางลือ'
            ],
            postalCodes: ['17000']
        },
        มโนรมย์: {
            subDistrict: [
                'คุ้งสำเภา',
                'วัดโคก',
                'ศิลาดาน',
                'ท่าฉนวน',
                'หางน้ำสาคร',
                'ไร่พัฒนา',
                'อู่ตะเภา'
            ],
            postalCodes: ['17110', '17170']
        },
        วัดสิงห์: {
            subDistrict: [
                'วัดสิงห์',
                'มะขามเฒ่า',
                'หนองน้อย',
                'หนองบัว',
                'หนองขุ่น',
                'บ่อแร่',
                'วังหมัน'
            ],
            postalCodes: ['17120']
        },
        สรรพยา: {
            subDistrict: [
                'สรรพยา',
                'ตลุก',
                'เขาแก้ว',
                'โพนางดำตก',
                'โพนางดำออก',
                'บางหลวง',
                'หาดอาษา'
            ],
            postalCodes: ['17150']
        },
        สรรคบุรี: {
            subDistrict: [
                'แพรกศรีราชา',
                'เที่ยงแท้',
                'ห้วยกรด',
                'โพงาม',
                'บางขุด',
                'ดงคอน',
                'ดอนกำ',
                'ห้วยกรดพัฒนา'
            ],
            postalCodes: ['17140']
        },
        หันคา: {
            subDistrict: [
                'หันคา',
                'บ้านเชี่ยน',
                'ไพรนกยูง',
                'หนองแซง',
                'ห้วยงู',
                'วังไก่เถื่อน',
                'เด่นใหญ่',
                'สามง่ามท่าโบสถ์'
            ],
            postalCodes: ['17130', '17160']
        },
        หนองมะโมง: {
            subDistrict: ['หนองมะโมง', 'วังตะเคียน', 'สะพานหิน', 'กุดจอก'],
            postalCodes: ['17120']
        },
        เนินขาม: {
            subDistrict: ['เนินขาม', 'กะบกเตี้ย', 'สุขเดือนห้า'],
            postalCodes: ['17130']
        }
    },
    สระบุรี: {
        เมืองสระบุรี: {
            subDistrict: [
                'ปากเพรียว',
                'ดาวเรือง',
                'นาโฉง',
                'โคกสว่าง',
                'หนองโน',
                'หนองยาว',
                'ปากข้าวสาร',
                'หนองปลาไหล',
                'กุดนกเปล้า',
                'ตลิ่งชัน',
                'ตะกุด'
            ],
            postalCodes: ['18000']
        },
        แก่งคอย: {
            subDistrict: [
                'แก่งคอย',
                'ทับกวาง',
                'ตาลเดี่ยว',
                'ห้วยแห้ง',
                'ท่าคล้อ',
                'หินซ้อน',
                'บ้านธาตุ',
                'บ้านป่า',
                'ท่าตูม',
                'ชะอม',
                'สองคอน',
                'เตาปูน',
                'ชำผักแพว',
                'ท่ามะปราง'
            ],
            postalCodes: ['18110', '18260']
        },
        หนองแค: {
            subDistrict: [
                'หนองแค',
                'กุ่มหัก',
                'คชสิทธิ์',
                'โคกตูม',
                'โคกแย้',
                'บัวลอย',
                'ไผ่ต่ำ',
                'โพนทอง',
                'ห้วยขมิ้น',
                'ห้วยทราย',
                'หนองไข่น้ำ',
                'หนองแขม',
                'หนองจิก',
                'หนองจรเข้',
                'หนองนาก',
                'หนองปลาหมอ',
                'หนองปลิง',
                'หนองโรง'
            ],
            postalCodes: ['18140', '18250', '18230']
        },
        วิหารแดง: {
            subDistrict: [
                'หนองหมู',
                'บ้านลำ',
                'คลองเรือ',
                'วิหารแดง',
                'หนองสรวง',
                'เจริญธรรม'
            ],
            postalCodes: ['18150']
        },
        หนองแซง: {
            subDistrict: [
                'หนองแซง',
                'หนองควายโซ',
                'หนองหัวโพ',
                'หนองสีดา',
                'หนองกบ',
                'ไก่เส่า',
                'โคกสะอาด',
                'ม่วงหวาน',
                'เขาดิน'
            ],
            postalCodes: ['18170']
        },
        บ้านหมอ: {
            subDistrict: [
                'บ้านหมอ',
                'บางโขมด',
                'สร่างโศก',
                'ตลาดน้อย',
                'หรเทพ',
                'โคกใหญ่',
                'ไผ่ขวาง',
                'บ้านครัว',
                'หนองบัว'
            ],
            postalCodes: ['18130', '18270']
        },
        ดอนพุด: {
            subDistrict: ['ดอนพุด', 'ไผ่หลิ่ว', 'บ้านหลวง', 'ดงตะงาว'],
            postalCodes: ['18210']
        },
        หนองโดน: {
            subDistrict: ['หนองโดน', 'บ้านกลับ', 'ดอนทอง', 'บ้านโปร่ง'],
            postalCodes: ['18190']
        },
        พระพุทธบาท: {
            subDistrict: [
                'พระพุทธบาท',
                'ขุนโขลน',
                'ธารเกษม',
                'นายาว',
                'พุคำจาน',
                'เขาวง',
                'ห้วยป่าหวาย',
                'พุกร่าง',
                'หนองแก'
            ],
            postalCodes: ['18120']
        },
        เสาไห้: {
            subDistrict: [
                'เสาไห้',
                'บ้านยาง',
                'หัวปลวก',
                'งิ้วงาม',
                'ศาลารีไทย',
                'ต้นตาล',
                'ท่าช้าง',
                'พระยาทด',
                'ม่วงงาม',
                'เริงราง',
                'เมืองเก่า',
                'สวนดอกไม้'
            ],
            postalCodes: ['18160']
        },
        มวกเหล็ก: {
            subDistrict: [
                'มวกเหล็ก',
                'มิตรภาพ',
                'หนองย่างเสือ',
                'ลำสมพุง',
                'ลำพญากลาง',
                'ซับสนุ่น'
            ],
            postalCodes: ['18180', '30130', '18220']
        },
        วังม่วง: {
            subDistrict: ['แสลงพัน', 'คำพราน', 'วังม่วง'],
            postalCodes: ['18220']
        },
        เฉลิมพระเกียรติ: {
            subDistrict: [
                'เขาดินพัฒนา',
                'บ้านแก้ง',
                'ผึ้งรวง',
                'พุแค',
                'ห้วยบง',
                'หน้าพระลาน'
            ],
            postalCodes: ['18000', '18240']
        }
    },
    ชลบุรี: {
        เมืองชลบุรี: {
            subDistrict: [
                'บางปลาสร้อย',
                'มะขามหย่ง',
                'บ้านโขด',
                'แสนสุข',
                'บ้านสวน',
                'หนองรี',
                'นาป่า',
                'หนองข้างคอก',
                'ดอนหัวฬ่อ',
                'หนองไม้แดง',
                'บางทราย',
                'คลองตำหรุ',
                'เหมือง',
                'บ้านปึก',
                'ห้วยกะปิ',
                'เสม็ด',
                'อ่างศิลา',
                'สำนักบก'
            ],
            postalCodes: ['20000', '20130']
        },
        บ้านบึง: {
            subDistrict: [
                'บ้านบึง',
                'คลองกิ่ว',
                'มาบไผ่',
                'หนองซ้ำซาก',
                'หนองบอนแดง',
                'หนองชาก',
                'หนองอิรุณ',
                'หนองไผ่แก้ว'
            ],
            postalCodes: ['20170', '20220']
        },
        หนองใหญ่: {
            subDistrict: [
                'หนองใหญ่',
                'คลองพลู',
                'หนองเสือช้าง',
                'ห้างสูง',
                'เขาซก'
            ],
            postalCodes: ['20190']
        },
        บางละมุง: {
            subDistrict: [
                'บางละมุง',
                'หนองปรือ',
                'หนองปลาไหล',
                'โป่ง',
                'เขาไม้แก้ว',
                'ห้วยใหญ่',
                'ตะเคียนเตี้ย',
                'นาเกลือ'
            ],
            postalCodes: ['20150']
        },
        พานทอง: {
            subDistrict: [
                'พานทอง',
                'หนองตำลึง',
                'มาบโป่ง',
                'หนองกะขะ',
                'หนองหงษ์',
                'โคกขี้หนอน',
                'บ้านเก่า',
                'หน้าประดู่',
                'บางนาง',
                'เกาะลอย',
                'บางหัก'
            ],
            postalCodes: ['20160']
        },
        พนัสนิคม: {
            subDistrict: [
                'พนัสนิคม',
                'หน้าพระธาตุ',
                'วัดหลวง',
                'บ้านเซิด',
                'นาเริก',
                'หมอนนาง',
                'สระสี่เหลี่ยม',
                'วัดโบสถ์',
                'กุฎโง้ง',
                'หัวถนน',
                'ท่าข้าม',
                'หนองปรือ',
                'หนองขยาด',
                'ทุ่งขวาง',
                'หนองเหียง',
                'นาวังหิน',
                'บ้านช้าง',
                'โคกเพลาะ',
                'ไร่หลักทอง',
                'นามะตูม'
            ],
            postalCodes: ['20140']
        },
        ศรีราชา: {
            subDistrict: [
                'ศรีราชา',
                'สุรศักดิ์',
                'ทุ่งสุขลา',
                'บึง',
                'หนองขาม',
                'เขาคันทรง',
                'บางพระ',
                'บ่อวิน'
            ],
            postalCodes: ['20110', '20230']
        },
        เกาะสีชัง: {
            subDistrict: ['ท่าเทววงษ์'],
            postalCodes: ['20120']
        },
        สัตหีบ: {
            subDistrict: [
                'สัตหีบ',
                'นาจอมเทียน',
                'พลูตาหลวง',
                'บางเสร่',
                'แสมสาร'
            ],
            postalCodes: ['20180', '20250']
        },
        บ่อทอง: {
            subDistrict: [
                'บ่อทอง',
                'วัดสุวรรณ',
                'บ่อกวางทอง',
                'ธาตุทอง',
                'เกษตรสุวรรณ',
                'พลวงทอง'
            ],
            postalCodes: ['20270']
        },
        เกาะจันทร์: {
            subDistrict: ['เกาะจันทร์', 'ท่าบุญมี'],
            postalCodes: ['20240']
        }
    },
    ระยอง: {
        เมืองระยอง: {
            subDistrict: [
                'ท่าประดู่',
                'เชิงเนิน',
                'ตะพง',
                'ปากน้ำ',
                'เพ',
                'แกลง',
                'บ้านแลง',
                'นาตาขวัญ',
                'เนินพระ',
                'กะเฉด',
                'ทับมา',
                'น้ำคอก',
                'ห้วยโป่ง',
                'มาบตาพุด',
                'สำนักทอง'
            ],
            postalCodes: ['21000', '21160', '21100', '21150']
        },
        บ้านฉาง: {
            subDistrict: ['สำนักท้อน', 'พลา', 'บ้านฉาง'],
            postalCodes: ['21130']
        },
        แกลง: {
            subDistrict: [
                'ทางเกวียน',
                'วังหว้า',
                'ชากโดน',
                'เนินฆ้อ',
                'กร่ำ',
                'ชากพง',
                'กระแสบน',
                'บ้านนา',
                'ทุ่งควายกิน',
                'กองดิน',
                'คลองปูน',
                'พังราด',
                'ปากน้ำกระแส',
                'ห้วยยาง',
                'สองสลึง'
            ],
            postalCodes: ['21110', '21190', '22160', '21170']
        },
        วังจันทร์: {
            subDistrict: ['วังจันทร์', 'ชุมแสง', 'ป่ายุบใน', 'พลงตาเอี่ยม'],
            postalCodes: ['21210']
        },
        บ้านค่าย: {
            subDistrict: [
                'บ้านค่าย',
                'หนองละลอก',
                'หนองตะพาน',
                'ตาขัน',
                'บางบุตร',
                'หนองบัว',
                'ชากบก'
            ],
            postalCodes: ['21120']
        },
        ปลวกแดง: {
            subDistrict: [
                'ปลวกแดง',
                'ตาสิทธิ์',
                'ละหาร',
                'แม่น้ำคู้',
                'มาบยางพร',
                'หนองไร่'
            ],
            postalCodes: ['21140']
        },
        เขาชะเมา: {
            subDistrict: ['น้ำเป็น', 'ห้วยทับมอญ', 'ชำฆ้อ', 'เขาน้อย'],
            postalCodes: ['21110']
        },
        นิคมพัฒนา: {
            subDistrict: ['นิคมพัฒนา', 'มาบข่า', 'พนานิคม', 'มะขามคู่'],
            postalCodes: ['21180']
        }
    },
    จันทบุรี: {
        เมืองจันทบุรี: {
            subDistrict: [
                'ตลาด',
                'วัดใหม่',
                'คลองนารายณ์',
                'เกาะขวาง',
                'คมบาง',
                'ท่าช้าง',
                'จันทนิมิต',
                'บางกะจะ',
                'แสลง',
                'หนองบัว',
                'พลับพลา'
            ],
            postalCodes: ['22000']
        },
        ขลุง: {
            subDistrict: [
                'ขลุง',
                'บ่อ',
                'เกวียนหัก',
                'ตะปอน',
                'บางชัน',
                'วันยาว',
                'ซึ้ง',
                'มาบไพ',
                'วังสรรพรส',
                'ตรอกนอง',
                'ตกพรม',
                'บ่อเวฬุ'
            ],
            postalCodes: ['22110', '22150']
        },
        ท่าใหม่: {
            subDistrict: [
                'ท่าใหม่',
                'ยายร้า',
                'สีพยา',
                'บ่อพุ',
                'พลอยแหวน',
                'เขาวัว',
                'เขาบายศรี',
                'สองพี่น้อง',
                'ทุ่งเบญจา',
                'รำพัน',
                'โขมง',
                'ตะกาดเง้า',
                'คลองขุด',
                'เขาแก้ว'
            ],
            postalCodes: ['22120', '22170']
        },
        โป่งน้ำร้อน: {
            subDistrict: [
                'ทับไทร',
                'โป่งน้ำร้อน',
                'หนองตาคง',
                'เทพนิมิต',
                'คลองใหญ่'
            ],
            postalCodes: ['22140']
        },
        มะขาม: {
            subDistrict: [
                'มะขาม',
                'ท่าหลวง',
                'ปัถวี',
                'วังแซ้ม',
                'ฉมัน',
                'อ่างคีรี'
            ],
            postalCodes: ['22150']
        },
        แหลมสิงห์: {
            subDistrict: [
                'ปากน้ำแหลมสิงห์',
                'เกาะเปริด',
                'หนองชิ่ม',
                'พลิ้ว',
                'คลองน้ำเค็ม',
                'บางสระเก้า',
                'บางกะไชย'
            ],
            postalCodes: ['22130', '22190', '22120']
        },
        สอยดาว: {
            subDistrict: ['ปะตง', 'ทุ่งขนาน', 'ทับช้าง', 'ทรายขาว', 'สะตอน'],
            postalCodes: ['22180']
        },
        แก่งหางแมว: {
            subDistrict: [
                'แก่งหางแมว',
                'ขุนซ่อง',
                'สามพี่น้อง',
                'พวา',
                'เขาวงกต'
            ],
            postalCodes: ['22160']
        },
        นายายอาม: {
            subDistrict: [
                'นายายอาม',
                'วังโตนด',
                'กระแจะ',
                'สนามไชย',
                'ช้างข้าม',
                'วังใหม่'
            ],
            postalCodes: ['22160', '22170']
        },
        เขาคิชฌกูฏ: {
            subDistrict: [
                'ชากไทย',
                'พลวง',
                'ตะเคียนทอง',
                'คลองพลู',
                'จันทเขลม'
            ],
            postalCodes: ['22210']
        }
    },
    ตราด: {
        เมืองตราด: {
            subDistrict: [
                'บางพระ',
                'หนองเสม็ด',
                'หนองโสน',
                'หนองคันทรง',
                'ห้วงน้ำขาว',
                'อ่าวใหญ่',
                'วังกระแจะ',
                'ห้วยแร้ง',
                'เนินทราย',
                'ท่าพริก',
                'ท่ากุ่ม',
                'ตะกาง',
                'ชำราก',
                'แหลมกลัด'
            ],
            postalCodes: ['23000']
        },
        คลองใหญ่: {
            subDistrict: ['คลองใหญ่', 'ไม้รูด', 'หาดเล็ก'],
            postalCodes: ['23110']
        },
        เขาสมิง: {
            subDistrict: [
                'เขาสมิง',
                'แสนตุ้ง',
                'วังตะเคียน',
                'ท่าโสม',
                'สะตอ',
                'ประณีต',
                'เทพนิมิต',
                'ทุ่งนนทรี'
            ],
            postalCodes: ['23130', '23150']
        },
        บ่อไร่: {
            subDistrict: [
                'บ่อพลอย',
                'ช้างทูน',
                'ด่านชุมพล',
                'หนองบอน',
                'นนทรีย์'
            ],
            postalCodes: ['23140']
        },
        แหลมงอบ: {
            subDistrict: ['แหลมงอบ', 'น้ำเชี่ยว', 'บางปิด', 'คลองใหญ่'],
            postalCodes: ['23120']
        },
        เกาะกูด: {
            subDistrict: ['เกาะหมาก', 'เกาะกูด'],
            postalCodes: ['23120', '23000']
        },
        เกาะช้าง: {
            subDistrict: ['เกาะช้าง', 'เกาะช้างใต้'],
            postalCodes: ['23170']
        }
    },
    ฉะเชิงเทรา: {
        เมืองฉะเชิงเทรา: {
            subDistrict: [
                'หน้าเมือง',
                'ท่าไข่',
                'บ้านใหม่',
                'คลองนา',
                'บางตีนเป็ด',
                'บางไผ่',
                'คลองจุกกระเฌอ',
                'บางแก้ว',
                'บางขวัญ',
                'คลองนครเนื่องเขต',
                'วังตะเคียน',
                'โสธร',
                'บางพระ',
                'บางกะไห',
                'หนามแดง',
                'คลองเปรง',
                'คลองอุดมชลจร',
                'คลองหลวงแพ่ง',
                'บางเตย'
            ],
            postalCodes: ['24000']
        },
        บางคล้า: {
            subDistrict: [
                'บางคล้า',
                'บางสวน',
                'บางกระเจ็ด',
                'ปากน้ำ',
                'ท่าทองหลาง',
                'สาวชะโงก',
                'เสม็ดเหนือ',
                'เสม็ดใต้',
                'หัวไทร'
            ],
            postalCodes: ['24110']
        },
        บางน้ำเปรี้ยว: {
            subDistrict: [
                'บางน้ำเปรี้ยว',
                'บางขนาก',
                'สิงโตทอง',
                'หมอนทอง',
                'บึงน้ำรักษ์',
                'ดอนเกาะกา',
                'โยธะกา',
                'ดอนฉิมพลี',
                'ศาลาแดง',
                'โพรงอากาศ'
            ],
            postalCodes: ['24150', '24170', '24000']
        },
        บางปะกง: {
            subDistrict: [
                'บางปะกง',
                'ท่าสะอ้าน',
                'บางวัว',
                'บางสมัคร',
                'บางผึ้ง',
                'บางเกลือ',
                'สองคลอง',
                'หนองจอก',
                'พิมพา',
                'ท่าข้าม',
                'หอมศีล',
                'เขาดิน'
            ],
            postalCodes: ['24130', '24180']
        },
        บ้านโพธิ์: {
            subDistrict: [
                'บ้านโพธิ์',
                'เกาะไร่',
                'คลองขุด',
                'คลองบ้านโพธิ์',
                'คลองประเวศ',
                'ดอนทราย',
                'เทพราช',
                'ท่าพลับ',
                'หนองตีนนก',
                'หนองบัว',
                'บางซ่อน',
                'บางกรูด',
                'แหลมประดู่',
                'ลาดขวาง',
                'สนามจันทร์',
                'แสนภูดาษ',
                'สิบเอ็ดศอก'
            ],
            postalCodes: ['24140']
        },
        พนมสารคาม: {
            subDistrict: [
                'เกาะขนุน',
                'บ้านซ่อง',
                'พนมสารคาม',
                'เมืองเก่า',
                'หนองยาว',
                'ท่าถ่าน',
                'หนองแหน',
                'เขาหินซ้อน'
            ],
            postalCodes: ['24120']
        },
        ราชสาส์น: {
            subDistrict: ['บางคา', 'เมืองใหม่', 'ดงน้อย'],
            postalCodes: ['24120']
        },
        สนามชัยเขต: {
            subDistrict: ['คู้ยายหมี', 'ท่ากระดาน', 'ทุ่งพระยา', 'ลาดกระทิง'],
            postalCodes: ['24160']
        },
        แปลงยาว: {
            subDistrict: ['แปลงยาว', 'วังเย็น', 'หัวสำโรง', 'หนองไม้แก่น'],
            postalCodes: ['24190']
        },
        ท่าตะเกียบ: {
            subDistrict: ['ท่าตะเกียบ', 'คลองตะเกรา'],
            postalCodes: ['24160']
        },
        คลองเขื่อน: {
            subDistrict: [
                'ก้อนแก้ว',
                'คลองเขื่อน',
                'บางเล่า',
                'บางโรง',
                'บางตลาด'
            ],
            postalCodes: ['24000', '24110']
        }
    },
    ปราจีนบุรี: {
        เมืองปราจีนบุรี: {
            subDistrict: [
                'หน้าเมือง',
                'รอบเมือง',
                'วัดโบสถ์',
                'บางเดชะ',
                'ท่างาม',
                'บางบริบูรณ์',
                'ดงพระราม',
                'บ้านพระ',
                'โคกไม้ลาย',
                'ไม้เค็ด',
                'ดงขี้เหล็ก',
                'เนินหอม',
                'โนนห้อม'
            ],
            postalCodes: ['25000', '25230']
        },
        กบินทร์บุรี: {
            subDistrict: [
                'กบินทร์',
                'เมืองเก่า',
                'วังดาล',
                'นนทรี',
                'ย่านรี',
                'วังตะเคียน',
                'หาดนางแก้ว',
                'ลาดตะเคียน',
                'บ้านนา',
                'บ่อทอง',
                'หนองกี่',
                'นาแขม',
                'เขาไม้แก้ว',
                'วังท่าช้าง'
            ],
            postalCodes: ['25110', '25240']
        },
        นาดี: {
            subDistrict: [
                'นาดี',
                'สำพันตา',
                'สะพานหิน',
                'ทุ่งโพธิ์',
                'แก่งดินสอ',
                'บุพราหมณ์'
            ],
            postalCodes: ['25220']
        },
        บ้านสร้าง: {
            subDistrict: [
                'บ้านสร้าง',
                'บางกระเบา',
                'บางเตย',
                'บางยาง',
                'บางแตน',
                'บางพลวง',
                'บางปลาร้า',
                'บางขาม',
                'กระทุ่มแพ้ว'
            ],
            postalCodes: ['25150']
        },
        ประจันตคาม: {
            subDistrict: [
                'ประจันตคาม',
                'เกาะลอย',
                'บ้านหอย',
                'หนองแสง',
                'ดงบัง',
                'คำโตนด',
                'บุฝ้าย',
                'หนองแก้ว',
                'โพธิ์งาม'
            ],
            postalCodes: ['25130']
        },
        ศรีมหาโพธิ: {
            subDistrict: [
                'ศรีมหาโพธิ',
                'สัมพันธ์',
                'บ้านทาม',
                'ท่าตูม',
                'บางกุ้ง',
                'ดงกระทงยาม',
                'หนองโพรง',
                'หัวหว้า',
                'หาดยาง',
                'กรอกสมบูรณ์'
            ],
            postalCodes: ['25140']
        },
        ศรีมโหสถ: {
            subDistrict: ['โคกปีบ', 'โคกไทย', 'คู้ลำพัน', 'ไผ่ชะเลือด'],
            postalCodes: ['25190']
        }
    },
    นครนายก: {
        เมืองนครนายก: {
            subDistrict: [
                'นครนายก',
                'ท่าช้าง',
                'บ้านใหญ่',
                'วังกระโจม',
                'ท่าทราย',
                'ดอนยอ',
                'ศรีจุฬา',
                'ดงละคร',
                'ศรีนาวา',
                'สาริกา',
                'หินตั้ง',
                'เขาพระ',
                'พรหมณี'
            ],
            postalCodes: ['26000']
        },
        ปากพลี: {
            subDistrict: [
                'เกาะหวาย',
                'เกาะโพธิ์',
                'ปากพลี',
                'โคกกรวด',
                'ท่าเรือ',
                'หนองแสง',
                'นาหินลาด'
            ],
            postalCodes: ['26130']
        },
        บ้านนา: {
            subDistrict: [
                'บ้านนา',
                'บ้านพร้าว',
                'บ้านพริก',
                'อาษา',
                'ทองหลาง',
                'บางอ้อ',
                'พิกุลออก',
                'ป่าขะ',
                'เขาเพิ่ม',
                'ศรีกะอาง'
            ],
            postalCodes: ['26110']
        },
        องครักษ์: {
            subDistrict: [
                'พระอาจารย์',
                'บึงศาล',
                'ศีรษะกระบือ',
                'โพธิ์แทน',
                'บางสมบูรณ์',
                'ทรายมูล',
                'บางปลากด',
                'บางลูกเสือ',
                'องครักษ์',
                'ชุมพล',
                'คลองใหญ่'
            ],
            postalCodes: ['26120']
        }
    },
    สระแก้ว: {
        เมืองสระแก้ว: {
            subDistrict: [
                'สระแก้ว',
                'บ้านแก้ง',
                'ศาลาลำดวน',
                'โคกปี่ฆ้อง',
                'ท่าแยก',
                'ท่าเกษม',
                'สระขวัญ',
                'หนองบอน'
            ],
            postalCodes: ['27000']
        },
        คลองหาด: {
            subDistrict: [
                'คลองหาด',
                'ไทยอุดม',
                'ซับมะกรูด',
                'ไทรเดี่ยว',
                'คลองไก่เถื่อน',
                'เบญจขร',
                'ไทรทอง'
            ],
            postalCodes: ['27260']
        },
        ตาพระยา: {
            subDistrict: ['ตาพระยา', 'ทัพเสด็จ', 'ทัพราช', 'ทัพไทย', 'โคคลาน'],
            postalCodes: ['27180']
        },
        วังน้ำเย็น: {
            subDistrict: [
                'วังน้ำเย็น',
                'ตาหลังใน',
                'คลองหินปูน',
                'ทุ่งมหาเจริญ'
            ],
            postalCodes: ['27210']
        },
        วัฒนานคร: {
            subDistrict: [
                'วัฒนานคร',
                'ท่าเกวียน',
                'ผักขะ',
                'โนนหมากเค็ง',
                'หนองน้ำใส',
                'ช่องกุ่ม',
                'หนองแวง',
                'แซร์ออ',
                'หนองหมากฝ้าย',
                'หนองตะเคียนบอน',
                'ห้วยโจด'
            ],
            postalCodes: ['27160']
        },
        อรัญประเทศ: {
            subDistrict: [
                'อรัญประเทศ',
                'เมืองไผ่',
                'หันทราย',
                'คลองน้ำใส',
                'ท่าข้าม',
                'ป่าไร่',
                'ทับพริก',
                'บ้านใหม่หนองไทร',
                'ผ่านศึก',
                'หนองสังข์',
                'คลองทับจันทร์',
                'ฟากห้วย',
                'บ้านด่าน'
            ],
            postalCodes: ['27120']
        },
        เขาฉกรรจ์: {
            subDistrict: ['เขาฉกรรจ์', 'หนองหว้า', 'พระเพลิง', 'เขาสามสิบ'],
            postalCodes: ['27000']
        },
        โคกสูง: {
            subDistrict: ['โคกสูง', 'หนองม่วง', 'หนองแวง', 'โนนหมากมุ่น'],
            postalCodes: ['27120']
        },
        วังสมบูรณ์: {
            subDistrict: ['วังสมบูรณ์', 'วังใหม่', 'วังทอง'],
            postalCodes: ['27250']
        }
    },
    นครราชสีมา: {
        เมืองนครราชสีมา: {
            subDistrict: [
                'ในเมือง',
                'โพธิ์กลาง',
                'หนองจะบก',
                'โคกสูง',
                'มะเริง',
                'หนองระเวียง',
                'ปรุใหญ่',
                'หมื่นไวย',
                'พลกรัง',
                'หนองไผ่ล้อม',
                'หัวทะเล',
                'บ้านเกาะ',
                'บ้านใหม่',
                'พุดซา',
                'บ้านโพธิ์',
                'จอหอ',
                'โคกกรวด',
                'ไชยมงคล',
                'หนองบัวศาลา',
                'สุรนารี',
                'สีมุม',
                'ตลาด',
                'พะเนา',
                'หนองกระทุ่ม',
                'หนองไข่น้ำ'
            ],
            postalCodes: ['30000', '30310', '30280']
        },
        ครบุรี: {
            subDistrict: [
                'แชะ',
                'เฉลียง',
                'ครบุรี',
                'โคกกระชาย',
                'จระเข้หิน',
                'มาบตะโกเอน',
                'อรพิมพ์',
                'บ้านใหม่',
                'ลำเพียก',
                'ครบุรีใต้',
                'ตะแบกบาน',
                'สระว่านพระยา'
            ],
            postalCodes: ['30250']
        },
        เสิงสาง: {
            subDistrict: [
                'เสิงสาง',
                'สระตะเคียน',
                'โนนสมบูรณ์',
                'กุดโบสถ์',
                'สุขไพบูลย์',
                'บ้านราษฎร์'
            ],
            postalCodes: ['30330']
        },
        คง: {
            subDistrict: [
                'เมืองคง',
                'คูขาด',
                'เทพาลัย',
                'ตาจั่น',
                'บ้านปรางค์',
                'หนองมะนาว',
                'หนองบัว',
                'โนนเต็ง',
                'ดอนใหญ่',
                'ขามสมบูรณ์'
            ],
            postalCodes: ['30260']
        },
        บ้านเหลื่อม: {
            subDistrict: ['บ้านเหลื่อม', 'วังโพธิ์', 'โคกกระเบื้อง', 'ช่อระกา'],
            postalCodes: ['30350']
        },
        จักราช: {
            subDistrict: [
                'จักราช',
                'ทองหลาง',
                'สีสุก',
                'หนองขาม',
                'หนองพลวง',
                'ศรีละกอ',
                'คลองเมือง',
                'หินโคน'
            ],
            postalCodes: ['30230']
        },
        โชคชัย: {
            subDistrict: [
                'กระโทก',
                'พลับพลา',
                'ท่าอ่าง',
                'ทุ่งอรุณ',
                'ท่าลาดขาว',
                'ท่าจะหลุง',
                'ท่าเยี่ยม',
                'โชคชัย',
                'ละลมใหม่พัฒนา',
                'ด่านเกวียน'
            ],
            postalCodes: ['30190']
        },
        ด่านขุนทด: {
            subDistrict: [
                'กุดพิมาน',
                'ด่านขุนทด',
                'ด่านนอก',
                'ด่านใน',
                'ตะเคียน',
                'บ้านเก่า',
                'บ้านแปรง',
                'พันชนะ',
                'สระจรเข้',
                'หนองกราด',
                'หนองบัวตะเกียด',
                'หนองบัวละคร',
                'หินดาด',
                'ห้วยบง',
                'โนนเมืองพัฒนา',
                'หนองไทร'
            ],
            postalCodes: ['30210', '36220']
        },
        โนนไทย: {
            subDistrict: [
                'โนนไทย',
                'ด่านจาก',
                'กำปัง',
                'สำโรง',
                'ค้างพลู',
                'บ้านวัง',
                'บัลลังก์',
                'สายออ',
                'ถนนโพธิ์',
                'มะค่า'
            ],
            postalCodes: ['30220']
        },
        โนนสูง: {
            subDistrict: [
                'โนนสูง',
                'ใหม่',
                'โตนด',
                'บิง',
                'ดอนชมพู',
                'ธารปราสาท',
                'หลุมข้าว',
                'มะค่า',
                'พลสงคราม',
                'จันอัด',
                'ขามเฒ่า',
                'ด่านคล้า',
                'ลำคอหงษ์',
                'เมืองปราสาท',
                'ดอนหวาย',
                'ลำมูล'
            ],
            postalCodes: ['30160', '30420']
        },
        ขามสะแกแสง: {
            subDistrict: [
                'ขามสะแกแสง',
                'โนนเมือง',
                'เมืองนาท',
                'ชีวึก',
                'พะงาด',
                'หนองหัวฟาน',
                'เมืองเกษตร'
            ],
            postalCodes: ['30290']
        },
        บัวใหญ่: {
            subDistrict: [
                'บัวใหญ่',
                'ห้วยยาง',
                'เสมาใหญ่',
                'ดอนตะหนิน',
                'หนองบัวสะอาด',
                'โนนทองหลาง',
                'กุดจอก',
                'ด่านช้าง',
                'ขุนทอง',
                'หนองแจ้งใหญ่'
            ],
            postalCodes: ['30120']
        },
        ประทาย: {
            subDistrict: [
                'ประทาย',
                'กระทุ่มราย',
                'วังไม้แดง',
                'ตลาดไทร',
                'หนองพลวง',
                'หนองค่าย',
                'หันห้วยทราย',
                'ดอนมัน',
                'นางรำ',
                'โนนเพ็ด',
                'ทุ่งสว่าง',
                'โคกกลาง',
                'เมืองโดน'
            ],
            postalCodes: ['30180']
        },
        ปักธงชัย: {
            subDistrict: [
                'เมืองปัก',
                'ตะคุ',
                'โคกไทย',
                'สำโรง',
                'ตะขบ',
                'นกออก',
                'ดอน',
                'ตูม',
                'งิ้ว',
                'สะแกราช',
                'ลำนางแก้ว',
                'ภูหลวง',
                'ธงชัยเหนือ',
                'สุขเกษม',
                'เกษมทรัพย์',
                'บ่อปลาทอง'
            ],
            postalCodes: ['30150']
        },
        พิมาย: {
            subDistrict: [
                'ในเมือง',
                'สัมฤทธิ์',
                'โบสถ์',
                'กระเบื้องใหญ่',
                'ท่าหลวง',
                'รังกาใหญ่',
                'ชีวาน',
                'นิคมสร้างตนเอง',
                'กระชอน',
                'ดงใหญ่',
                'ธารละหลอด',
                'หนองระเวียง'
            ],
            postalCodes: ['30110']
        },
        ห้วยแถลง: {
            subDistrict: [
                'ห้วยแถลง',
                'ทับสวาย',
                'เมืองพลับพลา',
                'หลุ่งตะเคียน',
                'หินดาด',
                'งิ้ว',
                'กงรถ',
                'หลุ่งประดู่',
                'ตะโก',
                'ห้วยแคน'
            ],
            postalCodes: ['30240']
        },
        ชุมพวง: {
            subDistrict: [
                'ชุมพวง',
                'ประสุข',
                'ท่าลาด',
                'สาหร่าย',
                'ตลาดไทร',
                'โนนรัง',
                'หนองหลัก',
                'โนนตูม',
                'โนนยอ'
            ],
            postalCodes: ['30270']
        },
        สูงเนิน: {
            subDistrict: [
                'สูงเนิน',
                'เสมา',
                'โคราช',
                'บุ่งขี้เหล็ก',
                'โนนค่า',
                'โค้งยาง',
                'มะเกลือเก่า',
                'มะเกลือใหม่',
                'นากลาง',
                'หนองตะไก้',
                'กุดจิก'
            ],
            postalCodes: ['30170', '30380']
        },
        ขามทะเลสอ: {
            subDistrict: [
                'ขามทะเลสอ',
                'โป่งแดง',
                'พันดุง',
                'หนองสรวง',
                'บึงอ้อ'
            ],
            postalCodes: ['30280']
        },
        สีคิ้ว: {
            subDistrict: [
                'สีคิ้ว',
                'บ้านหัน',
                'กฤษณา',
                'ลาดบัวขาว',
                'หนองหญ้าขาว',
                'กุดน้อย',
                'หนองน้ำใส',
                'วังโรงใหญ่',
                'มิตรภาพ',
                'คลองไผ่',
                'ดอนเมือง',
                'หนองบัวน้อย'
            ],
            postalCodes: ['30140', '30340']
        },
        ปากช่อง: {
            subDistrict: [
                'ปากช่อง',
                'กลางดง',
                'จันทึก',
                'วังกะทะ',
                'หมูสี',
                'หนองสาหร่าย',
                'ขนงพระ',
                'โป่งตาลอง',
                'คลองม่วง',
                'หนองน้ำแดง',
                'วังไทร',
                'พญาเย็น'
            ],
            postalCodes: ['30130', '30320']
        },
        หนองบุญมาก: {
            subDistrict: [
                'หนองบุนนาก',
                'สารภี',
                'ไทยเจริญ',
                'หนองหัวแรต',
                'แหลมทอง',
                'หนองตะไก้',
                'ลุงเขว้า',
                'หนองไม้ไผ่',
                'บ้านใหม่'
            ],
            postalCodes: ['30410']
        },
        แก้งสนามนาง: {
            subDistrict: [
                'แก้งสนามนาง',
                'โนนสำราญ',
                'บึงพะไล',
                'สีสุก',
                'บึงสำโรง'
            ],
            postalCodes: ['30440']
        },
        โนนแดง: {
            subDistrict: [
                'โนนแดง',
                'โนนตาเถร',
                'สำพะเนียง',
                'วังหิน',
                'ดอนยาวใหญ่'
            ],
            postalCodes: ['30360']
        },
        วังน้ำเขียว: {
            subDistrict: [
                'วังน้ำเขียว',
                'วังหมี',
                'ระเริง',
                'อุดมทรัพย์',
                'ไทยสามัคคี'
            ],
            postalCodes: ['30370', '30150']
        },
        เทพารักษ์: {
            subDistrict: ['สำนักตะคร้อ', 'หนองแวง', 'บึงปรือ', 'วังยายทอง'],
            postalCodes: ['30210']
        },
        เมืองยาง: {
            subDistrict: [
                'เมืองยาง',
                'กระเบื้องนอก',
                'ละหานปลาค้าว',
                'โนนอุดม'
            ],
            postalCodes: ['30270']
        },
        พระทองคำ: {
            subDistrict: [
                'สระพระ',
                'มาบกราด',
                'พังเทียม',
                'ทัพรั้ง',
                'หนองหอย'
            ],
            postalCodes: ['30220']
        },
        ลำทะเมนชัย: {
            subDistrict: ['ขุย', 'บ้านยาง', 'ช่องแมว', 'ไพล'],
            postalCodes: ['30270']
        },
        บัวลาย: {
            subDistrict: ['เมืองพะไล', 'โนนจาน', 'บัวลาย', 'หนองหว้า'],
            postalCodes: ['30120']
        },
        สีดา: {
            subDistrict: [
                'สีดา',
                'โพนทอง',
                'โนนประดู่',
                'สามเมือง',
                'หนองตาดใหญ่'
            ],
            postalCodes: ['30430']
        },
        เฉลิมพระเกียรติ: {
            subDistrict: [
                'ช้างทอง',
                'ท่าช้าง',
                'พระพุทธ',
                'หนองงูเหลือม',
                'หนองยาง'
            ],
            postalCodes: ['30230', '30000']
        }
    },
    บุรีรัมย์: {
        เมืองบุรีรัมย์: {
            subDistrict: [
                'ในเมือง',
                'อิสาณ',
                'เสม็ด',
                'บ้านบัว',
                'สะแกโพรง',
                'สวายจีก',
                'บ้านยาง',
                'พระครู',
                'ถลุงเหล็ก',
                'หนองตาด',
                'ลุมปุ๊ก',
                'สองห้อง',
                'บัวทอง',
                'ชุมเห็ด',
                'หลักเขต',
                'สะแกซำ',
                'กลันทา',
                'กระสัง',
                'เมืองฝาง'
            ],
            postalCodes: ['31000']
        },
        คูเมือง: {
            subDistrict: [
                'คูเมือง',
                'ปะเคียบ',
                'บ้านแพ',
                'พรสำราญ',
                'หินเหล็กไฟ',
                'ตูมใหญ่',
                'หนองขมาร'
            ],
            postalCodes: ['31190']
        },
        กระสัง: {
            subDistrict: [
                'กระสัง',
                'ลำดวน',
                'สองชั้น',
                'สูงเนิน',
                'หนองเต็ง',
                'เมืองไผ่',
                'ชุมแสง',
                'บ้านปรือ',
                'ห้วยสำราญ',
                'กันทรารมย์',
                'ศรีภูมิ'
            ],
            postalCodes: ['31160']
        },
        นางรอง: {
            subDistrict: [
                'นางรอง',
                'สะเดา',
                'ชุมแสง',
                'หนองโบสถ์',
                'หนองกง',
                'ถนนหัก',
                'หนองไทร',
                'ก้านเหลือง',
                'บ้านสิงห์',
                'ลำไทรโยง',
                'ทรัพย์พระยา',
                'หนองยายพิมพ์',
                'หัวถนน',
                'ทุ่งแสงทอง',
                'หนองโสน'
            ],
            postalCodes: ['31110']
        },
        หนองกี่: {
            subDistrict: [
                'หนองกี่',
                'เย้ยปราสาท',
                'เมืองไผ่',
                'ดอนอะราง',
                'โคกสว่าง',
                'ทุ่งกระตาดพัฒนา',
                'ทุ่งกระเต็น',
                'ท่าโพธิ์ชัย',
                'โคกสูง',
                'บุกระสัง'
            ],
            postalCodes: ['31210']
        },
        ละหานทราย: {
            subDistrict: [
                'ละหานทราย',
                'ตาจง',
                'สำโรงใหม่',
                'หนองแวง',
                'หนองตะครอง',
                'โคกว่าน'
            ],
            postalCodes: ['31170']
        },
        ประโคนชัย: {
            subDistrict: [
                'ประโคนชัย',
                'แสลงโทน',
                'บ้านไทร',
                'ละเวี้ย',
                'จรเข้มาก',
                'ปังกู',
                'โคกย่าง',
                'โคกม้า',
                'ไพศาล',
                'ตะโกตาพิ',
                'เขาคอก',
                'หนองบอน',
                'โคกมะขาม',
                'โคกตูม',
                'ประทัดบุ',
                'สี่เหลี่ยม'
            ],
            postalCodes: ['31140']
        },
        บ้านกรวด: {
            subDistrict: [
                'บ้านกรวด',
                'โนนเจริญ',
                'หนองไม้งาม',
                'ปราสาท',
                'สายตะกู',
                'หินลาด',
                'บึงเจริญ',
                'จันทบเพชร',
                'เขาดินเหนือ'
            ],
            postalCodes: ['31180']
        },
        พุทไธสง: {
            subDistrict: [
                'พุทไธสง',
                'มะเฟือง',
                'บ้านจาน',
                'บ้านเป้า',
                'บ้านแวง',
                'บ้านยาง',
                'หายโศก'
            ],
            postalCodes: ['31120']
        },
        ลำปลายมาศ: {
            subDistrict: [
                'ลำปลายมาศ',
                'หนองคู',
                'แสลงพัน',
                'ทะเมนชัย',
                'ตลาดโพธิ์',
                'หนองกะทิง',
                'โคกกลาง',
                'โคกสะอาด',
                'เมืองแฝก',
                'บ้านยาง',
                'ผไทรินทร์',
                'โคกล่าม',
                'หินโคน',
                'หนองบัวโคก',
                'บุโพธิ์',
                'หนองโดน'
            ],
            postalCodes: ['31130']
        },
        สตึก: {
            subDistrict: [
                'สตึก',
                'นิคม',
                'ทุ่งวัง',
                'เมืองแก',
                'หนองใหญ่',
                'ร่อนทอง',
                'ดอนมนต์',
                'ชุมแสง',
                'ท่าม่วง',
                'สะแก',
                'สนามชัย',
                'กระสัง'
            ],
            postalCodes: ['31150']
        },
        ปะคำ: {
            subDistrict: ['ปะคำ', 'ไทยเจริญ', 'หนองบัว', 'โคกมะม่วง', 'หูทำนบ'],
            postalCodes: ['31220']
        },
        นาโพธิ์: {
            subDistrict: ['นาโพธิ์', 'บ้านคู', 'บ้านดู่', 'ดอนกอก', 'ศรีสว่าง'],
            postalCodes: ['31230']
        },
        หนองหงส์: {
            subDistrict: [
                'สระแก้ว',
                'ห้วยหิน',
                'ไทยสามัคคี',
                'หนองชัยศรี',
                'เสาเดียว',
                'เมืองฝ้าย',
                'สระทอง'
            ],
            postalCodes: ['31240']
        },
        พลับพลาชัย: {
            subDistrict: ['จันดุม', 'โคกขมิ้น', 'ป่าชัน', 'สะเดา', 'สำโรง'],
            postalCodes: ['31250']
        },
        ห้วยราช: {
            subDistrict: [
                'ห้วยราช',
                'สามแวง',
                'ตาเสา',
                'บ้านตะโก',
                'สนวน',
                'โคกเหล็ก',
                'เมืองโพธิ์',
                'ห้วยราชา'
            ],
            postalCodes: ['31000']
        },
        โนนสุวรรณ: {
            subDistrict: ['โนนสุวรรณ', 'ทุ่งจังหัน', 'โกรกแก้ว', 'ดงอีจาน'],
            postalCodes: ['31110']
        },
        ชำนิ: {
            subDistrict: [
                'ชำนิ',
                'หนองปล่อง',
                'เมืองยาง',
                'ช่อผกา',
                'ละลวด',
                'โคกสนวน'
            ],
            postalCodes: ['31110']
        },
        บ้านใหม่ไชยพจน์: {
            subDistrict: [
                'หนองแวง',
                'ทองหลาง',
                'แดงใหญ่',
                'กู่สวนแตง',
                'หนองเยือง'
            ],
            postalCodes: ['31120']
        },
        โนนดินแดง: {
            subDistrict: ['โนนดินแดง', 'ส้มป่อย', 'ลำนางรอง'],
            postalCodes: ['31260']
        },
        บ้านด่าน: {
            subDistrict: ['บ้านด่าน', 'ปราสาท', 'วังเหนือ', 'โนนขวาง'],
            postalCodes: ['31000']
        },
        แคนดง: {
            subDistrict: ['แคนดง', 'ดงพลอง', 'สระบัว', 'หัวฝาย'],
            postalCodes: ['31150']
        },
        เฉลิมพระเกียรติ: {
            subDistrict: [
                'เจริญสุข',
                'ตาเป๊ก',
                'อีสานเขต',
                'ถาวร',
                'ยายแย้มวัฒนา'
            ],
            postalCodes: ['31110', '31170']
        }
    },
    สุรินทร์: {
        เมืองสุรินทร์: {
            subDistrict: [
                'ในเมือง',
                'ตั้งใจ',
                'เพี้ยราม',
                'นาดี',
                'ท่าสว่าง',
                'สลักได',
                'ตาอ็อง',
                'สำโรง',
                'แกใหญ่',
                'นอกเมือง',
                'คอโค',
                'สวาย',
                'เฉนียง',
                'เทนมีย์',
                'นาบัว',
                'เมืองที',
                'ราม',
                'บุฤาษี',
                'ตระแสง',
                'แสลงพันธ์',
                'กาเกาะ'
            ],
            postalCodes: ['32000']
        },
        ชุมพลบุรี: {
            subDistrict: [
                'ชุมพลบุรี',
                'นาหนองไผ่',
                'ไพรขลา',
                'ศรีณรงค์',
                'ยะวึก',
                'เมืองบัว',
                'สระขุด',
                'กระเบื้อง',
                'หนองเรือ'
            ],
            postalCodes: ['32190']
        },
        ท่าตูม: {
            subDistrict: [
                'ท่าตูม',
                'กระโพ',
                'พรมเทพ',
                'โพนครก',
                'เมืองแก',
                'บะ',
                'หนองบัว',
                'บัวโคก',
                'หนองเมธี',
                'ทุ่งกุลา'
            ],
            postalCodes: ['32120']
        },
        จอมพระ: {
            subDistrict: [
                'จอมพระ',
                'เมืองลีง',
                'กระหาด',
                'บุแกรง',
                'หนองสนิท',
                'บ้านผือ',
                'ลุ่มระวี',
                'ชุมแสง',
                'เป็นสุข'
            ],
            postalCodes: ['32180']
        },
        ปราสาท: {
            subDistrict: [
                'กังแอน',
                'ทมอ',
                'ไพล',
                'ปรือ',
                'ทุ่งมน',
                'ตาเบา',
                'หนองใหญ่',
                'โคกยาง',
                'โคกสะอาด',
                'บ้านไทร',
                'โชคนาสาม',
                'เชื้อเพลิง',
                'ปราสาททนง',
                'ตานี',
                'บ้านพลวง',
                'กันตวจระมวล',
                'สมุด',
                'ประทัดบุ'
            ],
            postalCodes: ['32140']
        },
        กาบเชิง: {
            subDistrict: [
                'กาบเชิง',
                'คูตัน',
                'ด่าน',
                'แนงมุด',
                'โคกตะเคียน',
                'ตะเคียน'
            ],
            postalCodes: ['32210']
        },
        รัตนบุรี: {
            subDistrict: [
                'รัตนบุรี',
                'ธาตุ',
                'แก',
                'ดอนแรด',
                'หนองบัวทอง',
                'หนองบัวบาน',
                'ไผ่',
                'เบิด',
                'น้ำเขียว',
                'กุดขาคีม',
                'ยางสว่าง',
                'ทับใหญ่'
            ],
            postalCodes: ['32130']
        },
        สนม: {
            subDistrict: [
                'สนม',
                'โพนโก',
                'หนองระฆัง',
                'นานวน',
                'แคน',
                'หัวงัว',
                'หนองอียอ'
            ],
            postalCodes: ['32160']
        },
        ศีขรภูมิ: {
            subDistrict: [
                'ระแงง',
                'ตรึม',
                'จารพัต',
                'ยาง',
                'แตล',
                'หนองบัว',
                'คาละแมะ',
                'หนองเหล็ก',
                'หนองขวาว',
                'ช่างปี่',
                'กุดหวาย',
                'ขวาวใหญ่',
                'นารุ่ง',
                'ตรมไพร',
                'ผักไหม'
            ],
            postalCodes: ['32110']
        },
        สังขะ: {
            subDistrict: [
                'สังขะ',
                'ขอนแตก',
                'ดม',
                'พระแก้ว',
                'บ้านจารย์',
                'กระเทียม',
                'สะกาด',
                'ตาตุม',
                'ทับทัน',
                'ตาคง',
                'บ้านชบ',
                'เทพรักษา'
            ],
            postalCodes: ['32150']
        },
        ลำดวน: {
            subDistrict: [
                'ลำดวน',
                'โชคเหนือ',
                'อู่โลก',
                'ตรำดม',
                'ตระเปียงเตีย'
            ],
            postalCodes: ['32220']
        },
        สำโรงทาบ: {
            subDistrict: [
                'สำโรงทาบ',
                'หนองไผ่ล้อม',
                'กระออม',
                'หนองฮะ',
                'ศรีสุข',
                'เกาะแก้ว',
                'หมื่นศรี',
                'เสม็จ',
                'สะโน',
                'ประดู่'
            ],
            postalCodes: ['32170']
        },
        บัวเชด: {
            subDistrict: [
                'บัวเชด',
                'สะเดา',
                'จรัส',
                'ตาวัง',
                'อาโพน',
                'สำเภาลูน'
            ],
            postalCodes: ['32230']
        },
        พนมดงรัก: {
            subDistrict: ['บักได', 'โคกกลาง', 'จีกแดก', 'ตาเมียง'],
            postalCodes: ['32140']
        },
        ศรีณรงค์: {
            subDistrict: ['ณรงค์', 'แจนแวน', 'ตรวจ', 'หนองแวง', 'ศรีสุข'],
            postalCodes: ['32150']
        },
        เขวาสินรินทร์: {
            subDistrict: [
                'เขวาสินรินทร์',
                'บึง',
                'ตากูก',
                'ปราสาททอง',
                'บ้านแร่'
            ],
            postalCodes: ['32000']
        },
        โนนนารายณ์: {
            subDistrict: ['หนองหลวง', 'คำผง', 'โนน', 'ระเวียง', 'หนองเทพ'],
            postalCodes: ['32130']
        }
    },
    ศรีสะเกษ: {
        เมืองศรีสะเกษ: {
            subDistrict: [
                'เมืองเหนือ',
                'เมืองใต้',
                'คูซอด',
                'ซำ',
                'จาน',
                'ตะดอบ',
                'หนองครก',
                'โพนข่า',
                'โพนค้อ',
                'โพนเขวา',
                'หญ้าปล้อง',
                'ทุ่ม',
                'หนองไฮ',
                'หนองแก้ว',
                'น้ำคำ',
                'โพธิ์',
                'หมากเขียบ',
                'หนองไผ่'
            ],
            postalCodes: ['33000']
        },
        ยางชุมน้อย: {
            subDistrict: [
                'ยางชุมน้อย',
                'ลิ้นฟ้า',
                'คอนกาม',
                'โนนคูณ',
                'กุดเมืองฮาม',
                'บึงบอน',
                'ยางชุมใหญ่'
            ],
            postalCodes: ['33190']
        },
        กันทรารมย์: {
            subDistrict: [
                'ดูน',
                'โนนสัง',
                'หนองหัวช้าง',
                'ยาง',
                'หนองแวง',
                'หนองแก้ว',
                'ทาม',
                'ละทาย',
                'เมืองน้อย',
                'อีปาด',
                'บัวน้อย',
                'หนองบัว',
                'ดู่',
                'ผักแพว',
                'จาน',
                'คำเนียม'
            ],
            postalCodes: ['33130']
        },
        กันทรลักษ์: {
            subDistrict: [
                'บึงมะลู',
                'กุดเสลา',
                'เมือง',
                'สังเม็ก',
                'น้ำอ้อม',
                'ละลาย',
                'รุง',
                'ตระกาจ',
                'จานใหญ่',
                'ภูเงิน',
                'ชำ',
                'กระแชง',
                'โนนสำราญ',
                'หนองหญ้าลาด',
                'เสาธงชัย',
                'ขนุน',
                'สวนกล้วย',
                'เวียงเหนือ',
                'ทุ่งใหญ่',
                'ภูผาหมอก'
            ],
            postalCodes: ['33110']
        },
        ขุขันธ์: {
            subDistrict: [
                'กันทรารมย์',
                'จะกง',
                'ใจดี',
                'ดองกำเม็ด',
                'โสน',
                'ปรือใหญ่',
                'สะเดาใหญ่',
                'ตาอุด',
                'ห้วยเหนือ',
                'ห้วยใต้',
                'หัวเสือ',
                'ตะเคียน',
                'นิคมพัฒนา',
                'โคกเพชร',
                'ปราสาท',
                'สำโรงตาเจ็น',
                'ห้วยสำราญ',
                'กฤษณา',
                'ลมศักดิ์',
                'หนองฉลอง',
                'ศรีตระกูล',
                'ศรีสะอาด'
            ],
            postalCodes: ['33140']
        },
        ไพรบึง: {
            subDistrict: [
                'ไพรบึง',
                'ดินแดง',
                'ปราสาทเยอ',
                'สำโรงพลัน',
                'สุขสวัสดิ์',
                'โนนปูน'
            ],
            postalCodes: ['33180']
        },
        ปรางค์กู่: {
            subDistrict: [
                'พิมาย',
                'กู่',
                'หนองเชียงทูน',
                'ตูม',
                'สมอ',
                'โพธิ์ศรี',
                'สำโรงปราสาท',
                'ดู่',
                'สวาย',
                'พิมายเหนือ'
            ],
            postalCodes: ['33170']
        },
        ขุนหาญ: {
            subDistrict: [
                'สิ',
                'บักดอง',
                'พราน',
                'โพธิ์วงศ์',
                'ไพร',
                'กระหวัน',
                'ขุนหาญ',
                'โนนสูง',
                'กันทรอม',
                'ภูฝ้าย',
                'โพธิ์กระสังข์',
                'ห้วยจันทร์'
            ],
            postalCodes: ['33150']
        },
        ราษีไศล: {
            subDistrict: [
                'เมืองคง',
                'เมืองแคน',
                'หนองแค',
                'จิกสังข์ทอง',
                'ด่าน',
                'ดู่',
                'หนองอึ่ง',
                'บัวหุ่ง',
                'ไผ่',
                'ส้มป่อย',
                'หนองหมี',
                'หว้านคำ',
                'สร้างปี่'
            ],
            postalCodes: ['33160']
        },
        อุทุมพรพิสัย: {
            subDistrict: [
                'กำแพง',
                'อี่หล่ำ',
                'ก้านเหลือง',
                'ทุ่งไชย',
                'สำโรง',
                'แขม',
                'หนองไฮ',
                'ขะยูง',
                'ตาเกษ',
                'หัวช้าง',
                'รังแร้ง',
                'แต้',
                'แข้',
                'โพธิ์ชัย',
                'ปะอาว',
                'หนองห้าง',
                'สระกำแพงใหญ่',
                'โคกหล่าม',
                'โคกจาน'
            ],
            postalCodes: ['33120']
        },
        บึงบูรพ์: {
            subDistrict: ['เป๊าะ', 'บึงบูรพ์'],
            postalCodes: ['33220']
        },
        ห้วยทับทัน: {
            subDistrict: [
                'ห้วยทับทัน',
                'เมืองหลวง',
                'กล้วยกว้าง',
                'ผักไหม',
                'จานแสนไชย',
                'ปราสาท'
            ],
            postalCodes: ['33210']
        },
        โนนคูณ: {
            subDistrict: ['โนนค้อ', 'บก', 'โพธิ์', 'หนองกุง', 'เหล่ากวาง'],
            postalCodes: ['33250']
        },
        ศรีรัตนะ: {
            subDistrict: [
                'ศรีแก้ว',
                'พิงพวย',
                'สระเยาว์',
                'ตูม',
                'เสื่องข้าว',
                'ศรีโนนงาม',
                'สะพุง'
            ],
            postalCodes: ['33240']
        },
        น้ำเกลี้ยง: {
            subDistrict: [
                'น้ำเกลี้ยง',
                'ละเอาะ',
                'ตองปิด',
                'เขิน',
                'รุ่งระวี',
                'คูบ'
            ],
            postalCodes: ['33130']
        },
        วังหิน: {
            subDistrict: [
                'บุสูง',
                'ธาตุ',
                'ดวนใหญ่',
                'บ่อแก้ว',
                'ศรีสำราญ',
                'ทุ่งสว่าง',
                'วังหิน',
                'โพนยาง'
            ],
            postalCodes: ['33270']
        },
        ภูสิงห์: {
            subDistrict: [
                'โคกตาล',
                'ห้วยตามอญ',
                'ห้วยตึ๊กชู',
                'ละลม',
                'ตะเคียนราม',
                'ดงรัก',
                'ไพรพัฒนา'
            ],
            postalCodes: ['33140']
        },
        เมืองจันทร์: {
            subDistrict: ['เมืองจันทร์', 'ตาโกน', 'หนองใหญ่'],
            postalCodes: ['33120']
        },
        เบญจลักษ์: {
            subDistrict: [
                'เสียว',
                'หนองหว้า',
                'หนองงูเหลือม',
                'หนองฮาง',
                'ท่าคล้อ'
            ],
            postalCodes: ['33110']
        },
        พยุห์: {
            subDistrict: ['พยุห์', 'พรหมสวัสดิ์', 'ตำแย', 'โนนเพ็ก', 'หนองค้า'],
            postalCodes: ['33230']
        },
        โพธิ์ศรีสุวรรณ: {
            subDistrict: ['โดด', 'เสียว', 'หนองม้า', 'ผือใหญ่', 'อีเซ'],
            postalCodes: ['33120']
        },
        ศิลาลาด: {
            subDistrict: ['กุง', 'คลีกลิ้ง', 'หนองบัวดง', 'โจดม่วง'],
            postalCodes: ['33160']
        }
    },
    อุบลราชธานี: {
        เมืองอุบลราชธานี: {
            subDistrict: [
                'ในเมือง',
                'หัวเรือ',
                'หนองขอน',
                'ปทุม',
                'ขามใหญ่',
                'แจระแม',
                'หนองบ่อ',
                'ไร่น้อย',
                'กระโสบ',
                'กุดลาด',
                'ขี้เหล็ก',
                'ปะอาว'
            ],
            postalCodes: ['34000']
        },
        ศรีเมืองใหม่: {
            subDistrict: [
                'นาคำ',
                'แก้งกอก',
                'เอือดใหญ่',
                'วาริน',
                'ลาดควาย',
                'สงยาง',
                'ตะบ่าย',
                'คำไหล',
                'หนามแท่ง',
                'นาเลิน',
                'ดอนใหญ่'
            ],
            postalCodes: ['34250']
        },
        โขงเจียม: {
            subDistrict: [
                'โขงเจียม',
                'ห้วยยาง',
                'นาโพธิ์กลาง',
                'หนองแสงใหญ่',
                'ห้วยไผ่'
            ],
            postalCodes: ['34220']
        },
        เขื่องใน: {
            subDistrict: [
                'เขื่องใน',
                'สร้างถ่อ',
                'ค้อทอง',
                'ก่อเอ้',
                'หัวดอน',
                'ชีทวน',
                'ท่าไห',
                'นาคำใหญ่',
                'แดงหม้อ',
                'ธาตุน้อย',
                'บ้านไทย',
                'บ้านกอก',
                'กลางใหญ่',
                'โนนรัง',
                'ยางขี้นก',
                'ศรีสุข',
                'สหธาตุ',
                'หนองเหล่า'
            ],
            postalCodes: ['34150', '34320']
        },
        เขมราฐ: {
            subDistrict: [
                'เขมราฐ',
                'ขามป้อม',
                'เจียด',
                'หนองผือ',
                'นาแวง',
                'แก้งเหนือ',
                'หนองนกทา',
                'หนองสิม',
                'หัวนา'
            ],
            postalCodes: ['34170']
        },
        เดชอุดม: {
            subDistrict: [
                'เมืองเดช',
                'นาส่วง',
                'นาเจริญ',
                'ทุ่งเทิง',
                'สมสะอาด',
                'กุดประทาย',
                'ตบหู',
                'กลาง',
                'แก้ง',
                'ท่าโพธิ์ศรี',
                'บัวงาม',
                'คำครั่ง',
                'นากระแซง',
                'โพนงาม',
                'ป่าโมง',
                'โนนสมบูรณ์'
            ],
            postalCodes: ['34160']
        },
        นาจะหลวย: {
            subDistrict: [
                'นาจะหลวย',
                'โนนสมบูรณ์',
                'พรสวรรค์',
                'บ้านตูม',
                'โสกแสง',
                'โนนสวรรค์'
            ],
            postalCodes: ['34280']
        },
        น้ำยืน: {
            subDistrict: [
                'โซง',
                'ยาง',
                'โดมประดิษฐ์',
                'บุเปือย',
                'สีวิเชียร',
                'ยางใหญ่',
                'เก่าขาม'
            ],
            postalCodes: ['34260']
        },
        บุณฑริก: {
            subDistrict: [
                'โพนงาม',
                'ห้วยข่า',
                'คอแลน',
                'นาโพธิ์',
                'หนองสะโน',
                'โนนค้อ',
                'บัวงาม',
                'บ้านแมด'
            ],
            postalCodes: ['34230']
        },
        ตระการพืชผล: {
            subDistrict: [
                'ขุหลุ',
                'กระเดียน',
                'เกษม',
                'กุศกร',
                'ขามเปี้ย',
                'คอนสาย',
                'โคกจาน',
                'นาพิน',
                'นาสะไม',
                'โนนกุง',
                'ตระการ',
                'ตากแดด',
                'ไหล่ทุ่ง',
                'เป้า',
                'เซเป็ด',
                'สะพือ',
                'หนองเต่า',
                'ถ้ำแข้',
                'ท่าหลวง',
                'ห้วยฝ้ายพัฒนา',
                'กุดยาลวน',
                'บ้านแดง',
                'คำเจริญ'
            ],
            postalCodes: ['34130']
        },
        กุดข้าวปุ้น: {
            subDistrict: [
                'ข้าวปุ้น',
                'โนนสวาง',
                'แก่งเค็ง',
                'กาบิน',
                'หนองทันน้ำ'
            ],
            postalCodes: ['34270']
        },
        ม่วงสามสิบ: {
            subDistrict: [
                'ม่วงสามสิบ',
                'เหล่าบก',
                'ดุมใหญ่',
                'หนองช้างใหญ่',
                'หนองเมือง',
                'เตย',
                'ยางสักกระโพหลุ่ม',
                'หนองไข่นก',
                'หนองเหล่า',
                'หนองฮาง',
                'ยางโยภาพ',
                'ไผ่ใหญ่',
                'นาเลิง',
                'โพนแพง'
            ],
            postalCodes: ['34140']
        },
        วารินชำราบ: {
            subDistrict: [
                'วารินชำราบ',
                'ธาตุ',
                'ท่าลาด',
                'โนนโหนน',
                'คูเมือง',
                'สระสมิง',
                'คำน้ำแซบ',
                'บุ่งหวาย',
                'คำขวาง',
                'โพธิ์ใหญ่',
                'แสนสุข',
                'หนองกินเพล',
                'โนนผึ้ง',
                'เมืองศรีไค',
                'ห้วยขะยุง',
                'บุ่งไหม'
            ],
            postalCodes: ['34190', '34310']
        },
        พิบูลมังสาหาร: {
            subDistrict: [
                'พิบูล',
                'กุดชมภู',
                'ดอนจิก',
                'ทรายมูล',
                'นาโพธิ์',
                'โนนกลาง',
                'โพธิ์ไทร',
                'โพธิ์ศรี',
                'ระเว',
                'ไร่ใต้',
                'หนองบัวฮี',
                'อ่างศิลา',
                'โนนกาหลง',
                'บ้านแขม'
            ],
            postalCodes: ['34110']
        },
        ตาลสุม: {
            subDistrict: [
                'ตาลสุม',
                'สำโรง',
                'จิกเทิง',
                'หนองกุง',
                'นาคาย',
                'คำหว้า'
            ],
            postalCodes: ['34330']
        },
        โพธิ์ไทร: {
            subDistrict: [
                'โพธิ์ไทร',
                'ม่วงใหญ่',
                'สำโรง',
                'สองคอน',
                'สารภี',
                'เหล่างาม'
            ],
            postalCodes: ['34340']
        },
        สำโรง: {
            subDistrict: [
                'สำโรง',
                'โคกก่อง',
                'หนองไฮ',
                'ค้อน้อย',
                'โนนกาเล็น',
                'โคกสว่าง',
                'โนนกลาง',
                'บอน',
                'ขามป้อม'
            ],
            postalCodes: ['34360']
        },
        ดอนมดแดง: {
            subDistrict: ['ดอนมดแดง', 'เหล่าแดง', 'ท่าเมือง', 'คำไฮใหญ่'],
            postalCodes: ['34000']
        },
        สิรินธร: {
            subDistrict: [
                'คันไร่',
                'ช่องเม็ก',
                'โนนก่อ',
                'นิคมสร้างตนเองลำโดมน้อย',
                'ฝางคำ',
                'คำเขื่อนแก้ว'
            ],
            postalCodes: ['34350']
        },
        ทุ่งศรีอุดม: {
            subDistrict: ['หนองอ้ม', 'นาเกษม', 'กุดเรือ', 'โคกชำแระ', 'นาห่อม'],
            postalCodes: ['34160']
        },
        นาเยีย: {
            subDistrict: ['นาเยีย', 'นาดี', 'นาเรือง'],
            postalCodes: ['34160']
        },
        นาตาล: {
            subDistrict: ['นาตาล', 'พะลาน', 'กองโพน', 'พังเคน'],
            postalCodes: ['34170']
        },
        เหล่าเสือโก้ก: {
            subDistrict: ['เหล่าเสือโก้ก', 'โพนเมือง', 'แพงใหญ่', 'หนองบก'],
            postalCodes: ['34000']
        },
        สว่างวีระวงศ์: {
            subDistrict: ['แก่งโดม', 'ท่าช้าง', 'บุ่งมะแลง', 'สว่าง'],
            postalCodes: ['34190']
        },
        น้ำขุ่น: {
            subDistrict: ['ตาเกา', 'ไพบูลย์', 'ขี้เหล็ก', 'โคกสะอาด'],
            postalCodes: ['34260']
        }
    },
    ยโสธร: {
        เมืองยโสธร: {
            subDistrict: [
                'ในเมือง',
                'น้ำคำใหญ่',
                'ตาดทอง',
                'สำราญ',
                'ค้อเหนือ',
                'ดู่ทุ่ง',
                'เดิด',
                'ขั้นไดใหญ่',
                'ทุ่งแต้',
                'สิงห์',
                'นาสะไมย์',
                'เขื่องคำ',
                'หนองหิน',
                'หนองคู',
                'ขุมเงิน',
                'ทุ่งนางโอก',
                'หนองเรือ',
                'หนองเป็ด'
            ],
            postalCodes: ['35000']
        },
        ทรายมูล: {
            subDistrict: ['ทรายมูล', 'ดู่ลาด', 'ดงมะไฟ', 'นาเวียง', 'ไผ่'],
            postalCodes: ['35170']
        },
        กุดชุม: {
            subDistrict: [
                'กุดชุม',
                'โนนเปือย',
                'กำแมด',
                'นาโส่',
                'ห้วยแก้ง',
                'หนองหมี',
                'โพนงาม',
                'คำน้ำสร้าง',
                'หนองแหน'
            ],
            postalCodes: ['35140']
        },
        คำเขื่อนแก้ว: {
            subDistrict: [
                'ลุมพุก',
                'ย่อ',
                'สงเปือย',
                'โพนทัน',
                'ทุ่งมน',
                'นาคำ',
                'ดงแคนใหญ่',
                'กู่จาน',
                'นาแก',
                'กุดกุง',
                'เหล่าไฮ',
                'แคนน้อย',
                'ดงเจริญ'
            ],
            postalCodes: ['35110', '35180']
        },
        ป่าติ้ว: {
            subDistrict: [
                'โพธิ์ไทร',
                'กระจาย',
                'โคกนาโก',
                'เชียงเพ็ง',
                'ศรีฐาน'
            ],
            postalCodes: ['35150']
        },
        มหาชนะชัย: {
            subDistrict: [
                'ฟ้าหยาด',
                'หัวเมือง',
                'คูเมือง',
                'ผือฮี',
                'บากเรือ',
                'ม่วง',
                'โนนทราย',
                'บึงแก',
                'พระเสาร์',
                'สงยาง'
            ],
            postalCodes: ['35130']
        },
        ค้อวัง: {
            subDistrict: ['ฟ้าห่วน', 'กุดน้ำใส', 'น้ำอ้อม', 'ค้อวัง'],
            postalCodes: ['35160']
        },
        เลิงนกทา: {
            subDistrict: [
                'บุ่งค้า',
                'สวาท',
                'ห้องแซง',
                'สามัคคี',
                'กุดเชียงหมี',
                'สามแยก',
                'กุดแห่',
                'โคกสำราญ',
                'สร้างมิ่ง',
                'ศรีแก้ว'
            ],
            postalCodes: ['35120']
        },
        ไทยเจริญ: {
            subDistrict: ['ไทยเจริญ', 'น้ำคำ', 'ส้มผ่อ', 'คำเตย', 'คำไผ่'],
            postalCodes: ['35120']
        }
    },
    ชัยภูมิ: {
        เมืองชัยภูมิ: {
            subDistrict: [
                'ในเมือง',
                'รอบเมือง',
                'โพนทอง',
                'นาฝาย',
                'บ้านค่าย',
                'กุดตุ้ม',
                'ชีลอง',
                'บ้านเล่า',
                'นาเสียว',
                'หนองนาแซง',
                'ลาดใหญ่',
                'หนองไผ่',
                'ท่าหินโงม',
                'ห้วยต้อน',
                'ห้วยบง',
                'โนนสำราญ',
                'โคกสูง',
                'บุ่งคล้า',
                'ซับสีทอง'
            ],
            postalCodes: ['36000', '36240']
        },
        บ้านเขว้า: {
            subDistrict: [
                'บ้านเขว้า',
                'ตลาดแร้ง',
                'ลุ่มลำชี',
                'ชีบน',
                'ภูแลนคา',
                'โนนแดง'
            ],
            postalCodes: ['36170']
        },
        คอนสวรรค์: {
            subDistrict: [
                'คอนสวรรค์',
                'ยางหวาย',
                'ช่องสามหมอ',
                'โนนสะอาด',
                'ห้วยไร่',
                'บ้านโสก',
                'โคกมั่งงอย',
                'หนองขาม',
                'ศรีสำราญ'
            ],
            postalCodes: ['36140']
        },
        เกษตรสมบูรณ์: {
            subDistrict: [
                'บ้านยาง',
                'บ้านหัน',
                'บ้านเดื่อ',
                'บ้านเป้า',
                'กุดเลาะ',
                'โนนกอก',
                'สระโพนทอง',
                'หนองข่า',
                'หนองโพนงาม',
                'บ้านบัว',
                'โนนทอง'
            ],
            postalCodes: ['36120']
        },
        หนองบัวแดง: {
            subDistrict: [
                'หนองบัวแดง',
                'กุดชุมแสง',
                'ถ้ำวัวแดง',
                'นางแดด',
                'หนองแวง',
                'คูเมือง',
                'ท่าใหญ่',
                'วังชมภู'
            ],
            postalCodes: ['36210']
        },
        จัตุรัส: {
            subDistrict: [
                'บ้านกอก',
                'หนองบัวบาน',
                'บ้านขาม',
                'กุดน้ำใส',
                'หนองโดน',
                'ละหาน',
                'หนองบัวใหญ่',
                'หนองบัวโคก',
                'ส้มป่อย'
            ],
            postalCodes: ['36130', '36220']
        },
        บำเหน็จณรงค์: {
            subDistrict: [
                'บ้านชวน',
                'บ้านเพชร',
                'บ้านตาล',
                'หัวทะเล',
                'โคกเริงรมย์',
                'เกาะมะนาว',
                'โคกเพชรพัฒนา'
            ],
            postalCodes: ['36160', '36220']
        },
        หนองบัวระเหว: {
            subDistrict: [
                'หนองบัวระเหว',
                'วังตะเฆ่',
                'ห้วยแย้',
                'โคกสะอาด',
                'โสกปลาดุก'
            ],
            postalCodes: ['36250']
        },
        เทพสถิต: {
            subDistrict: [
                'วะตะแบก',
                'ห้วยยายจิ๋ว',
                'นายางกลัก',
                'บ้านไร่',
                'โป่งนก'
            ],
            postalCodes: ['36230']
        },
        ภูเขียว: {
            subDistrict: [
                'ผักปัง',
                'กวางโจน',
                'หนองคอนไทย',
                'บ้านแก้ง',
                'กุดยม',
                'บ้านเพชร',
                'โคกสะอาด',
                'หนองตูม',
                'โอโล',
                'ธาตุทอง',
                'บ้านดอน'
            ],
            postalCodes: ['36110']
        },
        บ้านแท่น: {
            subDistrict: ['บ้านแท่น', 'สามสวน', 'สระพัง', 'บ้านเต่า', 'หนองคู'],
            postalCodes: ['36190']
        },
        แก้งคร้อ: {
            subDistrict: [
                'ช่องสามหมอ',
                'หนองขาม',
                'นาหนองทุ่ม',
                'บ้านแก้ง',
                'หนองสังข์',
                'หลุบคา',
                'โคกกุง',
                'เก่าย่าดี',
                'ท่ามะไฟหวาน',
                'หนองไผ่'
            ],
            postalCodes: ['36150']
        },
        คอนสาร: {
            subDistrict: [
                'คอนสาร',
                'ทุ่งพระ',
                'โนนคูณ',
                'ห้วยยาง',
                'ทุ่งลุยลาย',
                'ดงบัง',
                'ทุ่งนาเลา',
                'ดงกลาง'
            ],
            postalCodes: ['36180']
        },
        ภักดีชุมพล: {
            subDistrict: ['บ้านเจียง', 'เจาทอง', 'วังทอง', 'แหลมทอง'],
            postalCodes: ['36260']
        },
        เนินสง่า: {
            subDistrict: ['หนองฉิม', 'ตาเนิน', 'กะฮาด', 'รังงาม'],
            postalCodes: ['36130']
        },
        ซับใหญ่: {
            subDistrict: ['ซับใหญ่', 'ท่ากูบ', 'ตะโกทอง'],
            postalCodes: ['36130']
        }
    },
    อำนาจเจริญ: {
        เมืองอำนาจเจริญ: {
            subDistrict: [
                'บุ่ง',
                'ไก่คำ',
                'นาจิก',
                'ปลาค้าว',
                'เหล่าพรวน',
                'สร้างนกทา',
                'คึมใหญ่',
                'นาผือ',
                'น้ำปลีก',
                'นาวัง',
                'นาหมอม้า',
                'โนนโพธิ์',
                'โนนหนามแท่ง',
                'ห้วยไร่',
                'หนองมะแซว',
                'กุดปลาดุก',
                'ดอนเมย',
                'นายม',
                'นาแต้'
            ],
            postalCodes: ['37000']
        },
        ชานุมาน: {
            subDistrict: [
                'ชานุมาน',
                'โคกสาร',
                'คำเขื่อนแก้ว',
                'โคกก่ง',
                'ป่าก่อ'
            ],
            postalCodes: ['37210']
        },
        ปทุมราชวงศา: {
            subDistrict: [
                'หนองข่า',
                'คำโพน',
                'นาหว้า',
                'ลือ',
                'ห้วย',
                'โนนงาม',
                'นาป่าแซง'
            ],
            postalCodes: ['37110']
        },
        พนา: {
            subDistrict: ['พนา', 'จานลาน', 'ไม้กลอน', 'พระเหลา'],
            postalCodes: ['37180']
        },
        เสนางคนิคม: {
            subDistrict: [
                'เสนางคนิคม',
                'โพนทอง',
                'ไร่สีสุก',
                'นาเวียง',
                'หนองไฮ',
                'หนองสามสี'
            ],
            postalCodes: ['37290']
        },
        หัวตะพาน: {
            subDistrict: [
                'หัวตะพาน',
                'คำพระ',
                'เค็งใหญ่',
                'หนองแก้ว',
                'โพนเมืองน้อย',
                'สร้างถ่อน้อย',
                'จิกดู่',
                'รัตนวารี'
            ],
            postalCodes: ['37240']
        },
        ลืออำนาจ: {
            subDistrict: [
                'อำนาจ',
                'ดงมะยาง',
                'เปือย',
                'ดงบัง',
                'ไร่ขี',
                'แมด',
                'โคกกลาง'
            ],
            postalCodes: ['37120']
        }
    },
    บึงกาฬ: {
        เมืองบึงกาฬ: {
            subDistrict: [
                'บึงกาฬ',
                'โนนสมบูรณ์',
                'โนนสว่าง',
                'หอคำ',
                'หนองเลิง',
                'โคกก่อง',
                'นาสวรรค์',
                'ไคสี',
                'ชัยพร',
                'วิศิษฐ์',
                'คำนาดี',
                'โป่งเปือย'
            ],
            postalCodes: ['38000']
        },
        พรเจริญ: {
            subDistrict: [
                'ศรีชมภู',
                'ดอนหญ้านาง',
                'พรเจริญ',
                'หนองหัวช้าง',
                'วังชมภู',
                'ป่าแฝก',
                'ศรีสำราญ'
            ],
            postalCodes: ['38180']
        },
        โซ่พิสัย: {
            subDistrict: [
                'โซ่',
                'หนองพันทา',
                'ศรีชมภู',
                'คำแก้ว',
                'บัวตูม',
                'ถ้ำเจริญ',
                'เหล่าทอง'
            ],
            postalCodes: ['38170']
        },
        เซกา: {
            subDistrict: [
                'เซกา',
                'ซาง',
                'ท่ากกแดง',
                'บ้านต้อง',
                'ป่งไฮ',
                'น้ำจั้น',
                'ท่าสะอาด',
                'หนองทุ่ม',
                'โสกก่าม'
            ],
            postalCodes: ['38150']
        },
        ปากคาด: {
            subDistrict: [
                'ปากคาด',
                'หนองยอง',
                'นากั้ง',
                'โนนศิลา',
                'สมสนุก',
                'นาดง'
            ],
            postalCodes: ['38190']
        },
        บึงโขงหลง: {
            subDistrict: ['บึงโขงหลง', 'โพธิ์หมากแข้ง', 'ดงบัง', 'ท่าดอกคำ'],
            postalCodes: ['38220']
        },
        ศรีวิไล: {
            subDistrict: ['ศรีวิไล', 'ชุมภูพร', 'นาแสง', 'นาสะแบง', 'นาสิงห์'],
            postalCodes: ['38210']
        },
        บุ่งคล้า: {
            subDistrict: ['บุ่งคล้า', 'หนองเดิ่น', 'โคกกว้าง'],
            postalCodes: ['38000']
        }
    },
    หนองบัวลำภู: {
        เมืองหนองบัวลำภู: {
            subDistrict: [
                'หนองบัว',
                'หนองภัยศูนย์',
                'โพธิ์ชัย',
                'หนองสวรรค์',
                'หัวนา',
                'บ้านขาม',
                'นามะเฟือง',
                'บ้านพร้าว',
                'โนนขมิ้น',
                'ลำภู',
                'กุดจิก',
                'โนนทัน',
                'นาคำไฮ',
                'ป่าไม้งาม',
                'หนองหว้า'
            ],
            postalCodes: ['39000']
        },
        นากลาง: {
            subDistrict: [
                'นากลาง',
                'ด่านช้าง',
                'กุดดินจี่',
                'ฝั่งแดง',
                'เก่ากลอย',
                'โนนเมือง',
                'อุทัยสวรรค์',
                'ดงสวรรค์',
                'กุดแห่'
            ],
            postalCodes: ['39170', '39350']
        },
        โนนสัง: {
            subDistrict: [
                'โนนสัง',
                'บ้านถิ่น',
                'หนองเรือ',
                'กุดดู่',
                'บ้านค้อ',
                'โนนเมือง',
                'โคกใหญ่',
                'โคกม่วง',
                'นิคมพัฒนา',
                'ปางกู่'
            ],
            postalCodes: ['39140']
        },
        ศรีบุญเรือง: {
            subDistrict: [
                'เมืองใหม่',
                'ศรีบุญเรือง',
                'หนองบัวใต้',
                'กุดสะเทียน',
                'นากอก',
                'โนนสะอาด',
                'ยางหล่อ',
                'โนนม่วง',
                'หนองกุงแก้ว',
                'หนองแก',
                'ทรายทอง',
                'หันนางาม'
            ],
            postalCodes: ['39180']
        },
        สุวรรณคูหา: {
            subDistrict: [
                'นาสี',
                'บ้านโคก',
                'นาดี',
                'นาด่าน',
                'ดงมะไฟ',
                'สุวรรณคูหา',
                'บุญทัน',
                'กุดผึ้ง'
            ],
            postalCodes: ['39270']
        },
        นาวัง: {
            subDistrict: ['นาเหล่า', 'นาแก', 'วังทอง', 'วังปลาป้อม', 'เทพคีรี'],
            postalCodes: ['39170']
        }
    },
    ขอนแก่น: {
        เมืองขอนแก่น: {
            subDistrict: [
                'ในเมือง',
                'สำราญ',
                'โคกสี',
                'ท่าพระ',
                'บ้านทุ่ม',
                'เมืองเก่า',
                'พระลับ',
                'สาวะถี',
                'บ้านหว้า',
                'บ้านค้อ',
                'แดงใหญ่',
                'ดอนช้าง',
                'ดอนหัน',
                'ศิลา',
                'บ้านเป็ด',
                'หนองตูม',
                'บึงเนียม',
                'โนนท่อน'
            ],
            postalCodes: ['40000', '40260']
        },
        บ้านฝาง: {
            subDistrict: [
                'หนองบัว',
                'ป่าหวายนั่ง',
                'โนนฆ้อง',
                'บ้านเหล่า',
                'ป่ามะนาว',
                'บ้านฝาง',
                'โคกงาม'
            ],
            postalCodes: ['40270']
        },
        พระยืน: {
            subDistrict: ['พระยืน', 'พระบุ', 'บ้านโต้น', 'หนองแวง', 'ขามป้อม'],
            postalCodes: ['40320']
        },
        หนองเรือ: {
            subDistrict: [
                'หนองเรือ',
                'บ้านเม็ง',
                'บ้านกง',
                'ยางคำ',
                'จระเข้',
                'โนนทอง',
                'กุดกว้าง',
                'โนนทัน',
                'โนนสะอาด',
                'บ้านผือ'
            ],
            postalCodes: ['40210', '40240']
        },
        ชุมแพ: {
            subDistrict: [
                'ชุมแพ',
                'โนนหัน',
                'นาหนองทุ่ม',
                'โนนอุดม',
                'ขัวเรียง',
                'หนองไผ่',
                'ไชยสอ',
                'วังหินลาด',
                'นาเพียง',
                'หนองเขียด',
                'หนองเสาเล้า',
                'โนนสะอาด'
            ],
            postalCodes: ['40130', '40290']
        },
        สีชมพู: {
            subDistrict: [
                'สีชมพู',
                'ศรีสุข',
                'นาจาน',
                'วังเพิ่ม',
                'ซำยาง',
                'หนองแดง',
                'ดงลาน',
                'บริบูรณ์',
                'บ้านใหม่',
                'ภูห่าน'
            ],
            postalCodes: ['40220']
        },
        น้ำพอง: {
            subDistrict: [
                'น้ำพอง',
                'วังชัย',
                'หนองกุง',
                'บัวใหญ่',
                'สะอาด',
                'ม่วงหวาน',
                'บ้านขาม',
                'บัวเงิน',
                'ทรายมูล',
                'ท่ากระเสริม',
                'พังทุย',
                'กุดน้ำใส'
            ],
            postalCodes: ['40140', '40310']
        },
        อุบลรัตน์: {
            subDistrict: [
                'โคกสูง',
                'บ้านดง',
                'เขื่อนอุบลรัตน์',
                'นาคำ',
                'ศรีสุขสำราญ',
                'ทุ่งโป่ง'
            ],
            postalCodes: ['40250']
        },
        กระนวน: {
            subDistrict: [
                'หนองโก',
                'หนองกุงใหญ่',
                'ห้วยโจด',
                'ห้วยยาง',
                'บ้านฝาง',
                'ดูนสาด',
                'หนองโน',
                'น้ำอ้อม',
                'หัวนาคำ'
            ],
            postalCodes: ['40170']
        },
        บ้านไผ่: {
            subDistrict: [
                'บ้านไผ่',
                'ในเมือง',
                'เมืองเพีย',
                'บ้านลาน',
                'แคนเหนือ',
                'ภูเหล็ก',
                'ป่าปอ',
                'หินตั้ง',
                'หนองน้ำใส',
                'หัวหนอง'
            ],
            postalCodes: ['40110']
        },
        เปือยน้อย: {
            subDistrict: ['เปือยน้อย', 'วังม่วง', 'ขามป้อม', 'สระแก้ว'],
            postalCodes: ['40340']
        },
        พล: {
            subDistrict: [
                'เมืองพล',
                'โจดหนองแก',
                'เก่างิ้ว',
                'หนองมะเขือ',
                'หนองแวงโสกพระ',
                'เพ็กใหญ่',
                'โคกสง่า',
                'หนองแวงนางเบ้า',
                'ลอมคอม',
                'โนนข่า',
                'โสกนกเต็น',
                'หัวทุ่ง'
            ],
            postalCodes: ['40120']
        },
        แวงใหญ่: {
            subDistrict: [
                'คอนฉิม',
                'ใหม่นาเพียง',
                'โนนทอง',
                'แวงใหญ่',
                'โนนสะอาด'
            ],
            postalCodes: ['40330']
        },
        แวงน้อย: {
            subDistrict: [
                'แวงน้อย',
                'ก้านเหลือง',
                'ท่านางแนว',
                'ละหานนา',
                'ท่าวัด',
                'ทางขวาง'
            ],
            postalCodes: ['40230']
        },
        หนองสองห้อง: {
            subDistrict: [
                'หนองสองห้อง',
                'คึมชาด',
                'โนนธาตุ',
                'ตะกั่วป่า',
                'สำโรง',
                'หนองเม็ก',
                'ดอนดู่',
                'ดงเค็ง',
                'หันโจด',
                'ดอนดั่ง',
                'วังหิน',
                'หนองไผ่ล้อม'
            ],
            postalCodes: ['40190']
        },
        ภูเวียง: {
            subDistrict: [
                'บ้านเรือ',
                'หว้าทอง',
                'กุดขอนแก่น',
                'นาชุมแสง',
                'นาหว้า',
                'หนองกุงธนสาร',
                'หนองกุงเซิน',
                'สงเปือย',
                'ทุ่งชมพู',
                'ดินดำ',
                'ภูเวียง'
            ],
            postalCodes: ['40150']
        },
        มัญจาคีรี: {
            subDistrict: [
                'กุดเค้า',
                'สวนหม่อน',
                'หนองแปน',
                'โพนเพ็ก',
                'คำแคน',
                'นาข่า',
                'นางาม',
                'ท่าศาลา'
            ],
            postalCodes: ['40160']
        },
        ชนบท: {
            subDistrict: [
                'ชนบท',
                'กุดเพียขอม',
                'วังแสง',
                'ห้วยแก',
                'บ้านแท่น',
                'ศรีบุญเรือง',
                'โนนพะยอม',
                'ปอแดง'
            ],
            postalCodes: ['40180']
        },
        เขาสวนกวาง: {
            subDistrict: [
                'เขาสวนกวาง',
                'ดงเมืองแอม',
                'นางิ้ว',
                'โนนสมบูรณ์',
                'คำม่วง'
            ],
            postalCodes: ['40280']
        },
        ภูผาม่าน: {
            subDistrict: ['โนนคอม', 'นาฝาย', 'ภูผาม่าน', 'วังสวาบ', 'ห้วยม่วง'],
            postalCodes: ['40350']
        },
        ซำสูง: {
            subDistrict: ['กระนวน', 'คำแมด', 'บ้านโนน', 'คูคำ', 'ห้วยเตย'],
            postalCodes: ['40170']
        },
        โคกโพธิ์ไชย: {
            subDistrict: ['บ้านโคก', 'โพธิ์ไชย', 'ซับสมบูรณ์', 'นาแพง'],
            postalCodes: ['40160']
        },
        หนองนาคำ: {
            subDistrict: ['กุดธาตุ', 'บ้านโคก', 'ขนวน'],
            postalCodes: ['40150']
        },
        บ้านแฮด: {
            subDistrict: ['บ้านแฮด', 'โคกสำราญ', 'โนนสมบูรณ์', 'หนองแซง'],
            postalCodes: ['40110']
        },
        โนนศิลา: {
            subDistrict: [
                'โนนศิลา',
                'หนองปลาหมอ',
                'บ้านหัน',
                'เปือยใหญ่',
                'โนนแดง'
            ],
            postalCodes: ['40110']
        },
        เวียงเก่า: {
            subDistrict: ['ในเมือง', 'เมืองเก่าพัฒนา', 'เขาน้อย'],
            postalCodes: ['40150']
        }
    },
    อุดรธานี: {
        เมืองอุดรธานี: {
            subDistrict: [
                'หมากแข้ง',
                'นิคมสงเคราะห์',
                'บ้านขาว',
                'หนองบัว',
                'บ้านตาด',
                'โนนสูง',
                'หมูม่น',
                'เชียงยืน',
                'หนองนาคำ',
                'กุดสระ',
                'นาดี',
                'บ้านเลื่อม',
                'เชียงพิณ',
                'สามพร้าว',
                'หนองไฮ',
                'นาข่า',
                'บ้านจั่น',
                'หนองขอนกว้าง',
                'โคกสะอาด',
                'นากว้าง',
                'หนองไผ่'
            ],
            postalCodes: ['41000', '41330']
        },
        กุดจับ: {
            subDistrict: [
                'กุดจับ',
                'ปะโค',
                'ขอนยูง',
                'เชียงเพ็ง',
                'สร้างก่อ',
                'เมืองเพีย',
                'ตาลเลียน'
            ],
            postalCodes: ['41250']
        },
        หนองวัวซอ: {
            subDistrict: [
                'หมากหญ้า',
                'หนองอ้อ',
                'อูบมุง',
                'กุดหมากไฟ',
                'น้ำพ่น',
                'หนองบัวบาน',
                'โนนหวาย',
                'หนองวัวซอ'
            ],
            postalCodes: ['41360', '41220']
        },
        กุมภวาปี: {
            subDistrict: [
                'ตูมใต้',
                'พันดอน',
                'เวียงคำ',
                'แชแล',
                'เชียงแหว',
                'ห้วยเกิ้ง',
                'เสอเพลอ',
                'สีออ',
                'ปะโค',
                'ผาสุก',
                'ท่าลี่',
                'กุมภวาปี',
                'หนองหว้า'
            ],
            postalCodes: ['41110', '41370']
        },
        โนนสะอาด: {
            subDistrict: [
                'โนนสะอาด',
                'บุ่งแก้ว',
                'โพธิ์ศรีสำราญ',
                'ทมนางาม',
                'หนองกุงศรี',
                'โคกกลาง'
            ],
            postalCodes: ['41240']
        },
        หนองหาน: {
            subDistrict: [
                'หนองหาน',
                'หนองเม็ก',
                'พังงู',
                'สะแบง',
                'สร้อยพร้าว',
                'บ้านเชียง',
                'บ้านยา',
                'โพนงาม',
                'ผักตบ',
                'หนองไผ่',
                'ดอนหายโศก',
                'หนองสระปลา'
            ],
            postalCodes: ['41130', '41320']
        },
        ทุ่งฝน: {
            subDistrict: ['ทุ่งฝน', 'ทุ่งใหญ่', 'นาชุมแสง', 'นาทม'],
            postalCodes: ['41310']
        },
        ไชยวาน: {
            subDistrict: ['ไชยวาน', 'หนองหลัก', 'คำเลาะ', 'โพนสูง'],
            postalCodes: ['41290']
        },
        ศรีธาตุ: {
            subDistrict: [
                'ศรีธาตุ',
                'จำปี',
                'บ้านโปร่ง',
                'หัวนาคำ',
                'หนองนกเขียน',
                'นายูง',
                'ตาดทอง'
            ],
            postalCodes: ['41230']
        },
        วังสามหมอ: {
            subDistrict: [
                'หนองกุงทับม้า',
                'หนองหญ้าไซ',
                'บะยาว',
                'ผาสุก',
                'คำโคกสูง',
                'วังสามหมอ'
            ],
            postalCodes: ['41280']
        },
        บ้านดุง: {
            subDistrict: [
                'ศรีสุทโธ',
                'บ้านดุง',
                'ดงเย็น',
                'โพนสูง',
                'อ้อมกอ',
                'บ้านจันทน์',
                'บ้านชัย',
                'นาไหม',
                'ถ่อนนาลับ',
                'วังทอง',
                'บ้านม่วง',
                'บ้านตาด',
                'นาคำ'
            ],
            postalCodes: ['41190']
        },
        บ้านผือ: {
            subDistrict: [
                'บ้านผือ',
                'หายโศก',
                'เขือน้ำ',
                'คำบง',
                'โนนทอง',
                'ข้าวสาร',
                'จำปาโมง',
                'กลางใหญ่',
                'เมืองพาน',
                'คำด้วง',
                'หนองหัวคู',
                'บ้านค้อ',
                'หนองแวง'
            ],
            postalCodes: ['41160']
        },
        น้ำโสม: {
            subDistrict: [
                'นางัว',
                'น้ำโสม',
                'หนองแวง',
                'บ้านหยวก',
                'โสมเยี่ยม',
                'ศรีสำราญ',
                'สามัคคี'
            ],
            postalCodes: ['41210']
        },
        เพ็ญ: {
            subDistrict: [
                'เพ็ญ',
                'บ้านธาตุ',
                'นาพู่',
                'เชียงหวาง',
                'สุมเส้า',
                'นาบัว',
                'บ้านเหล่า',
                'จอมศรี',
                'เตาไห',
                'โคกกลาง',
                'สร้างแป้น'
            ],
            postalCodes: ['41150']
        },
        สร้างคอม: {
            subDistrict: [
                'สร้างคอม',
                'เชียงดา',
                'บ้านยวด',
                'บ้านโคก',
                'นาสะอาด',
                'บ้านหินโงม'
            ],
            postalCodes: ['41260']
        },
        หนองแสง: {
            subDistrict: ['หนองแสง', 'แสงสว่าง', 'นาดี', 'ทับกุง'],
            postalCodes: ['41340']
        },
        นายูง: {
            subDistrict: ['นายูง', 'บ้านก้อง', 'นาแค', 'โนนทอง'],
            postalCodes: ['41380']
        },
        พิบูลย์รักษ์: {
            subDistrict: ['บ้านแดง', 'นาทราย', 'ดอนกลอย'],
            postalCodes: ['41130']
        },
        กู่แก้ว: {
            subDistrict: ['บ้านจีต', 'โนนทองอินทร์', 'ค้อใหญ่', 'คอนสาย'],
            postalCodes: ['41130']
        },
        ประจักษ์ศิลปาคม: {
            subDistrict: ['นาม่วง', 'ห้วยสามพาด', 'อุ่มจาน'],
            postalCodes: ['41110']
        }
    },
    เลย: {
        เมืองเลย: {
            subDistrict: [
                'กุดป่อง',
                'เมือง',
                'นาอ้อ',
                'กกดู่',
                'น้ำหมาน',
                'เสี้ยว',
                'นาอาน',
                'นาโป่ง',
                'นาดินดำ',
                'น้ำสวย',
                'ชัยพฤกษ์',
                'นาแขม',
                'ศรีสองรัก',
                'กกทอง'
            ],
            postalCodes: ['42000', '42100']
        },
        นาด้วง: {
            subDistrict: ['นาด้วง', 'นาดอกคำ', 'ท่าสะอาด', 'ท่าสวรรค์'],
            postalCodes: ['42210']
        },
        เชียงคาน: {
            subDistrict: [
                'เชียงคาน',
                'ธาตุ',
                'นาซ่าว',
                'เขาแก้ว',
                'ปากตม',
                'บุฮม',
                'จอมศรี',
                'หาดทรายขาว'
            ],
            postalCodes: ['42110']
        },
        ปากชม: {
            subDistrict: [
                'ปากชม',
                'เชียงกลม',
                'หาดคัมภีร์',
                'ห้วยบ่อซืน',
                'ห้วยพิชัย',
                'ชมเจริญ'
            ],
            postalCodes: ['42150']
        },
        ด่านซ้าย: {
            subDistrict: [
                'ด่านซ้าย',
                'ปากหมัน',
                'นาดี',
                'โคกงาม',
                'โพนสูง',
                'อิปุ่ม',
                'กกสะทอน',
                'โป่ง',
                'วังยาว',
                'นาหอ'
            ],
            postalCodes: ['42120']
        },
        นาแห้ว: {
            subDistrict: ['นาแห้ว', 'แสงภา', 'นาพึง', 'นามาลา', 'เหล่ากอหก'],
            postalCodes: ['42170']
        },
        ภูเรือ: {
            subDistrict: [
                'หนองบัว',
                'ท่าศาลา',
                'ร่องจิก',
                'ปลาบ่า',
                'ลาดค่าง',
                'สานตม'
            ],
            postalCodes: ['42160']
        },
        ท่าลี่: {
            subDistrict: [
                'ท่าลี่',
                'หนองผือ',
                'อาฮี',
                'น้ำแคม',
                'โคกใหญ่',
                'น้ำทูน'
            ],
            postalCodes: ['42140']
        },
        วังสะพุง: {
            subDistrict: [
                'วังสะพุง',
                'ทรายขาว',
                'หนองหญ้าปล้อง',
                'หนองงิ้ว',
                'ปากปวน',
                'ผาน้อย',
                'ผาบิ้ง',
                'เขาหลวง',
                'โคกขมิ้น',
                'ศรีสงคราม'
            ],
            postalCodes: ['42130']
        },
        ภูกระดึง: {
            subDistrict: ['ศรีฐาน', 'ผานกเค้า', 'ภูกระดึง', 'ห้วยส้ม'],
            postalCodes: ['42180']
        },
        ภูหลวง: {
            subDistrict: [
                'ภูหอ',
                'หนองคัน',
                'ห้วยสีเสียด',
                'เลยวังไสย์',
                'แก่งศรีภูมิ'
            ],
            postalCodes: ['42230']
        },
        ผาขาว: {
            subDistrict: [
                'ผาขาว',
                'ท่าช้างคล้อง',
                'โนนปอแดง',
                'โนนป่าซาง',
                'บ้านเพิ่ม'
            ],
            postalCodes: ['42240']
        },
        เอราวัณ: {
            subDistrict: [
                'เอราวัณ',
                'ผาอินทร์แปลง',
                'ผาสามยอด',
                'ทรัพย์ไพวัลย์'
            ],
            postalCodes: ['42220']
        },
        หนองหิน: {
            subDistrict: ['หนองหิน', 'ตาดข่า', 'ปวนพุ'],
            postalCodes: ['42190']
        }
    },
    หนองคาย: {
        เมืองหนองคาย: {
            subDistrict: [
                'ในเมือง',
                'มีชัย',
                'โพธิ์ชัย',
                'กวนวัน',
                'เวียงคุก',
                'วัดธาตุ',
                'หาดคำ',
                'หินโงม',
                'บ้านเดื่อ',
                'ค่ายบกหวาน',
                'โพนสว่าง',
                'พระธาตุบังพวน',
                'หนองกอมเกาะ',
                'ปะโค',
                'เมืองหมี',
                'สีกาย'
            ],
            postalCodes: ['43000', '43100']
        },
        ท่าบ่อ: {
            subDistrict: [
                'ท่าบ่อ',
                'น้ำโมง',
                'กองนาง',
                'โคกคอน',
                'บ้านเดื่อ',
                'บ้านถ่อน',
                'บ้านว่าน',
                'นาข่า',
                'โพนสา',
                'หนองนาง'
            ],
            postalCodes: ['43110']
        },
        โพนพิสัย: {
            subDistrict: [
                'จุมพล',
                'วัดหลวง',
                'กุดบง',
                'ชุมช้าง',
                'ทุ่งหลวง',
                'เหล่าต่างคำ',
                'นาหนัง',
                'เซิม',
                'บ้านโพธิ์',
                'บ้านผือ',
                'สร้างนางขาว'
            ],
            postalCodes: ['43120']
        },
        ศรีเชียงใหม่: {
            subDistrict: ['พานพร้าว', 'บ้านหม้อ', 'พระพุทธบาท', 'หนองปลาปาก'],
            postalCodes: ['43130']
        },
        สังคม: {
            subDistrict: ['แก้งไก่', 'ผาตั้ง', 'บ้านม่วง', 'นางิ้ว', 'สังคม'],
            postalCodes: ['43160']
        },
        สระใคร: {
            subDistrict: ['สระใคร', 'คอกช้าง', 'บ้านฝาง'],
            postalCodes: ['43100']
        },
        เฝ้าไร่: {
            subDistrict: ['เฝ้าไร่', 'นาดี', 'หนองหลวง', 'วังหลวง', 'อุดมพร'],
            postalCodes: ['43230']
        },
        รัตนวาปี: {
            subDistrict: [
                'รัตนวาปี',
                'นาทับไฮ',
                'บ้านต้อน',
                'พระบาทนาสิงห์',
                'โพนแพง'
            ],
            postalCodes: ['43120']
        },
        โพธิ์ตาก: {
            subDistrict: ['โพธิ์ตาก', 'โพนทอง', 'ด่านศรีสุข'],
            postalCodes: ['43130']
        }
    },
    มหาสารคาม: {
        เมืองมหาสารคาม: {
            subDistrict: [
                'ตลาด',
                'เขวา',
                'ท่าตูม',
                'แวงน่าง',
                'โคกก่อ',
                'ดอนหว่าน',
                'เกิ้ง',
                'แก่งเลิงจาน',
                'ท่าสองคอน',
                'ลาดพัฒนา',
                'หนองปลิง',
                'ห้วยแอ่ง',
                'หนองโน',
                'บัวค้อ'
            ],
            postalCodes: ['44000']
        },
        แกดำ: {
            subDistrict: ['แกดำ', 'วังแสง', 'มิตรภาพ', 'หนองกุง', 'โนนภิบาล'],
            postalCodes: ['44190']
        },
        โกสุมพิสัย: {
            subDistrict: [
                'หัวขวาง',
                'ยางน้อย',
                'วังยาว',
                'เขวาไร่',
                'แพง',
                'แก้งแก',
                'หนองเหล็ก',
                'หนองบัว',
                'เหล่า',
                'เขื่อน',
                'หนองบอน',
                'โพนงาม',
                'ยางท่าแจ้ง',
                'แห่ใต้',
                'หนองกุงสวรรค์',
                'เลิงใต้',
                'ดอนกลาง'
            ],
            postalCodes: ['44140']
        },
        กันทรวิชัย: {
            subDistrict: [
                'โคกพระ',
                'คันธารราษฎร์',
                'มะค่า',
                'ท่าขอนยาง',
                'นาสีนวน',
                'ขามเรียง',
                'เขวาใหญ่',
                'ศรีสุข',
                'กุดใส้จ่อ',
                'ขามเฒ่าพัฒนา'
            ],
            postalCodes: ['44150']
        },
        เชียงยืน: {
            subDistrict: [
                'เชียงยืน',
                'หนองซอน',
                'ดอนเงิน',
                'กู่ทอง',
                'นาทอง',
                'เสือเฒ่า',
                'โพนทอง',
                'เหล่าบัวบาน'
            ],
            postalCodes: ['44160']
        },
        บรบือ: {
            subDistrict: [
                'บรบือ',
                'บ่อใหญ่',
                'วังไชย',
                'หนองม่วง',
                'กำพี้',
                'โนนราษี',
                'โนนแดง',
                'หนองจิก',
                'บัวมาศ',
                'หนองคูขาด',
                'วังใหม่',
                'ยาง',
                'หนองสิม',
                'หนองโก',
                'ดอนงัว'
            ],
            postalCodes: ['44130']
        },
        นาเชือก: {
            subDistrict: [
                'นาเชือก',
                'สำโรง',
                'หนองแดง',
                'เขวาไร่',
                'หนองโพธิ์',
                'ปอพาน',
                'หนองเม็ก',
                'หนองเรือ',
                'หนองกุง',
                'สันป่าตอง'
            ],
            postalCodes: ['44170']
        },
        พยัคฆภูมิพิสัย: {
            subDistrict: [
                'ปะหลาน',
                'ก้ามปู',
                'เวียงสะอาด',
                'เม็กดำ',
                'นาสีนวล',
                'ราษฎร์เจริญ',
                'หนองบัวแก้ว',
                'เมืองเตา',
                'ลานสะแก',
                'เวียงชัย',
                'หนองบัว',
                'ราษฎร์พัฒนา',
                'เมืองเสือ',
                'ภารแอ่น'
            ],
            postalCodes: ['44110']
        },
        วาปีปทุม: {
            subDistrict: [
                'หนองแสง',
                'ขามป้อม',
                'เสือโก้ก',
                'ดงใหญ่',
                'โพธิ์ชัย',
                'หัวเรือ',
                'แคน',
                'งัวบา',
                'นาข่า',
                'บ้านหวาย',
                'หนองไฮ',
                'ประชาพัฒนา',
                'หนองทุ่ม',
                'หนองแสน',
                'โคกสีทองหลาง'
            ],
            postalCodes: ['44120']
        },
        นาดูน: {
            subDistrict: [
                'นาดูน',
                'หนองไผ่',
                'หนองคู',
                'ดงบัง',
                'ดงดวน',
                'หัวดง',
                'ดงยาง',
                'กู่สันตรัตน์',
                'พระธาตุ'
            ],
            postalCodes: ['44180']
        },
        ยางสีสุราช: {
            subDistrict: [
                'ยางสีสุราช',
                'นาภู',
                'แวงดง',
                'บ้านกู่',
                'ดงเมือง',
                'สร้างแซ่ง',
                'หนองบัวสันตุ'
            ],
            postalCodes: ['44210']
        },
        กุดรัง: {
            subDistrict: ['กุดรัง', 'นาโพธิ์', 'เลิงแฝก', 'หนองแวง', 'ห้วยเตย'],
            postalCodes: ['44130']
        },
        ชื่นชม: {
            subDistrict: ['ชื่นชม', 'กุดปลาดุก', 'เหล่าดอกไม้', 'หนองกุง'],
            postalCodes: ['44160']
        }
    },
    ร้อยเอ็ด: {
        เมืองร้อยเอ็ด: {
            subDistrict: [
                'ในเมือง',
                'รอบเมือง',
                'เหนือเมือง',
                'ขอนแก่น',
                'นาโพธิ์',
                'สะอาดสมบูรณ์',
                'สีแก้ว',
                'ปอภาร',
                'โนนรัง',
                'หนองแก้ว',
                'หนองแวง',
                'ดงลาน',
                'แคนใหญ่',
                'โนนตาล',
                'เมืองทอง'
            ],
            postalCodes: ['45000']
        },
        เกษตรวิสัย: {
            subDistrict: [
                'เกษตรวิสัย',
                'เมืองบัว',
                'เหล่าหลวง',
                'สิงห์โคก',
                'ดงครั่งใหญ่',
                'บ้านฝาง',
                'หนองแวง',
                'กำแพง',
                'กู่กาสิงห์',
                'น้ำอ้อม',
                'โนนสว่าง',
                'ทุ่งทอง',
                'ดงครั่งน้อย'
            ],
            postalCodes: ['45150']
        },
        ปทุมรัตต์: {
            subDistrict: [
                'บัวแดง',
                'ดอกล้ำ',
                'หนองแคน',
                'โพนสูง',
                'โนนสวรรค์',
                'สระบัว',
                'โนนสง่า',
                'ขี้เหล็ก'
            ],
            postalCodes: ['45190']
        },
        จตุรพักตรพิมาน: {
            subDistrict: [
                'หัวช้าง',
                'หนองผือ',
                'เมืองหงส์',
                'โคกล่าม',
                'น้ำใส',
                'ดงแดง',
                'ดงกลาง',
                'ป่าสังข์',
                'อีง่อง',
                'ลิ้นฟ้า',
                'ดู่น้อย',
                'ศรีโคตร'
            ],
            postalCodes: ['45180']
        },
        ธวัชบุรี: {
            subDistrict: [
                'นิเวศน์',
                'ธงธานี',
                'หนองไผ่',
                'ธวัชบุรี',
                'อุ่มเม้า',
                'มะอึ',
                'เขวาทุ่ง',
                'ไพศาล',
                'เมืองน้อย',
                'บึงนคร',
                'ราชธานี',
                'หนองพอก'
            ],
            postalCodes: ['45170']
        },
        พนมไพร: {
            subDistrict: [
                'พนมไพร',
                'แสนสุข',
                'กุดน้ำใส',
                'หนองทัพไทย',
                'โพธิ์ใหญ่',
                'วารีสวัสดิ์',
                'โคกสว่าง',
                'โพธิ์ชัย',
                'นานวล',
                'คำไฮ',
                'สระแก้ว',
                'ค้อใหญ่',
                'ชานุวรรณ'
            ],
            postalCodes: ['45140']
        },
        โพนทอง: {
            subDistrict: [
                'แวง',
                'โคกกกม่วง',
                'นาอุดม',
                'สว่าง',
                'หนองใหญ่',
                'โพธิ์ทอง',
                'โนนชัยศรี',
                'โพธิ์ศรีสว่าง',
                'อุ่มเม่า',
                'คำนาดี',
                'พรมสวรรค์',
                'สระนกแก้ว',
                'วังสามัคคี',
                'โคกสูง'
            ],
            postalCodes: ['45110']
        },
        โพธิ์ชัย: {
            subDistrict: [
                'ขามเปี้ย',
                'เชียงใหม่',
                'บัวคำ',
                'อัคคะคำ',
                'สะอาด',
                'คำพอุง',
                'หนองตาไก้',
                'ดอนโอง',
                'โพธิ์ศรี'
            ],
            postalCodes: ['45230']
        },
        หนองพอก: {
            subDistrict: [
                'หนองพอก',
                'บึงงาม',
                'ภูเขาทอง',
                'กกโพธิ์',
                'โคกสว่าง',
                'หนองขุ่นใหญ่',
                'รอบเมือง',
                'ผาน้ำย้อย',
                'ท่าสีดา'
            ],
            postalCodes: ['45210']
        },
        เสลภูมิ: {
            subDistrict: [
                'กลาง',
                'นางาม',
                'เมืองไพร',
                'นาแซง',
                'นาเมือง',
                'วังหลวง',
                'ท่าม่วง',
                'ขวาว',
                'โพธิ์ทอง',
                'ภูเงิน',
                'เกาะแก้ว',
                'นาเลิง',
                'เหล่าน้อย',
                'ศรีวิลัย',
                'หนองหลวง',
                'พรสวรรค์',
                'ขวัญเมือง',
                'บึงเกลือ'
            ],
            postalCodes: ['45120']
        },
        สุวรรณภูมิ: {
            subDistrict: [
                'สระคู',
                'ดอกไม้',
                'นาใหญ่',
                'หินกอง',
                'เมืองทุ่ง',
                'หัวโทน',
                'บ่อพันขัน',
                'ทุ่งหลวง',
                'หัวช้าง',
                'น้ำคำ',
                'ห้วยหินลาด',
                'ช้างเผือก',
                'ทุ่งกุลา',
                'ทุ่งศรีเมือง',
                'จำปาขัน'
            ],
            postalCodes: ['45130']
        },
        เมืองสรวง: {
            subDistrict: [
                'หนองผือ',
                'หนองหิน',
                'คูเมือง',
                'กกกุง',
                'เมืองสรวง'
            ],
            postalCodes: ['45220']
        },
        โพนทราย: {
            subDistrict: ['โพนทราย', 'สามขา', 'ศรีสว่าง', 'ยางคำ', 'ท่าหาดยาว'],
            postalCodes: ['45240']
        },
        อาจสามารถ: {
            subDistrict: [
                'อาจสามารถ',
                'โพนเมือง',
                'บ้านแจ้ง',
                'หน่อม',
                'หนองหมื่นถ่าน',
                'หนองขาม',
                'โหรา',
                'หนองบัว',
                'ขี้เหล็ก',
                'บ้านดู่'
            ],
            postalCodes: ['45160']
        },
        เมยวดี: {
            subDistrict: ['เมยวดี', 'ชุมพร', 'บุ่งเลิศ', 'ชมสะอาด'],
            postalCodes: ['45250']
        },
        ศรีสมเด็จ: {
            subDistrict: [
                'โพธิ์ทอง',
                'ศรีสมเด็จ',
                'เมืองเปลือย',
                'หนองใหญ่',
                'สวนจิก',
                'โพธิ์สัย',
                'หนองแวงควง',
                'บ้านบาก'
            ],
            postalCodes: ['45000', '45280']
        },
        จังหาร: {
            subDistrict: [
                'ดินดำ',
                'ปาฝา',
                'ม่วงลาด',
                'จังหาร',
                'ดงสิงห์',
                'ยางใหญ่',
                'ผักแว่น',
                'แสนชาติ'
            ],
            postalCodes: ['45000']
        },
        เชียงขวัญ: {
            subDistrict: [
                'เชียงขวัญ',
                'พลับพลา',
                'พระธาตุ',
                'พระเจ้า',
                'หมูม้น',
                'บ้านเขือง'
            ],
            postalCodes: ['45000', '45170']
        },
        หนองฮี: {
            subDistrict: ['หนองฮี', 'สาวแห', 'ดูกอึ่ง', 'เด่นราษฎร์'],
            postalCodes: ['45140']
        },
        ทุ่งเขาหลวง: {
            subDistrict: ['ทุ่งเขาหลวง', 'เทอดไทย', 'บึงงาม', 'มะบ้า', 'เหล่า'],
            postalCodes: ['45170']
        }
    },
    กาฬสินธุ์: {
        เมืองกาฬสินธุ์: {
            subDistrict: [
                'กาฬสินธุ์',
                'เหนือ',
                'หลุบ',
                'ไผ่',
                'ลำปาว',
                'ลำพาน',
                'เชียงเครือ',
                'บึงวิชัย',
                'ห้วยโพธิ์',
                'ภูปอ',
                'ภูดิน',
                'หนองกุง',
                'กลางหมื่น',
                'ขมิ้น',
                'โพนทอง',
                'นาจารย์',
                'ลำคลอง'
            ],
            postalCodes: ['46000']
        },
        นามน: {
            subDistrict: [
                'นามน',
                'ยอดแกง',
                'สงเปลือย',
                'หลักเหลี่ยม',
                'หนองบัว'
            ],
            postalCodes: ['46230']
        },
        กมลาไสย: {
            subDistrict: [
                'กมลาไสย',
                'หลักเมือง',
                'โพนงาม',
                'ดงลิง',
                'ธัญญา',
                'หนองแปน',
                'เจ้าท่า',
                'โคกสมบูรณ์'
            ],
            postalCodes: ['46130']
        },
        ร่องคำ: {
            subDistrict: ['ร่องคำ', 'สามัคคี', 'เหล่าอ้อย'],
            postalCodes: ['46210']
        },
        กุฉินารายณ์: {
            subDistrict: [
                'บัวขาว',
                'แจนแลน',
                'เหล่าใหญ่',
                'จุมจัง',
                'เหล่าไฮงาม',
                'กุดหว้า',
                'สามขา',
                'นาขาม',
                'หนองห้าง',
                'นาโก',
                'สมสะอาด',
                'กุดค้าว'
            ],
            postalCodes: ['46110']
        },
        เขาวง: {
            subDistrict: [
                'คุ้มเก่า',
                'สงเปลือย',
                'หนองผือ',
                'กุดสิมคุ้มใหม่',
                'สระพังทอง',
                'กุดปลาค้าว'
            ],
            postalCodes: ['46160']
        },
        ยางตลาด: {
            subDistrict: [
                'ยางตลาด',
                'หัวงัว',
                'อุ่มเม่า',
                'บัวบาน',
                'เว่อ',
                'อิตื้อ',
                'หัวนาคำ',
                'หนองอิเฒ่า',
                'ดอนสมบูรณ์',
                'นาเชือก',
                'คลองขาม',
                'เขาพระนอน',
                'นาดี',
                'โนนสูง',
                'หนองตอกแป้น'
            ],
            postalCodes: ['46120']
        },
        ห้วยเม็ก: {
            subDistrict: [
                'ห้วยเม็ก',
                'คำใหญ่',
                'กุดโดน',
                'บึงนาเรียง',
                'หัวหิน',
                'พิมูล',
                'คำเหมือดแก้ว',
                'โนนสะอาด',
                'ทรายทอง'
            ],
            postalCodes: ['46170']
        },
        สหัสขันธ์: {
            subDistrict: [
                'ภูสิงห์',
                'สหัสขันธ์',
                'นามะเขือ',
                'โนนศิลา',
                'นิคม',
                'โนนแหลมทอง',
                'โนนบุรี',
                'โนนน้ำเกลี้ยง'
            ],
            postalCodes: ['46140']
        },
        คำม่วง: {
            subDistrict: [
                'ทุ่งคลอง',
                'โพน',
                'ดินจี่',
                'นาบอน',
                'นาทัน',
                'เนินยาง'
            ],
            postalCodes: ['46180']
        },
        ท่าคันโท: {
            subDistrict: [
                'ท่าคันโท',
                'กุงเก่า',
                'ยางอู้ม',
                'กุดจิก',
                'นาตาล',
                'ดงสมบูรณ์'
            ],
            postalCodes: ['46190']
        },
        หนองกุงศรี: {
            subDistrict: [
                'หนองกุงศรี',
                'หนองบัว',
                'โคกเครือ',
                'หนองสรวง',
                'เสาเล้า',
                'หนองใหญ่',
                'ดงมูล',
                'ลำหนองแสน',
                'หนองหิน'
            ],
            postalCodes: ['46220']
        },
        สมเด็จ: {
            subDistrict: [
                'สมเด็จ',
                'หนองแวง',
                'แซงบาดาล',
                'มหาไชย',
                'หมูม่น',
                'ผาเสวย',
                'ศรีสมเด็จ',
                'ลำห้วยหลัว'
            ],
            postalCodes: ['46150']
        },
        ห้วยผึ้ง: {
            subDistrict: ['คำบง', 'ไค้นุ่น', 'นิคมห้วยผึ้ง', 'หนองอีบุตร'],
            postalCodes: ['46240']
        },
        สามชัย: {
            subDistrict: ['สำราญ', 'สำราญใต้', 'คำสร้างเที่ยง', 'หนองช้าง'],
            postalCodes: ['46180']
        },
        นาคู: {
            subDistrict: [
                'นาคู',
                'สายนาวัง',
                'โนนนาจาน',
                'บ่อแก้ว',
                'ภูแล่นช้าง'
            ],
            postalCodes: ['46160']
        },
        ดอนจาน: {
            subDistrict: [
                'ดอนจาน',
                'สะอาดไชยศรี',
                'ดงพยุง',
                'ม่วงนา',
                'นาจำปา'
            ],
            postalCodes: ['46000']
        },
        ฆ้องชัย: {
            subDistrict: [
                'ฆ้องชัยพัฒนา',
                'เหล่ากลาง',
                'โคกสะอาด',
                'โนนศิลาเลิง',
                'ลำชี'
            ],
            postalCodes: ['46130']
        }
    },
    สกลนคร: {
        เมืองสกลนคร: {
            subDistrict: [
                'ธาตุเชิงชุม',
                'ขมิ้น',
                'งิ้วด่อน',
                'โนนหอม',
                'เชียงเครือ',
                'ท่าแร่',
                'ม่วงลาย',
                'ดงชน',
                'ห้วยยาง',
                'พังขว้าง',
                'ดงมะไฟ',
                'ธาตุนาเวง',
                'เหล่าปอแดง',
                'หนองลาด',
                'ฮางโฮง',
                'โคกก่อง'
            ],
            postalCodes: ['47000', '47220', '47230']
        },
        กุสุมาลย์: {
            subDistrict: [
                'กุสุมาลย์',
                'นาโพธิ์',
                'นาเพียง',
                'โพธิไพศาล',
                'อุ่มจาน'
            ],
            postalCodes: ['47210', '47230']
        },
        กุดบาก: {
            subDistrict: ['กุดบาก', 'นาม่อง', 'กุดไห'],
            postalCodes: ['47180']
        },
        พรรณานิคม: {
            subDistrict: [
                'พรรณา',
                'วังยาง',
                'พอกน้อย',
                'นาหัวบ่อ',
                'ไร่',
                'ช้างมิ่ง',
                'นาใน',
                'สว่าง',
                'บะฮี',
                'เชิงชุม'
            ],
            postalCodes: ['47130', '47220']
        },
        พังโคน: {
            subDistrict: ['พังโคน', 'ม่วงไข่', 'แร่', 'ไฮหย่อง', 'ต้นผึ้ง'],
            postalCodes: ['47160']
        },
        วาริชภูมิ: {
            subDistrict: [
                'วาริชภูมิ',
                'ปลาโหล',
                'หนองลาด',
                'คำบ่อ',
                'ค้อเขียว'
            ],
            postalCodes: ['47150']
        },
        นิคมน้ำอูน: {
            subDistrict: ['นิคมน้ำอูน', 'หนองปลิง', 'หนองบัว', 'สุวรรณคาม'],
            postalCodes: ['47270']
        },
        วานรนิวาส: {
            subDistrict: [
                'วานรนิวาส',
                'เดื่อศรีคันไชย',
                'ขัวก่าย',
                'หนองสนม',
                'คูสะคาม',
                'ธาตุ',
                'หนองแวง',
                'ศรีวิชัย',
                'นาซอ',
                'อินทร์แปลง',
                'นาคำ',
                'คอนสวรรค์',
                'กุดเรือคำ',
                'หนองแวงใต้'
            ],
            postalCodes: ['47120']
        },
        คำตากล้า: {
            subDistrict: ['คำตากล้า', 'หนองบัวสิม', 'นาแต้', 'แพด'],
            postalCodes: ['47250']
        },
        บ้านม่วง: {
            subDistrict: [
                'ม่วง',
                'มาย',
                'ดงหม้อทอง',
                'ดงเหนือ',
                'ดงหม้อทองใต้',
                'ห้วยหลัว',
                'โนนสะอาด',
                'หนองกวั่ง',
                'บ่อแก้ว'
            ],
            postalCodes: ['47140']
        },
        อากาศอำนวย: {
            subDistrict: [
                'อากาศ',
                'โพนแพง',
                'วาใหญ่',
                'โพนงาม',
                'ท่าก้อน',
                'นาฮี',
                'บะหว้า',
                'สามัคคีพัฒนา'
            ],
            postalCodes: ['47170']
        },
        สว่างแดนดิน: {
            subDistrict: [
                'สว่างแดนดิน',
                'คำสะอาด',
                'บ้านต้าย',
                'บงเหนือ',
                'โพนสูง',
                'โคกสี',
                'หนองหลวง',
                'บงใต้',
                'ค้อใต้',
                'พันนา',
                'แวง',
                'ทรายมูล',
                'ตาลโกน',
                'ตาลเนิ้ง',
                'ธาตุทอง',
                'บ้านถ่อน'
            ],
            postalCodes: ['47110', '47240']
        },
        ส่องดาว: {
            subDistrict: ['ส่องดาว', 'ท่าศิลา', 'วัฒนา', 'ปทุมวาปี'],
            postalCodes: ['47190']
        },
        เต่างอย: {
            subDistrict: ['เต่างอย', 'บึงทวาย', 'นาตาล', 'จันทร์เพ็ญ'],
            postalCodes: ['47260']
        },
        โคกศรีสุพรรณ: {
            subDistrict: ['ตองโขบ', 'เหล่าโพนค้อ', 'ด่านม่วงคำ', 'แมดนาท่ม'],
            postalCodes: ['47280']
        },
        เจริญศิลป์: {
            subDistrict: [
                'บ้านเหล่า',
                'เจริญศิลป์',
                'ทุ่งแก',
                'โคกศิลา',
                'หนองแปน'
            ],
            postalCodes: ['47290']
        },
        โพนนาแก้ว: {
            subDistrict: [
                'บ้านโพน',
                'นาแก้ว',
                'นาตงวัฒนา',
                'บ้านแป้น',
                'เชียงสือ'
            ],
            postalCodes: ['47230']
        },
        ภูพาน: {
            subDistrict: ['สร้างค้อ', 'หลุบเลา', 'โคกภู', 'กกปลาซิว'],
            postalCodes: ['47180']
        }
    },
    นครพนม: {
        เมืองนครพนม: {
            subDistrict: [
                'ในเมือง',
                'หนองแสง',
                'นาทราย',
                'นาราชควาย',
                'กุรุคุ',
                'บ้านผึ้ง',
                'อาจสามารถ',
                'ขามเฒ่า',
                'บ้านกลาง',
                'ท่าค้อ',
                'คำเตย',
                'หนองญาติ',
                'ดงขวาง',
                'วังตามัว',
                'โพธิ์ตาก'
            ],
            postalCodes: ['48000']
        },
        ปลาปาก: {
            subDistrict: [
                'ปลาปาก',
                'หนองฮี',
                'กุตาไก้',
                'โคกสว่าง',
                'โคกสูง',
                'มหาชัย',
                'นามะเขือ',
                'หนองเทาใหญ่'
            ],
            postalCodes: ['48160']
        },
        ท่าอุเทน: {
            subDistrict: [
                'ท่าอุเทน',
                'โนนตาล',
                'ท่าจำปา',
                'ไชยบุรี',
                'พนอม',
                'พะทาย',
                'เวินพระบาท',
                'รามราช',
                'หนองเทา'
            ],
            postalCodes: ['48120']
        },
        บ้านแพง: {
            subDistrict: [
                'บ้านแพง',
                'ไผ่ล้อม',
                'โพนทอง',
                'หนองแวง',
                'นางัว',
                'นาเข'
            ],
            postalCodes: ['48140']
        },
        ธาตุพนม: {
            subDistrict: [
                'ธาตุพนม',
                'ฝั่งแดง',
                'โพนแพง',
                'พระกลางทุ่ง',
                'นาถ่อน',
                'แสนพัน',
                'ดอนนางหงส์',
                'น้ำก่ำ',
                'อุ่มเหม้า',
                'นาหนาด',
                'กุดฉิม',
                'ธาตุพนมเหนือ'
            ],
            postalCodes: ['48110']
        },
        เรณูนคร: {
            subDistrict: [
                'เรณู',
                'โพนทอง',
                'ท่าลาด',
                'นางาม',
                'โคกหินแฮ่',
                'หนองย่างชิ้น',
                'เรณูใต้',
                'นาขาม'
            ],
            postalCodes: ['48170']
        },
        นาแก: {
            subDistrict: [
                'นาแก',
                'พระซอง',
                'หนองสังข์',
                'นาคู่',
                'พิมาน',
                'พุ่มแก',
                'ก้านเหลือง',
                'หนองบ่อ',
                'นาเลียง',
                'บ้านแก้ง',
                'คำพี้',
                'สีชมพู'
            ],
            postalCodes: ['48130']
        },
        ศรีสงคราม: {
            subDistrict: [
                'ศรีสงคราม',
                'นาเดื่อ',
                'บ้านเอื้อง',
                'สามผง',
                'ท่าบ่อสงคราม',
                'บ้านข่า',
                'นาคำ',
                'โพนสว่าง',
                'หาดแพง'
            ],
            postalCodes: ['48150']
        },
        นาหว้า: {
            subDistrict: [
                'นาหว้า',
                'นางัว',
                'บ้านเสียว',
                'นาคูณใหญ่',
                'เหล่าพัฒนา',
                'ท่าเรือ'
            ],
            postalCodes: ['48180']
        },
        โพนสวรรค์: {
            subDistrict: [
                'โพนสวรรค์',
                'นาหัวบ่อ',
                'นาขมิ้น',
                'โพนบก',
                'บ้านค้อ',
                'โพนจาน',
                'นาใน'
            ],
            postalCodes: ['48190']
        },
        นาทม: {
            subDistrict: ['นาทม', 'หนองซน', 'ดอนเตย'],
            postalCodes: ['48140']
        },
        วังยาง: {
            subDistrict: ['วังยาง', 'โคกสี', 'ยอดชาด', 'หนองโพธิ์'],
            postalCodes: ['48130']
        }
    },
    มุกดาหาร: {
        เมืองมุกดาหาร: {
            subDistrict: [
                'มุกดาหาร',
                'ศรีบุญเรือง',
                'บ้านโคก',
                'บางทรายใหญ่',
                'โพนทราย',
                'ผึ่งแดด',
                'นาโสก',
                'นาสีนวน',
                'คำป่าหลาย',
                'คำอาฮวน',
                'ดงเย็น',
                'ดงมอน',
                'กุดแข้'
            ],
            postalCodes: ['49000']
        },
        นิคมคำสร้อย: {
            subDistrict: [
                'นิคมคำสร้อย',
                'นากอก',
                'หนองแวง',
                'กกแดง',
                'นาอุดม',
                'โชคชัย',
                'ร่มเกล้า'
            ],
            postalCodes: ['49130']
        },
        ดอนตาล: {
            subDistrict: [
                'ดอนตาล',
                'โพธิ์ไทร',
                'ป่าไร่',
                'เหล่าหมี',
                'บ้านบาก',
                'นาสะเม็ง',
                'บ้านแก้ง'
            ],
            postalCodes: ['49120']
        },
        ดงหลวง: {
            subDistrict: [
                'ดงหลวง',
                'หนองบัว',
                'กกตูม',
                'หนองแคน',
                'ชะโนดน้อย',
                'พังแดง'
            ],
            postalCodes: ['49140']
        },
        คำชะอี: {
            subDistrict: [
                'บ้านซ่ง',
                'คำชะอี',
                'หนองเอี่ยน',
                'บ้านค้อ',
                'บ้านเหล่า',
                'โพนงาม',
                'เหล่าสร้างถ่อ',
                'คำบก',
                'น้ำเที่ยง'
            ],
            postalCodes: ['49110']
        },
        หว้านใหญ่: {
            subDistrict: [
                'หว้านใหญ่',
                'ป่งขาม',
                'บางทรายน้อย',
                'ชะโนด',
                'ดงหมู'
            ],
            postalCodes: ['49150']
        },
        หนองสูง: {
            subDistrict: [
                'หนองสูง',
                'โนนยาง',
                'ภูวง',
                'บ้านเป้า',
                'หนองสูงใต้',
                'หนองสูงเหนือ'
            ],
            postalCodes: ['49160']
        }
    },
    เชียงใหม่: {
        เมืองเชียงใหม่: {
            subDistrict: [
                'ศรีภูมิ',
                'พระสิงห์',
                'หายยา',
                'ช้างม่อย',
                'ช้างคลาน',
                'วัดเกต',
                'ช้างเผือก',
                'สุเทพ',
                'แม่เหียะ',
                'ป่าแดด',
                'หนองหอย',
                'ท่าศาลา',
                'หนองป่าครั่ง',
                'ฟ้าฮ่าม',
                'ป่าตัน',
                'สันผีเสื้อ'
            ],
            postalCodes: ['50200', '50100', '50300', '50000']
        },
        จอมทอง: {
            subDistrict: [
                'บ้านหลวง',
                'ข่วงเปา',
                'สบเตี๊ยะ',
                'บ้านแปะ',
                'ดอยแก้ว',
                'แม่สอย'
            ],
            postalCodes: ['50160', '50240']
        },
        แม่แจ่ม: {
            subDistrict: [
                'ช่างเคิ่ง',
                'ท่าผา',
                'บ้านทับ',
                'แม่ศึก',
                'แม่นาจร',
                'ปางหินฝน',
                'กองแขก'
            ],
            postalCodes: ['50270']
        },
        เชียงดาว: {
            subDistrict: [
                'เชียงดาว',
                'เมืองนะ',
                'เมืองงาย',
                'แม่นะ',
                'เมืองคอง',
                'ปิงโค้ง',
                'ทุ่งข้าวพวง'
            ],
            postalCodes: ['50170']
        },
        ดอยสะเก็ด: {
            subDistrict: [
                'เชิงดอย',
                'สันปูเลย',
                'ลวงเหนือ',
                'ป่าป้อง',
                'สง่าบ้าน',
                'ป่าลาน',
                'ตลาดขวัญ',
                'สำราญราษฎร์',
                'แม่คือ',
                'ตลาดใหญ่',
                'แม่ฮ้อยเงิน',
                'แม่โป่ง',
                'ป่าเมี่ยง',
                'เทพเสด็จ'
            ],
            postalCodes: ['50220']
        },
        แม่แตง: {
            subDistrict: [
                'สันมหาพน',
                'แม่แตง',
                'ขี้เหล็ก',
                'ช่อแล',
                'แม่หอพระ',
                'สบเปิง',
                'บ้านเป้า',
                'สันป่ายาง',
                'ป่าแป๋',
                'เมืองก๋าย',
                'บ้านช้าง',
                'กื้ดช้าง',
                'อินทขิล'
            ],
            postalCodes: ['50150', '50330']
        },
        แม่ริม: {
            subDistrict: [
                'ริมใต้',
                'ริมเหนือ',
                'สันโป่ง',
                'ขี้เหล็ก',
                'สะลวง',
                'ห้วยทราย',
                'แม่แรม',
                'โป่งแยง',
                'แม่สา',
                'ดอนแก้ว',
                'เหมืองแก้ว'
            ],
            postalCodes: ['50180', '50330']
        },
        สะเมิง: {
            subDistrict: [
                'สะเมิงใต้',
                'สะเมิงเหนือ',
                'แม่สาบ',
                'บ่อแก้ว',
                'ยั้งเมิน'
            ],
            postalCodes: ['50250']
        },
        ฝาง: {
            subDistrict: [
                'เวียง',
                'ม่อนปิ่น',
                'แม่งอน',
                'แม่สูน',
                'สันทราย',
                'แม่คะ',
                'แม่ข่า',
                'โป่งน้ำร้อน'
            ],
            postalCodes: ['50110', '50320']
        },
        แม่อาย: {
            subDistrict: [
                'แม่อาย',
                'แม่สาว',
                'สันต้นหมื้อ',
                'แม่นาวาง',
                'ท่าตอน',
                'บ้านหลวง',
                'มะลิกา'
            ],
            postalCodes: ['50280']
        },
        พร้าว: {
            subDistrict: [
                'เวียง',
                'ทุ่งหลวง',
                'ป่าตุ้ม',
                'ป่าไหน่',
                'สันทราย',
                'บ้านโป่ง',
                'น้ำแพร่',
                'เขื่อนผาก',
                'แม่แวน',
                'แม่ปั๋ง',
                'โหล่งขอด'
            ],
            postalCodes: ['50190']
        },
        สันป่าตอง: {
            subDistrict: [
                'ยุหว่า',
                'สันกลาง',
                'ท่าวังพร้าว',
                'มะขามหลวง',
                'แม่ก๊า',
                'บ้านแม',
                'บ้านกลาง',
                'ทุ่งสะโตก',
                'ทุ่งต้อม',
                'น้ำบ่อหลวง',
                'มะขุนหวาน'
            ],
            postalCodes: ['50120']
        },
        สันกำแพง: {
            subDistrict: [
                'สันกำแพง',
                'ทรายมูล',
                'ร้องวัวแดง',
                'บวกค้าง',
                'แช่ช้าง',
                'ออนใต้',
                'แม่ปูคา',
                'ห้วยทราย',
                'ต้นเปา',
                'สันกลาง'
            ],
            postalCodes: ['50130']
        },
        สันทราย: {
            subDistrict: [
                'สันทรายหลวง',
                'สันทรายน้อย',
                'สันพระเนตร',
                'สันนาเม็ง',
                'สันป่าเปา',
                'หนองแหย่ง',
                'หนองจ๊อม',
                'หนองหาร',
                'แม่แฝก',
                'แม่แฝกใหม่',
                'เมืองเล็น',
                'ป่าไผ่'
            ],
            postalCodes: ['50210', '50290']
        },
        หางดง: {
            subDistrict: [
                'หางดง',
                'หนองแก๋ว',
                'หารแก้ว',
                'หนองตอง',
                'ขุนคง',
                'สบแม่ข่า',
                'บ้านแหวน',
                'สันผักหวาน',
                'หนองควาย',
                'บ้านปง',
                'น้ำแพร่'
            ],
            postalCodes: ['50230', '50340']
        },
        ฮอด: {
            subDistrict: [
                'หางดง',
                'ฮอด',
                'บ้านตาล',
                'บ่อหลวง',
                'บ่อสลี',
                'นาคอเรือ'
            ],
            postalCodes: ['50240']
        },
        ดอยเต่า: {
            subDistrict: [
                'ดอยเต่า',
                'ท่าเดื่อ',
                'มืดกา',
                'บ้านแอ่น',
                'บงตัน',
                'โปงทุ่ง'
            ],
            postalCodes: ['50260']
        },
        อมก๋อย: {
            subDistrict: [
                'อมก๋อย',
                'ยางเปียง',
                'แม่ตื่น',
                'ม่อนจอง',
                'สบโขง',
                'นาเกียน'
            ],
            postalCodes: ['50310']
        },
        สารภี: {
            subDistrict: [
                'ยางเนิ้ง',
                'สารภี',
                'ชมภู',
                'ไชยสถาน',
                'ขัวมุง',
                'หนองแฝก',
                'หนองผึ้ง',
                'ท่ากว้าง',
                'ดอนแก้ว',
                'ท่าวังตาล',
                'สันทราย',
                'ป่าบง'
            ],
            postalCodes: ['50140']
        },
        เวียงแหง: {
            subDistrict: ['เมืองแหง', 'เปียงหลวง', 'แสนไห'],
            postalCodes: ['50350']
        },
        ไชยปราการ: {
            subDistrict: ['ปงตำ', 'ศรีดงเย็น', 'แม่ทะลบ', 'หนองบัว'],
            postalCodes: ['50320']
        },
        แม่วาง: {
            subDistrict: [
                'บ้านกาด',
                'ทุ่งปี๊',
                'ทุ่งรวงทอง',
                'แม่วิน',
                'ดอนเปา'
            ],
            postalCodes: ['50360']
        },
        แม่ออน: {
            subDistrict: [
                'ออนเหนือ',
                'ออนกลาง',
                'บ้านสหกรณ์',
                'ห้วยแก้ว',
                'แม่ทา',
                'ทาเหนือ'
            ],
            postalCodes: ['50130']
        },
        ดอยหล่อ: {
            subDistrict: ['ดอยหล่อ', 'สองแคว', 'ยางคราม', 'สันติสุข'],
            postalCodes: ['50160']
        },
        กัลยาณิวัฒนา: {
            subDistrict: ['บ้านจันทร์', 'แม่แดด', 'แจ่มหลวง'],
            postalCodes: ['58130']
        }
    },
    ลำพูน: {
        เมืองลำพูน: {
            subDistrict: [
                'ในเมือง',
                'เหมืองง่า',
                'อุโมงค์',
                'หนองช้างคืน',
                'ประตูป่า',
                'ริมปิง',
                'ต้นธง',
                'บ้านแป้น',
                'เหมืองจี้',
                'ป่าสัก',
                'เวียงยอง',
                'บ้านกลาง',
                'มะเขือแจ้',
                'ศรีบัวบาน',
                'หนองหนาม'
            ],
            postalCodes: ['51000', '51150']
        },
        แม่ทา: {
            subDistrict: [
                'ทาปลาดุก',
                'ทาสบเส้า',
                'ทากาศ',
                'ทาขุมเงิน',
                'ทาทุ่งหลวง',
                'ทาแม่ลอบ'
            ],
            postalCodes: ['51140', '51170']
        },
        บ้านโฮ่ง: {
            subDistrict: [
                'บ้านโฮ่ง',
                'ป่าพลู',
                'เหล่ายาว',
                'ศรีเตี้ย',
                'หนองปลาสะวาย'
            ],
            postalCodes: ['51130']
        },
        ลี้: {
            subDistrict: [
                'ลี้',
                'แม่ตืน',
                'นาทราย',
                'ดงดำ',
                'ก้อ',
                'แม่ลาน',
                'ป่าไผ่',
                'ศรีวิชัย'
            ],
            postalCodes: ['51110']
        },
        ทุ่งหัวช้าง: {
            subDistrict: ['ทุ่งหัวช้าง', 'บ้านปวง', 'ตะเคียนปม'],
            postalCodes: ['51160']
        },
        ป่าซาง: {
            subDistrict: [
                'ปากบ่อง',
                'ป่าซาง',
                'แม่แรง',
                'ม่วงน้อย',
                'บ้านเรือน',
                'มะกอก',
                'ท่าตุ้ม',
                'น้ำดิบ',
                'นครเจดีย์'
            ],
            postalCodes: ['51120']
        },
        บ้านธิ: {
            subDistrict: ['บ้านธิ', 'ห้วยยาบ'],
            postalCodes: ['51180']
        },
        เวียงหนองล่อง: {
            subDistrict: ['หนองล่อง', 'หนองยวง', 'วังผาง'],
            postalCodes: ['51120']
        }
    },
    ลำปาง: {
        เมืองลำปาง: {
            subDistrict: [
                'เวียงเหนือ',
                'หัวเวียง',
                'สวนดอก',
                'สบตุ๋ย',
                'พระบาท',
                'ชมพู',
                'กล้วยแพะ',
                'ปงแสนทอง',
                'บ้านแลง',
                'บ้านเสด็จ',
                'พิชัย',
                'ทุ่งฝาย',
                'บ้านเอื้อม',
                'บ้านเป้า',
                'บ้านค่า',
                'บ่อแฮ้ว',
                'ต้นธงชัย',
                'นิคมพัฒนา',
                'บุญนาคพัฒนา'
            ],
            postalCodes: ['52000', '52100']
        },
        แม่เมาะ: {
            subDistrict: ['บ้านดง', 'นาสัก', 'จางเหนือ', 'แม่เมาะ', 'สบป้าด'],
            postalCodes: ['52220']
        },
        เกาะคา: {
            subDistrict: [
                'ลำปางหลวง',
                'นาแก้ว',
                'ไหล่หิน',
                'วังพร้าว',
                'ศาลา',
                'เกาะคา',
                'นาแส่ง',
                'ท่าผา',
                'ใหม่พัฒนา'
            ],
            postalCodes: ['52130']
        },
        เสริมงาม: {
            subDistrict: ['ทุ่งงาม', 'เสริมขวา', 'เสริมซ้าย', 'เสริมกลาง'],
            postalCodes: ['52210']
        },
        งาว: {
            subDistrict: [
                'หลวงเหนือ',
                'หลวงใต้',
                'บ้านโป่ง',
                'บ้านร้อง',
                'ปงเตา',
                'นาแก',
                'บ้านอ้อน',
                'บ้านแหง',
                'บ้านหวด',
                'แม่ตีบ'
            ],
            postalCodes: ['52110']
        },
        แจ้ห่ม: {
            subDistrict: [
                'แจ้ห่ม',
                'บ้านสา',
                'ปงดอน',
                'แม่สุก',
                'เมืองมาย',
                'ทุ่งผึ้ง',
                'วิเชตนคร'
            ],
            postalCodes: ['52120']
        },
        วังเหนือ: {
            subDistrict: [
                'ทุ่งฮั้ว',
                'วังเหนือ',
                'วังใต้',
                'ร่องเคาะ',
                'วังทอง',
                'วังซ้าย',
                'วังแก้ว',
                'วังทรายคำ'
            ],
            postalCodes: ['52140']
        },
        เถิน: {
            subDistrict: [
                'ล้อมแรด',
                'แม่วะ',
                'แม่ปะ',
                'แม่มอก',
                'เวียงมอก',
                'นาโป่ง',
                'แม่ถอด',
                'เถินบุรี'
            ],
            postalCodes: ['52160', '52230']
        },
        แม่พริก: {
            subDistrict: ['แม่พริก', 'ผาปัง', 'แม่ปุ', 'พระบาทวังตวง'],
            postalCodes: ['52180', '52230']
        },
        แม่ทะ: {
            subDistrict: [
                'แม่ทะ',
                'นาครัว',
                'ป่าตัน',
                'บ้านกิ่ว',
                'บ้านบอม',
                'น้ำโจ้',
                'ดอนไฟ',
                'หัวเสือ',
                'วังเงิน',
                'สันดอนแก้ว'
            ],
            postalCodes: ['52150']
        },
        สบปราบ: {
            subDistrict: ['สบปราบ', 'สมัย', 'แม่กัวะ', 'นายาง'],
            postalCodes: ['52170']
        },
        ห้างฉัตร: {
            subDistrict: [
                'ห้างฉัตร',
                'หนองหล่ม',
                'เมืองยาว',
                'ปงยางคก',
                'เวียงตาล',
                'แม่สัน',
                'วอแก้ว'
            ],
            postalCodes: ['52190']
        },
        เมืองปาน: {
            subDistrict: [
                'เมืองปาน',
                'บ้านขอ',
                'ทุ่งกว๋าว',
                'แจ้ซ้อน',
                'หัวเมือง'
            ],
            postalCodes: ['52240']
        }
    },
    อุตรดิตถ์: {
        เมืองอุตรดิตถ์: {
            subDistrict: [
                'ท่าอิฐ',
                'ท่าเสา',
                'บ้านเกาะ',
                'ป่าเซ่า',
                'คุ้งตะเภา',
                'วังกะพี้',
                'หาดกรวด',
                'น้ำริด',
                'งิ้วงาม',
                'บ้านด่านนาขาม',
                'บ้านด่าน',
                'ผาจุก',
                'วังดิน',
                'แสนตอ',
                'หาดงิ้ว',
                'ขุนฝาง',
                'ถ้ำฉลอง'
            ],
            postalCodes: ['53000', '53170']
        },
        ตรอน: {
            subDistrict: [
                'วังแดง',
                'บ้านแก่ง',
                'หาดสองแคว',
                'น้ำอ่าง',
                'ข่อยสูง'
            ],
            postalCodes: ['53140']
        },
        ท่าปลา: {
            subDistrict: [
                'ท่าปลา',
                'หาดล้า',
                'ผาเลือด',
                'จริม',
                'น้ำหมัน',
                'นางพญา',
                'ร่วมจิต'
            ],
            postalCodes: ['53150', '53190']
        },
        น้ำปาด: {
            subDistrict: [
                'แสนตอ',
                'บ้านฝาย',
                'เด่นเหล็ก',
                'น้ำไคร้',
                'น้ำไผ่',
                'ห้วยมุ่น',
                'ท่าแฝก'
            ],
            postalCodes: ['53110']
        },
        ฟากท่า: {
            subDistrict: ['ฟากท่า', 'สองคอน', 'บ้านเสี้ยว', 'สองห้อง'],
            postalCodes: ['53160']
        },
        บ้านโคก: {
            subDistrict: ['ม่วงเจ็ดต้น', 'บ้านโคก', 'นาขุม', 'บ่อเบี้ย'],
            postalCodes: ['53180']
        },
        พิชัย: {
            subDistrict: [
                'ในเมือง',
                'บ้านดารา',
                'ไร่อ้อย',
                'ท่าสัก',
                'คอรุม',
                'บ้านหม้อ',
                'ท่ามะเฟือง',
                'บ้านโคน',
                'พญาแมน',
                'นาอิน',
                'นายาง'
            ],
            postalCodes: ['53120', '53220']
        },
        ลับแล: {
            subDistrict: [
                'ศรีพนมมาศ',
                'แม่พูล',
                'นานกกก',
                'ฝายหลวง',
                'ชัยจุมพล',
                'ไผ่ล้อม',
                'ทุ่งยั้ง',
                'ด่านแม่คำมัน'
            ],
            postalCodes: ['53130', '53210']
        },
        ทองแสนขัน: {
            subDistrict: ['ผักขวง', 'บ่อทอง', 'ป่าคาย', 'น้ำพี้'],
            postalCodes: ['53230']
        }
    },
    แพร่: {
        เมืองแพร่: {
            subDistrict: [
                'ในเวียง',
                'นาจักร',
                'น้ำชำ',
                'ป่าแดง',
                'ทุ่งโฮ้ง',
                'เหมืองหม้อ',
                'วังธง',
                'แม่หล่าย',
                'ห้วยม้า',
                'ป่าแมต',
                'บ้านถิ่น',
                'สวนเขื่อน',
                'วังหงส์',
                'แม่คำมี',
                'ทุ่งกวาว',
                'ท่าข้าม',
                'แม่ยม',
                'ช่อแฮ',
                'ร่องฟอง',
                'กาญจนา'
            ],
            postalCodes: ['54000']
        },
        ร้องกวาง: {
            subDistrict: [
                'ร้องกวาง',
                'ร้องเข็ม',
                'น้ำเลา',
                'บ้านเวียง',
                'ทุ่งศรี',
                'แม่ยางตาล',
                'แม่ยางฮ่อ',
                'ไผ่โทน',
                'ห้วยโรง',
                'แม่ทราย',
                'แม่ยางร้อง'
            ],
            postalCodes: ['54140']
        },
        ลอง: {
            subDistrict: [
                'ห้วยอ้อ',
                'บ้านปิน',
                'ต้าผามอก',
                'เวียงต้า',
                'ปากกาง',
                'หัวทุ่ง',
                'ทุ่งแล้ง',
                'บ่อเหล็กลอง',
                'แม่ปาน'
            ],
            postalCodes: ['54150']
        },
        สูงเม่น: {
            subDistrict: [
                'สูงเม่น',
                'น้ำชำ',
                'หัวฝาย',
                'ดอนมูล',
                'บ้านเหล่า',
                'บ้านกวาง',
                'บ้านปง',
                'บ้านกาศ',
                'ร่องกาศ',
                'สบสาย',
                'เวียงทอง',
                'พระหลวง'
            ],
            postalCodes: ['54130', '54000']
        },
        เด่นชัย: {
            subDistrict: [
                'เด่นชัย',
                'แม่จั๊วะ',
                'ไทรย้อย',
                'ห้วยไร่',
                'ปงป่าหวาย'
            ],
            postalCodes: ['54110']
        },
        สอง: {
            subDistrict: [
                'บ้านหนุน',
                'บ้านกลาง',
                'ห้วยหม้าย',
                'เตาปูน',
                'หัวเมือง',
                'สะเอียบ',
                'แดนชุมพล',
                'ทุ่งน้าว'
            ],
            postalCodes: ['54120']
        },
        วังชิ้น: {
            subDistrict: [
                'วังชิ้น',
                'สรอย',
                'แม่ป้าก',
                'นาพูน',
                'แม่พุง',
                'ป่าสัก',
                'แม่เกิ๋ง'
            ],
            postalCodes: ['54160']
        },
        หนองม่วงไข่: {
            subDistrict: [
                'แม่คำมี',
                'หนองม่วงไข่',
                'น้ำรัด',
                'วังหลวง',
                'ตำหนักธรรม',
                'ทุ่งแค้ว'
            ],
            postalCodes: ['54170']
        }
    },
    น่าน: {
        เมืองน่าน: {
            subDistrict: [
                'ในเวียง',
                'บ่อ',
                'ผาสิงห์',
                'ไชยสถาน',
                'ถืมตอง',
                'เรือง',
                'นาซาว',
                'ดู่ใต้',
                'กองควาย',
                'บ่อสวก',
                'สะเนียน'
            ],
            postalCodes: ['55000']
        },
        แม่จริม: {
            subDistrict: ['หนองแดง', 'หมอเมือง', 'น้ำพาง', 'น้ำปาย', 'แม่จริม'],
            postalCodes: ['55170']
        },
        บ้านหลวง: {
            subDistrict: ['บ้านฟ้า', 'ป่าคาหลวง', 'สวด', 'บ้านพี้'],
            postalCodes: ['55190']
        },
        นาน้อย: {
            subDistrict: [
                'นาน้อย',
                'เชียงของ',
                'ศรีษะเกษ',
                'สถาน',
                'สันทะ',
                'บัวใหญ่',
                'น้ำตก'
            ],
            postalCodes: ['55150']
        },
        ปัว: {
            subDistrict: [
                'ปัว',
                'แงง',
                'สถาน',
                'ศิลาแลง',
                'ศิลาเพชร',
                'อวน',
                'ไชยวัฒนา',
                'เจดีย์ชัย',
                'ภูคา',
                'สกาด',
                'ป่ากลาง',
                'วรนคร'
            ],
            postalCodes: ['55120']
        },
        ท่าวังผา: {
            subDistrict: [
                'ริม',
                'ป่าคา',
                'ผาตอ',
                'ยม',
                'ตาลชุม',
                'ศรีภูมิ',
                'จอมพระ',
                'แสนทอง',
                'ท่าวังผา',
                'ผาทอง'
            ],
            postalCodes: ['55140']
        },
        เวียงสา: {
            subDistrict: [
                'กลางเวียง',
                'ขึ่ง',
                'ไหล่น่าน',
                'ตาลชุม',
                'นาเหลือง',
                'ส้าน',
                'น้ำมวบ',
                'น้ำปั้ว',
                'ยาบหัวนา',
                'ปงสนุก',
                'อ่ายนาไลย',
                'ส้านนาหนองใหม่',
                'แม่ขะนิง',
                'แม่สาคร',
                'จอมจันทร์',
                'แม่สา',
                'ทุ่งศรีทอง'
            ],
            postalCodes: ['55110']
        },
        ทุ่งช้าง: {
            subDistrict: ['ปอน', 'งอบ', 'และ', 'ทุ่งช้าง'],
            postalCodes: ['55130']
        },
        เชียงกลาง: {
            subDistrict: [
                'เชียงกลาง',
                'เปือ',
                'เชียงคาน',
                'พระธาตุ',
                'พญาแก้ว',
                'พระพุทธบาท'
            ],
            postalCodes: ['55160']
        },
        นาหมื่น: {
            subDistrict: ['นาทะนุง', 'บ่อแก้ว', 'เมืองลี', 'ปิงหลวง'],
            postalCodes: ['55180']
        },
        สันติสุข: {
            subDistrict: ['ดู่พงษ์', 'ป่าแลวหลวง', 'พงษ์'],
            postalCodes: ['55210']
        },
        บ่อเกลือ: {
            subDistrict: ['บ่อเกลือเหนือ', 'บ่อเกลือใต้', 'ภูฟ้า', 'ดงพญา'],
            postalCodes: ['55220']
        },
        สองแคว: {
            subDistrict: ['นาไร่หลวง', 'ชนแดน', 'ยอด'],
            postalCodes: ['55160']
        },
        ภูเพียง: {
            subDistrict: [
                'ม่วงตึ๊ด',
                'นาปัง',
                'น้ำแก่น',
                'น้ำเกี๋ยน',
                'เมืองจัง',
                'ท่าน้าว',
                'ฝายแก้ว'
            ],
            postalCodes: ['55000']
        },
        เฉลิมพระเกียรติ: {
            subDistrict: ['ห้วยโก๋น', 'ขุนน่าน'],
            postalCodes: ['55130', '55220']
        }
    },
    พะเยา: {
        เมืองพะเยา: {
            subDistrict: [
                'เวียง',
                'แม่ต๋ำ',
                'แม่นาเรือ',
                'บ้านตุ่น',
                'บ้านต๊ำ',
                'บ้านต๋อม',
                'แม่ปืม',
                'แม่กา',
                'บ้านใหม่',
                'จำป่าหวาย',
                'ท่าวังทอง',
                'แม่ใส',
                'บ้านสาง',
                'ท่าจำปี',
                'สันป่าม่วง'
            ],
            postalCodes: ['56000']
        },
        จุน: {
            subDistrict: [
                'ห้วยข้าวก่ำ',
                'จุน',
                'ลอ',
                'หงส์หิน',
                'ทุ่งรวงทอง',
                'ห้วยยางขาม',
                'พระธาตุขิงแกง'
            ],
            postalCodes: ['56150']
        },
        เชียงคำ: {
            subDistrict: [
                'หย่วน',
                'น้ำแวน',
                'เวียง',
                'ฝายกวาง',
                'เจดีย์คำ',
                'ร่มเย็น',
                'เชียงบาน',
                'แม่ลาว',
                'อ่างทอง',
                'ทุ่งผาสุข'
            ],
            postalCodes: ['56110']
        },
        เชียงม่วน: {
            subDistrict: ['เชียงม่วน', 'บ้านมาง', 'สระ'],
            postalCodes: ['56160']
        },
        ดอกคำใต้: {
            subDistrict: [
                'ดอกคำใต้',
                'ดอนศรีชุม',
                'บ้านถ้ำ',
                'บ้านปิน',
                'ห้วยลาน',
                'สันโค้ง',
                'ป่าซาง',
                'หนองหล่ม',
                'ดงสุวรรณ',
                'บุญเกิด',
                'สว่างอารมณ์',
                'คือเวียง'
            ],
            postalCodes: ['56120']
        },
        ปง: {
            subDistrict: [
                'ปง',
                'ควร',
                'ออย',
                'งิม',
                'ผาช้างน้อย',
                'นาปรัง',
                'ขุนควร'
            ],
            postalCodes: ['56140']
        },
        แม่ใจ: {
            subDistrict: [
                'แม่ใจ',
                'ศรีถ้อย',
                'แม่สุก',
                'ป่าแฝก',
                'บ้านเหล่า',
                'เจริญราษฎร์'
            ],
            postalCodes: ['56130']
        },
        ภูซาง: {
            subDistrict: ['ภูซาง', 'ป่าสัก', 'ทุ่งกล้วย', 'เชียงแรง', 'สบบง'],
            postalCodes: ['56110']
        },
        ภูกามยาว: {
            subDistrict: ['ห้วยแก้ว', 'ดงเจน', 'แม่อิง'],
            postalCodes: ['56000']
        }
    },
    เชียงราย: {
        เมืองเชียงราย: {
            subDistrict: [
                'เวียง',
                'รอบเวียง',
                'บ้านดู่',
                'นางแล',
                'แม่ข้าวต้ม',
                'แม่ยาว',
                'สันทราย',
                'แม่กรณ์',
                'ห้วยชมภู',
                'ห้วยสัก',
                'ริมกก',
                'ดอยลาน',
                'ป่าอ้อดอนชัย',
                'ท่าสาย',
                'ดอยฮาง',
                'ท่าสุด'
            ],
            postalCodes: ['57000', '57100']
        },
        เวียงชัย: {
            subDistrict: [
                'เวียงชัย',
                'ผางาม',
                'เวียงเหนือ',
                'ดอนศิลา',
                'เมืองชุม'
            ],
            postalCodes: ['57210']
        },
        เชียงของ: {
            subDistrict: [
                'เวียง',
                'สถาน',
                'ครึ่ง',
                'บุญเรือง',
                'ห้วยซ้อ',
                'ศรีดอนชัย',
                'ริมโขง'
            ],
            postalCodes: ['57140']
        },
        เทิง: {
            subDistrict: [
                'เวียง',
                'งิ้ว',
                'ปล้อง',
                'แม่ลอย',
                'เชียงเคี่ยน',
                'ตับเต่า',
                'หงาว',
                'สันทรายงาม',
                'ศรีดอนไชย',
                'หนองแรด'
            ],
            postalCodes: ['57160', '57230']
        },
        พาน: {
            subDistrict: [
                'สันมะเค็ด',
                'แม่อ้อ',
                'ธารทอง',
                'สันติสุข',
                'ดอยงาม',
                'หัวง้ม',
                'เจริญเมือง',
                'ป่าหุ่ง',
                'ม่วงคำ',
                'ทรายขาว',
                'สันกลาง',
                'แม่เย็น',
                'เมืองพาน',
                'ทานตะวัน',
                'เวียงห้าว'
            ],
            postalCodes: ['57120', '57250', '57280']
        },
        ป่าแดด: {
            subDistrict: [
                'ป่าแดด',
                'ป่าแงะ',
                'สันมะค่า',
                'โรงช้าง',
                'ศรีโพธิ์เงิน'
            ],
            postalCodes: ['57190']
        },
        แม่จัน: {
            subDistrict: [
                'แม่จัน',
                'จันจว้า',
                'แม่คำ',
                'ป่าซาง',
                'สันทราย',
                'ท่าข้าวเปลือก',
                'ป่าตึง',
                'แม่ไร่',
                'ศรีค้ำ',
                'จันจว้าใต้',
                'จอมสวรรค์'
            ],
            postalCodes: ['57110', '57270', '57240']
        },
        เชียงแสน: {
            subDistrict: [
                'เวียง',
                'ป่าสัก',
                'บ้านแซว',
                'ศรีดอนมูล',
                'แม่เงิน',
                'โยนก'
            ],
            postalCodes: ['57150']
        },
        แม่สาย: {
            subDistrict: [
                'แม่สาย',
                'ห้วยไคร้',
                'เกาะช้าง',
                'โป่งผา',
                'ศรีเมืองชุม',
                'เวียงพางคำ',
                'บ้านด้าย',
                'โป่งงาม'
            ],
            postalCodes: ['57130', '57220']
        },
        แม่สรวย: {
            subDistrict: [
                'แม่สรวย',
                'ป่าแดด',
                'แม่พริก',
                'ศรีถ้อย',
                'ท่าก๊อ',
                'วาวี',
                'เจดีย์หลวง'
            ],
            postalCodes: ['57180']
        },
        เวียงป่าเป้า: {
            subDistrict: [
                'สันสลี',
                'เวียง',
                'บ้านโป่ง',
                'ป่างิ้ว',
                'เวียงกาหลง',
                'แม่เจดีย์',
                'แม่เจดีย์ใหม่'
            ],
            postalCodes: ['57170', '57260']
        },
        พญาเม็งราย: {
            subDistrict: ['แม่เปา', 'แม่ต๋ำ', 'ไม้ยา', 'เม็งราย', 'ตาดควัน'],
            postalCodes: ['57290']
        },
        เวียงแก่น: {
            subDistrict: ['ม่วงยาย', 'ปอ', 'หล่ายงาว', 'ท่าข้าม'],
            postalCodes: ['57310']
        },
        ขุนตาล: {
            subDistrict: ['ต้า', 'ป่าตาล', 'ยางฮอม'],
            postalCodes: ['57340']
        },
        แม่ฟ้าหลวง: {
            subDistrict: ['เทอดไทย', 'แม่สลองใน', 'แม่สลองนอก', 'แม่ฟ้าหลวง'],
            postalCodes: ['57240', '57110']
        },
        แม่ลาว: {
            subDistrict: [
                'ดงมะดะ',
                'จอมหมอกแก้ว',
                'บัวสลี',
                'ป่าก่อดำ',
                'โป่งแพร่'
            ],
            postalCodes: ['57250', '57000']
        },
        เวียงเชียงรุ้ง: {
            subDistrict: ['ทุ่งก่อ', 'ดงมหาวัน', 'ป่าซาง'],
            postalCodes: ['57210']
        },
        ดอยหลวง: {
            subDistrict: ['ปงน้อย', 'โชคชัย', 'หนองป่าก่อ'],
            postalCodes: ['57110']
        }
    },
    แม่ฮ่องสอน: {
        เมืองแม่ฮ่องสอน: {
            subDistrict: [
                'จองคำ',
                'ห้วยโป่ง',
                'ผาบ่อง',
                'ปางหมู',
                'หมอกจำแป่',
                'ห้วยผา',
                'ห้วยปูลิง'
            ],
            postalCodes: ['58000']
        },
        ขุนยวม: {
            subDistrict: [
                'ขุนยวม',
                'แม่เงา',
                'เมืองปอน',
                'แม่ยวมน้อย',
                'แม่กิ๊',
                'แม่อูคอ'
            ],
            postalCodes: ['58140']
        },
        ปาย: {
            subDistrict: [
                'เวียงใต้',
                'เวียงเหนือ',
                'แม่นาเติง',
                'แม่ฮี้',
                'ทุ่งยาว',
                'เมืองแปง',
                'โป่งสา'
            ],
            postalCodes: ['58130']
        },
        แม่สะเรียง: {
            subDistrict: [
                'บ้านกาศ',
                'แม่สะเรียง',
                'แม่คง',
                'แม่เหาะ',
                'แม่ยวม',
                'เสาหิน',
                'ป่าแป๋'
            ],
            postalCodes: ['58110']
        },
        แม่ลาน้อย: {
            subDistrict: [
                'แม่ลาน้อย',
                'แม่ลาหลวง',
                'ท่าผาปุ้ม',
                'แม่โถ',
                'ห้วยห้อม',
                'แม่นาจาง',
                'สันติคีรี',
                'ขุนแม่ลาน้อย'
            ],
            postalCodes: ['58120']
        },
        สบเมย: {
            subDistrict: [
                'สบเมย',
                'แม่คะตวน',
                'กองก๋อย',
                'แม่สวด',
                'ป่าโปง',
                'แม่สามแลบ'
            ],
            postalCodes: ['58110']
        },
        ปางมะผ้า: {
            subDistrict: ['สบป่อง', 'ปางมะผ้า', 'ถ้ำลอด', 'นาปู่ป้อม'],
            postalCodes: ['58150']
        }
    },
    นครสวรรค์: {
        เมืองนครสวรรค์: {
            subDistrict: [
                'ปากน้ำโพ',
                'กลางแดด',
                'เกรียงไกร',
                'แควใหญ่',
                'ตะเคียนเลื่อน',
                'นครสวรรค์ตก',
                'นครสวรรค์ออก',
                'บางพระหลวง',
                'บางม่วง',
                'บ้านมะเกลือ',
                'บ้านแก่ง',
                'พระนอน',
                'วัดไทร',
                'หนองกรด',
                'หนองกระโดน',
                'หนองปลิง',
                'บึงเสนาท'
            ],
            postalCodes: ['60000', '60240']
        },
        โกรกพระ: {
            subDistrict: [
                'โกรกพระ',
                'ยางตาล',
                'บางมะฝ่อ',
                'บางประมุง',
                'นากลาง',
                'ศาลาแดง',
                'เนินกว้าว',
                'เนินศาลา',
                'หาดสูง'
            ],
            postalCodes: ['60170']
        },
        ชุมแสง: {
            subDistrict: [
                'ชุมแสง',
                'ทับกฤช',
                'พิกุล',
                'เกยไชย',
                'ท่าไม้',
                'บางเคียน',
                'หนองกระเจา',
                'พันลาน',
                'โคกหม้อ',
                'ไผ่สิงห์',
                'ฆะมัง',
                'ทับกฤชใต้'
            ],
            postalCodes: ['60120', '60250']
        },
        หนองบัว: {
            subDistrict: [
                'หนองบัว',
                'หนองกลับ',
                'ธารทหาร',
                'ห้วยร่วม',
                'ห้วยถั่วใต้',
                'ห้วยถั่วเหนือ',
                'ห้วยใหญ่',
                'ทุ่งทอง',
                'วังบ่อ'
            ],
            postalCodes: ['60110']
        },
        บรรพตพิสัย: {
            subDistrict: [
                'ท่างิ้ว',
                'บางตาหงาย',
                'หูกวาง',
                'อ่างทอง',
                'บ้านแดน',
                'บางแก้ว',
                'ตาขีด',
                'ตาสัง',
                'ด่านช้าง',
                'หนองกรด',
                'หนองตางู',
                'บึงปลาทู',
                'เจริญผล'
            ],
            postalCodes: ['60180']
        },
        เก้าเลี้ยว: {
            subDistrict: [
                'มหาโพธิ',
                'เก้าเลี้ยว',
                'หนองเต่า',
                'เขาดิน',
                'หัวดง'
            ],
            postalCodes: ['60230']
        },
        ตาคลี: {
            subDistrict: [
                'ตาคลี',
                'ช่องแค',
                'จันเสน',
                'ห้วยหอม',
                'หัวหวาย',
                'หนองโพ',
                'หนองหม้อ',
                'สร้อยทอง',
                'ลาดทิพรส',
                'พรหมนิมิต'
            ],
            postalCodes: ['60140', '60210', '60260']
        },
        ท่าตะโก: {
            subDistrict: [
                'ท่าตะโก',
                'พนมรอก',
                'หัวถนน',
                'สายลำโพง',
                'วังมหากร',
                'ดอนคา',
                'ทำนบ',
                'วังใหญ่',
                'พนมเศษ',
                'หนองหลวง'
            ],
            postalCodes: ['60160']
        },
        ไพศาลี: {
            subDistrict: [
                'โคกเดื่อ',
                'สำโรงชัย',
                'วังน้ำลัด',
                'ตะคร้อ',
                'โพธิ์ประสาท',
                'วังข่อย',
                'นาขอม',
                'ไพศาลี'
            ],
            postalCodes: ['60220']
        },
        พยุหะคีรี: {
            subDistrict: [
                'พยุหะ',
                'เนินมะกอก',
                'นิคมเขาบ่อแก้ว',
                'ม่วงหัก',
                'ยางขาว',
                'ย่านมัทรี',
                'เขาทอง',
                'ท่าน้ำอ้อย',
                'น้ำทรง',
                'เขากะลา',
                'สระทะเล'
            ],
            postalCodes: ['60130']
        },
        ลาดยาว: {
            subDistrict: [
                'ลาดยาว',
                'ห้วยน้ำหอม',
                'วังม้า',
                'วังเมือง',
                'สร้อยละคร',
                'มาบแก',
                'หนองยาว',
                'หนองนมวัว',
                'บ้านไร่',
                'เนินขี้เหล็ก',
                'ศาลเจ้าไก่ต่อ',
                'สระแก้ว'
            ],
            postalCodes: ['60150']
        },
        ตากฟ้า: {
            subDistrict: [
                'ตากฟ้า',
                'ลำพยนต์',
                'สุขสำราญ',
                'หนองพิกุล',
                'พุนกยูง',
                'อุดมธัญญา',
                'เขาชายธง'
            ],
            postalCodes: ['60190']
        },
        แม่วงก์: {
            subDistrict: ['แม่วงก์', 'แม่เล่ย์', 'วังซ่าน', 'เขาชนกัน'],
            postalCodes: ['60150']
        },
        แม่เปิน: {
            subDistrict: ['แม่เปิน'],
            postalCodes: ['60150']
        },
        ชุมตาบง: {
            subDistrict: ['ชุมตาบง', 'ปางสวรรค์'],
            postalCodes: ['60150']
        }
    },
    อุทัยธานี: {
        เมืองอุทัยธานี: {
            subDistrict: [
                'อุทัยใหม่',
                'น้ำซึม',
                'สะแกกรัง',
                'ดอนขวาง',
                'หาดทนง',
                'เกาะเทโพ',
                'ท่าซุง',
                'หนองแก',
                'โนนเหล็ก',
                'หนองเต่า',
                'หนองไผ่แบน',
                'หนองพังค่า',
                'ทุ่งใหญ่',
                'เนินแจง'
            ],
            postalCodes: ['61000']
        },
        ทัพทัน: {
            subDistrict: [
                'ทัพทัน',
                'ทุ่งนาไทย',
                'เขาขี้ฝอย',
                'หนองหญ้าปล้อง',
                'โคกหม้อ',
                'หนองยายดา',
                'หนองกลางดง',
                'หนองกระทุ่ม',
                'หนองสระ',
                'ตลุกดู่'
            ],
            postalCodes: ['61120']
        },
        สว่างอารมณ์: {
            subDistrict: [
                'สว่างอารมณ์',
                'หนองหลวง',
                'พลวงสองนาง',
                'ไผ่เขียว',
                'บ่อยาง'
            ],
            postalCodes: ['61150']
        },
        หนองฉาง: {
            subDistrict: [
                'หนองฉาง',
                'หนองยาง',
                'หนองนางนวล',
                'หนองสรวง',
                'บ้านเก่า',
                'อุทัยเก่า',
                'ทุ่งโพ',
                'ทุ่งพง',
                'เขาบางแกรก',
                'เขากวางทอง'
            ],
            postalCodes: ['61110', '61170']
        },
        หนองขาหย่าง: {
            subDistrict: [
                'หนองขาหย่าง',
                'หนองไผ่',
                'ดอนกลอย',
                'ห้วยรอบ',
                'ทุ่งพึ่ง',
                'ท่าโพ',
                'หมกแถว',
                'หลุมเข้า',
                'ดงขวาง'
            ],
            postalCodes: ['61130']
        },
        บ้านไร่: {
            subDistrict: [
                'บ้านไร่',
                'ทัพหลวง',
                'ห้วยแห้ง',
                'คอกควาย',
                'วังหิน',
                'เมืองการุ้ง',
                'แก่นมะกรูด',
                'หนองจอก',
                'หูช้าง',
                'บ้านบึง',
                'บ้านใหม่คลองเคียน',
                'หนองบ่มกล้วย',
                'เจ้าวัด'
            ],
            postalCodes: ['61140', '61180']
        },
        ลานสัก: {
            subDistrict: [
                'ลานสัก',
                'ประดู่ยืน',
                'ป่าอ้อ',
                'ระบำ',
                'น้ำรอบ',
                'ทุ่งนางาม'
            ],
            postalCodes: ['61160']
        },
        ห้วยคต: {
            subDistrict: ['สุขฤทัย', 'ทองหลาง', 'ห้วยคต'],
            postalCodes: ['61170']
        }
    },
    กำแพงเพชร: {
        เมืองกำแพงเพชร: {
            subDistrict: [
                'ในเมือง',
                'ไตรตรึงษ์',
                'อ่างทอง',
                'นาบ่อคำ',
                'นครชุม',
                'ทรงธรรม',
                'ลานดอกไม้',
                'หนองปลิง',
                'คณฑี',
                'นิคมทุ่งโพธิ์ทะเล',
                'เทพนคร',
                'วังทอง',
                'ท่าขุนราม',
                'คลองแม่ลาย',
                'ธำมรงค์',
                'สระแก้ว'
            ],
            postalCodes: ['62000', '62160']
        },
        ไทรงาม: {
            subDistrict: [
                'ไทรงาม',
                'หนองคล้า',
                'หนองทอง',
                'หนองไม้กอง',
                'มหาชัย',
                'พานทอง',
                'หนองแม่แตง'
            ],
            postalCodes: ['62150']
        },
        คลองลาน: {
            subDistrict: [
                'คลองน้ำไหล',
                'โป่งน้ำร้อน',
                'คลองลานพัฒนา',
                'สักงาม'
            ],
            postalCodes: ['62180']
        },
        ขาณุวรลักษบุรี: {
            subDistrict: [
                'ยางสูง',
                'ป่าพุทรา',
                'แสนตอ',
                'สลกบาตร',
                'บ่อถ้ำ',
                'ดอนแตง',
                'วังชะพลู',
                'โค้งไผ่',
                'ปางมะค่า',
                'วังหามแห',
                'เกาะตาล'
            ],
            postalCodes: ['62130', '62140']
        },
        คลองขลุง: {
            subDistrict: [
                'คลองขลุง',
                'ท่ามะเขือ',
                'ท่าพุทรา',
                'แม่ลาด',
                'วังยาง',
                'วังแขม',
                'หัวถนน',
                'วังไทร',
                'วังบัว',
                'คลองสมบูรณ์'
            ],
            postalCodes: ['62120']
        },
        พรานกระต่าย: {
            subDistrict: [
                'พรานกระต่าย',
                'หนองหัววัว',
                'ท่าไม้',
                'วังควง',
                'วังตะแบก',
                'เขาคีริส',
                'คุยบ้านโอง',
                'คลองพิไกร',
                'ถ้ำกระต่ายทอง',
                'ห้วยยั้ง'
            ],
            postalCodes: ['62110']
        },
        ลานกระบือ: {
            subDistrict: [
                'ลานกระบือ',
                'ช่องลม',
                'หนองหลวง',
                'โนนพลวง',
                'ประชาสุขสันต์',
                'บึงทับแรต',
                'จันทิมา'
            ],
            postalCodes: ['62170']
        },
        ทรายทองวัฒนา: {
            subDistrict: ['ทุ่งทราย', 'ทุ่งทอง', 'ถาวรวัฒนา'],
            postalCodes: ['62190']
        },
        ปางศิลาทอง: {
            subDistrict: ['โพธิ์ทอง', 'หินดาต', 'ปางตาไว'],
            postalCodes: ['62120']
        },
        บึงสามัคคี: {
            subDistrict: ['บึงสามัคคี', 'วังชะโอน', 'ระหาน', 'เทพนิมิต'],
            postalCodes: ['62210']
        },
        โกสัมพีนคร: {
            subDistrict: ['โกสัมพี', 'เพชรชมภู', 'ลานดอกไม้ตก'],
            postalCodes: ['62000']
        }
    },
    ตาก: {
        เมืองตาก: {
            subDistrict: [
                'ระแหง',
                'หนองหลวง',
                'เชียงเงิน',
                'หัวเดียด',
                'หนองบัวเหนือ',
                'ไม้งาม',
                'โป่งแดง',
                'น้ำรึม',
                'วังหิน',
                'แม่ท้อ',
                'ป่ามะม่วง',
                'หนองบัวใต้',
                'วังประจบ',
                'ตลุกกลางทุ่ง'
            ],
            postalCodes: ['63000']
        },
        บ้านตาก: {
            subDistrict: [
                'ตากออก',
                'สมอโคน',
                'แม่สลิด',
                'ตากตก',
                'เกาะตะเภา',
                'ทุ่งกระเชาะ',
                'ท้องฟ้า'
            ],
            postalCodes: ['63120']
        },
        สามเงา: {
            subDistrict: [
                'สามเงา',
                'วังหมัน',
                'ยกกระบัตร',
                'ย่านรี',
                'บ้านนา',
                'วังจันทร์'
            ],
            postalCodes: ['63130']
        },
        แม่ระมาด: {
            subDistrict: [
                'แม่ระมาด',
                'แม่จะเรา',
                'ขะเนจื้อ',
                'แม่ตื่น',
                'สามหมื่น',
                'พระธาตุ'
            ],
            postalCodes: ['63140']
        },
        ท่าสองยาง: {
            subDistrict: [
                'ท่าสองยาง',
                'แม่ต้าน',
                'แม่สอง',
                'แม่หละ',
                'แม่วะหลวง',
                'แม่อุสุ'
            ],
            postalCodes: ['63150']
        },
        แม่สอด: {
            subDistrict: [
                'แม่สอด',
                'แม่กุ',
                'พะวอ',
                'แม่ตาว',
                'แม่กาษา',
                'ท่าสายลวด',
                'แม่ปะ',
                'มหาวัน',
                'ด่านแม่ละเมา',
                'พระธาตุผาแดง'
            ],
            postalCodes: ['63110']
        },
        พบพระ: {
            subDistrict: [
                'พบพระ',
                'ช่องแคบ',
                'คีรีราษฎร์',
                'วาเล่ย์',
                'รวมไทยพัฒนา'
            ],
            postalCodes: ['63160']
        },
        อุ้มผาง: {
            subDistrict: [
                'อุ้มผาง',
                'หนองหลวง',
                'โมโกร',
                'แม่จัน',
                'แม่ละมุ้ง',
                'แม่กลอง'
            ],
            postalCodes: ['63170']
        },
        วังเจ้า: {
            subDistrict: ['เชียงทอง', 'นาโบสถ์', 'ประดาง'],
            postalCodes: ['63180']
        }
    },
    สุโขทัย: {
        เมืองสุโขทัย: {
            subDistrict: [
                'ธานี',
                'บ้านสวน',
                'เมืองเก่า',
                'ปากแคว',
                'ยางซ้าย',
                'บ้านกล้วย',
                'บ้านหลุม',
                'ตาลเตี้ย',
                'ปากพระ',
                'วังทองแดง'
            ],
            postalCodes: ['64000', '64220', '64210']
        },
        บ้านด่านลานหอย: {
            subDistrict: [
                'ลานหอย',
                'บ้านด่าน',
                'วังตะคร้อ',
                'วังน้ำขาว',
                'ตลิ่งชัน',
                'หนองหญ้าปล้อง',
                'วังลึก'
            ],
            postalCodes: ['64140']
        },
        คีรีมาศ: {
            subDistrict: [
                'โตนด',
                'ทุ่งหลวง',
                'บ้านป้อม',
                'สามพวง',
                'ศรีคีรีมาศ',
                'หนองจิก',
                'นาเชิงคีรี',
                'หนองกระดิ่ง',
                'บ้านน้ำพุ',
                'ทุ่งยางเมือง'
            ],
            postalCodes: ['64160']
        },
        กงไกรลาศ: {
            subDistrict: [
                'กง',
                'บ้านกร่าง',
                'ไกรนอก',
                'ไกรกลาง',
                'ไกรใน',
                'ดงเดือย',
                'ป่าแฝก',
                'กกแรต',
                'ท่าฉนวน',
                'หนองตูม',
                'บ้านใหม่สุขเกษม'
            ],
            postalCodes: ['64170']
        },
        ศรีสัชนาลัย: {
            subDistrict: [
                'หาดเสี้ยว',
                'ป่างิ้ว',
                'แม่สำ',
                'แม่สิน',
                'บ้านตึก',
                'หนองอ้อ',
                'ท่าชัย',
                'ศรีสัชนาลัย',
                'ดงคู่',
                'บ้านแก่ง',
                'สารจิตร'
            ],
            postalCodes: ['64130', '64190']
        },
        ศรีสำโรง: {
            subDistrict: [
                'คลองตาล',
                'วังลึก',
                'สามเรือน',
                'บ้านนา',
                'วังทอง',
                'นาขุนไกร',
                'เกาะตาเลี้ยง',
                'วัดเกาะ',
                'บ้านไร่',
                'ทับผึ้ง',
                'บ้านซ่าน',
                'วังใหญ่',
                'ราวต้นจันทร์'
            ],
            postalCodes: ['64120']
        },
        สวรรคโลก: {
            subDistrict: [
                'เมืองสวรรคโลก',
                'ในเมือง',
                'คลองกระจง',
                'วังพิณพาทย์',
                'วังไม้ขอน',
                'ย่านยาว',
                'นาทุ่ง',
                'คลองยาง',
                'เมืองบางยม',
                'ท่าทอง',
                'ปากน้ำ',
                'ป่ากุมเกาะ',
                'เมืองบางขลัง',
                'หนองกลับ'
            ],
            postalCodes: ['64110']
        },
        ศรีนคร: {
            subDistrict: [
                'ศรีนคร',
                'นครเดิฐ',
                'น้ำขุม',
                'คลองมะพลับ',
                'หนองบัว'
            ],
            postalCodes: ['64180']
        },
        ทุ่งเสลี่ยม: {
            subDistrict: [
                'บ้านใหม่ไชยมงคล',
                'ไทยชนะศึก',
                'ทุ่งเสลี่ยม',
                'กลางดง',
                'เขาแก้วศรีสมบูรณ์'
            ],
            postalCodes: ['64230', '64150']
        }
    },
    พิษณุโลก: {
        เมืองพิษณุโลก: {
            subDistrict: [
                'ในเมือง',
                'วังน้ำคู้',
                'วัดจันทร์',
                'วัดพริก',
                'ท่าทอง',
                'ท่าโพธิ์',
                'สมอแข',
                'ดอนทอง',
                'บ้านป่า',
                'ปากโทก',
                'หัวรอ',
                'จอมทอง',
                'บ้านกร่าง',
                'บ้านคลอง',
                'พลายชุมพล',
                'มะขามสูง',
                'อรัญญิก',
                'บึงพระ',
                'ไผ่ขอดอน',
                'งิ้วงาม'
            ],
            postalCodes: ['65000', '65230']
        },
        นครไทย: {
            subDistrict: [
                'นครไทย',
                'หนองกะท้าว',
                'บ้านแยง',
                'เนินเพิ่ม',
                'นาบัว',
                'นครชุม',
                'น้ำกุ่ม',
                'ยางโกลน',
                'บ่อโพธิ์',
                'บ้านพร้าว',
                'ห้วยเฮี้ย'
            ],
            postalCodes: ['65120']
        },
        ชาติตระการ: {
            subDistrict: [
                'ป่าแดง',
                'ชาติตระการ',
                'สวนเมี่ยง',
                'บ้านดง',
                'บ่อภาค',
                'ท่าสะแก'
            ],
            postalCodes: ['65170']
        },
        บางระกำ: {
            subDistrict: [
                'บางระกำ',
                'ปลักแรด',
                'พันเสา',
                'วังอิทก',
                'บึงกอก',
                'หนองกุลา',
                'ชุมแสงสงคราม',
                'นิคมพัฒนา',
                'บ่อทอง',
                'ท่านางงาม',
                'คุยม่วง'
            ],
            postalCodes: ['65140', '65240']
        },
        บางกระทุ่ม: {
            subDistrict: [
                'บางกระทุ่ม',
                'บ้านไร่',
                'โคกสลุด',
                'สนามคลี',
                'ท่าตาล',
                'ไผ่ล้อม',
                'นครป่าหมาก',
                'เนินกุ่ม',
                'วัดตายม'
            ],
            postalCodes: ['65110', '65210']
        },
        พรหมพิราม: {
            subDistrict: [
                'พรหมพิราม',
                'ท่าช้าง',
                'วงฆ้อง',
                'มะตูม',
                'หอกลอง',
                'ศรีภิรมย์',
                'ตลุกเทียม',
                'วังวน',
                'หนองแขม',
                'มะต้อง',
                'ทับยายเชียง',
                'ดงประคำ'
            ],
            postalCodes: ['65150', '65180']
        },
        วัดโบสถ์: {
            subDistrict: [
                'วัดโบสถ์',
                'ท่างาม',
                'ท้อแท้',
                'บ้านยาง',
                'หินลาด',
                'คันโช้ง'
            ],
            postalCodes: ['65160']
        },
        วังทอง: {
            subDistrict: [
                'วังทอง',
                'พันชาลี',
                'แม่ระกา',
                'บ้านกลาง',
                'วังพิกุล',
                'แก่งโสภา',
                'ท่าหมื่นราม',
                'วังนกแอ่น',
                'หนองพระ',
                'ชัยนาม',
                'ดินทอง'
            ],
            postalCodes: ['65130', '65220']
        },
        เนินมะปราง: {
            subDistrict: [
                'ชมพู',
                'บ้านมุง',
                'ไทรย้อย',
                'วังโพรง',
                'บ้านน้อยซุ้มขี้เหล็ก',
                'เนินมะปราง',
                'วังยาง'
            ],
            postalCodes: ['65190']
        }
    },
    พิจิตร: {
        เมืองพิจิตร: {
            subDistrict: [
                'ในเมือง',
                'ไผ่ขวาง',
                'ย่านยาว',
                'ท่าฬ่อ',
                'ปากทาง',
                'คลองคะเชนทร์',
                'โรงช้าง',
                'เมืองเก่า',
                'ท่าหลวง',
                'บ้านบุ่ง',
                'ฆะมัง',
                'ดงป่าคำ',
                'หัวดง',
                'ป่ามะคาบ',
                'สายคำโห้',
                'ดงกลาง'
            ],
            postalCodes: ['66000', '66170']
        },
        วังทรายพูน: {
            subDistrict: ['วังทรายพูน', 'หนองปลาไหล', 'หนองพระ', 'หนองปล้อง'],
            postalCodes: ['66180']
        },
        โพธิ์ประทับช้าง: {
            subDistrict: [
                'โพธิ์ประทับช้าง',
                'ไผ่ท่าโพ',
                'วังจิก',
                'ไผ่รอบ',
                'ดงเสือเหลือง',
                'เนินสว่าง',
                'ทุ่งใหญ่'
            ],
            postalCodes: ['66190']
        },
        ตะพานหิน: {
            subDistrict: [
                'ตะพานหิน',
                'งิ้วราย',
                'ห้วยเกตุ',
                'ไทรโรงโขน',
                'หนองพยอม',
                'ทุ่งโพธิ์',
                'ดงตะขบ',
                'คลองคูณ',
                'วังสำโรง',
                'วังหว้า',
                'วังหลุม',
                'ทับหมัน',
                'ไผ่หลวง'
            ],
            postalCodes: ['66110', '66150']
        },
        บางมูลนาก: {
            subDistrict: [
                'บางมูลนาก',
                'บางไผ่',
                'หอไกร',
                'เนินมะกอก',
                'วังสำโรง',
                'ภูมิ',
                'วังกรด',
                'ห้วยเขน',
                'วังตะกู',
                'ลำประดา'
            ],
            postalCodes: ['66120', '66210']
        },
        โพทะเล: {
            subDistrict: [
                'โพทะเล',
                'ท้ายน้ำ',
                'ทะนง',
                'ท่าบัว',
                'ทุ่งน้อย',
                'ท่าขมิ้น',
                'ท่าเสา',
                'บางคลาน',
                'ท่านั่ง',
                'บ้านน้อย',
                'วัดขวาง'
            ],
            postalCodes: ['66130']
        },
        สามง่าม: {
            subDistrict: ['สามง่าม', 'กำแพงดิน', 'รังนก', 'เนินปอ', 'หนองโสน'],
            postalCodes: ['66140', '66220']
        },
        ทับคล้อ: {
            subDistrict: ['ทับคล้อ', 'เขาทราย', 'เขาเจ็ดลูก', 'ท้ายทุ่ง'],
            postalCodes: ['66150', '66230']
        },
        สากเหล็ก: {
            subDistrict: [
                'สากเหล็ก',
                'ท่าเยี่ยม',
                'คลองทราย',
                'หนองหญ้าไทร',
                'วังทับไทร'
            ],
            postalCodes: ['66160']
        },
        บึงนาราง: {
            subDistrict: [
                'ห้วยแก้ว',
                'โพธิ์ไทรงาม',
                'แหลมรัง',
                'บางลาย',
                'บึงนาราง'
            ],
            postalCodes: ['66130']
        },
        ดงเจริญ: {
            subDistrict: [
                'วังงิ้วใต้',
                'วังงิ้ว',
                'ห้วยร่วม',
                'ห้วยพุก',
                'สำนักขุนเณร'
            ],
            postalCodes: ['66210']
        },
        วชิรบารมี: {
            subDistrict: ['บ้านนา', 'บึงบัว', 'วังโมกข์', 'หนองหลุม'],
            postalCodes: ['66140', '66220']
        }
    },
    เพชรบูรณ์: {
        เมืองเพชรบูรณ์: {
            subDistrict: [
                'ในเมือง',
                'ตะเบาะ',
                'บ้านโตก',
                'สะเดียง',
                'ป่าเลา',
                'นางั่ว',
                'ท่าพล',
                'ดงมูลเหล็ก',
                'บ้านโคก',
                'ชอนไพร',
                'นาป่า',
                'นายม',
                'วังชมภู',
                'น้ำร้อน',
                'ห้วยสะแก',
                'ห้วยใหญ่',
                'ระวิง'
            ],
            postalCodes: ['67000', '67250', '67210']
        },
        ชนแดน: {
            subDistrict: [
                'ชนแดน',
                'ดงขุย',
                'ท่าข้าม',
                'พุทธบาท',
                'ลาดแค',
                'บ้านกล้วย',
                'ซับพุทรา',
                'ตะกุดไร',
                'ศาลาลาย'
            ],
            postalCodes: ['67150', '67190']
        },
        หล่มสัก: {
            subDistrict: [
                'หล่มสัก',
                'วัดป่า',
                'ตาลเดี่ยว',
                'ฝายนาแซง',
                'หนองสว่าง',
                'น้ำเฮี้ย',
                'สักหลง',
                'ท่าอิบุญ',
                'บ้านโสก',
                'บ้านติ้ว',
                'ห้วยไร่',
                'น้ำก้อ',
                'ปากช่อง',
                'น้ำชุน',
                'หนองไขว่',
                'ลานบ่า',
                'บุ่งคล้า',
                'บุ่งน้ำเต้า',
                'บ้านกลาง',
                'ช้างตะลูด',
                'บ้านไร่',
                'ปากดุก',
                'บ้านหวาย'
            ],
            postalCodes: ['67110']
        },
        หล่มเก่า: {
            subDistrict: [
                'หล่มเก่า',
                'นาซำ',
                'หินฮาว',
                'บ้านเนิน',
                'ศิลา',
                'นาแซง',
                'วังบาล',
                'นาเกาะ',
                'ตาดกลอย'
            ],
            postalCodes: ['67120']
        },
        วิเชียรบุรี: {
            subDistrict: [
                'ท่าโรง',
                'สระประดู่',
                'สามแยก',
                'โคกปรง',
                'น้ำร้อน',
                'บ่อรัง',
                'พุเตย',
                'พุขาม',
                'ภูน้ำหยด',
                'ซับสมบูรณ์',
                'บึงกระจับ',
                'วังใหญ่',
                'ยางสาว',
                'ซับน้อย'
            ],
            postalCodes: ['67130', '67180']
        },
        ศรีเทพ: {
            subDistrict: [
                'ศรีเทพ',
                'สระกรวด',
                'คลองกระจัง',
                'นาสนุ่น',
                'โคกสะอาด',
                'หนองย่างทอย',
                'ประดู่งาม'
            ],
            postalCodes: ['67170']
        },
        หนองไผ่: {
            subDistrict: [
                'กองทูล',
                'นาเฉลียง',
                'บ้านโภชน์',
                'ท่าแดง',
                'เพชรละคร',
                'บ่อไทย',
                'ห้วยโป่ง',
                'วังท่าดี',
                'บัววัฒนา',
                'หนองไผ่',
                'วังโบสถ์',
                'ยางงาม',
                'ท่าด้วง'
            ],
            postalCodes: ['67140', '67220']
        },
        บึงสามพัน: {
            subDistrict: [
                'ซับสมอทอด',
                'ซับไม้แดง',
                'หนองแจง',
                'กันจุ',
                'วังพิกุล',
                'พญาวัง',
                'ศรีมงคล',
                'สระแก้ว',
                'บึงสามพัน'
            ],
            postalCodes: ['67160', '67230']
        },
        น้ำหนาว: {
            subDistrict: ['น้ำหนาว', 'หลักด่าน', 'วังกวาง', 'โคกมน'],
            postalCodes: ['67260']
        },
        วังโป่ง: {
            subDistrict: ['วังโป่ง', 'ท้ายดง', 'ซับเปิบ', 'วังหิน', 'วังศาล'],
            postalCodes: ['67240']
        },
        เขาค้อ: {
            subDistrict: [
                'ทุ่งสมอ',
                'แคมป์สน',
                'เขาค้อ',
                'ริมสีม่วง',
                'สะเดาะพง',
                'หนองแม่นา',
                'เข็กน้อย'
            ],
            postalCodes: ['67270', '67280']
        }
    },
    ราชบุรี: {
        เมืองราชบุรี: {
            subDistrict: [
                'หน้าเมือง',
                'เจดีย์หัก',
                'ดอนตะโก',
                'หนองกลางนา',
                'ห้วยไผ่',
                'คุ้งน้ำวน',
                'คุ้งกระถิน',
                'อ่างทอง',
                'โคกหม้อ',
                'สามเรือน',
                'พิกุลทอง',
                'น้ำพุ',
                'ดอนแร่',
                'หินกอง',
                'เขาแร้ง',
                'เกาะพลับพลา',
                'หลุมดิน',
                'บางป่า',
                'พงสวาย',
                'คูบัว',
                'ท่าราบ',
                'บ้านไร่'
            ],
            postalCodes: ['70000']
        },
        จอมบึง: {
            subDistrict: [
                'จอมบึง',
                'ปากช่อง',
                'เบิกไพร',
                'ด่านทับตะโก',
                'แก้มอ้น',
                'รางบัว'
            ],
            postalCodes: ['70150']
        },
        สวนผึ้ง: {
            subDistrict: ['สวนผึ้ง', 'ป่าหวาย', 'ท่าเคย', 'ตะนาวศรี'],
            postalCodes: ['70180']
        },
        ดำเนินสะดวก: {
            subDistrict: [
                'ดำเนินสะดวก',
                'ประสาทสิทธิ์',
                'ศรีสุราษฎร์',
                'ตาหลวง',
                'ดอนกรวย',
                'ดอนคลัง',
                'บัวงาม',
                'บ้านไร่',
                'แพงพวย',
                'สี่หมื่น',
                'ท่านัด',
                'ขุนพิทักษ์',
                'ดอนไผ่'
            ],
            postalCodes: ['70130', '70210']
        },
        บ้านโป่ง: {
            subDistrict: [
                'บ้านโป่ง',
                'ท่าผา',
                'กรับใหญ่',
                'ปากแรต',
                'หนองกบ',
                'หนองอ้อ',
                'ดอนกระเบื้อง',
                'สวนกล้วย',
                'นครชุมน์',
                'บ้านม่วง',
                'คุ้งพยอม',
                'หนองปลาหมอ',
                'เขาขลุง',
                'เบิกไพร',
                'ลาดบัวขาว'
            ],
            postalCodes: ['70110', '70190']
        },
        บางแพ: {
            subDistrict: [
                'บางแพ',
                'วังเย็น',
                'หัวโพ',
                'วัดแก้ว',
                'ดอนใหญ่',
                'ดอนคา',
                'โพหัก'
            ],
            postalCodes: ['70160']
        },
        โพธาราม: {
            subDistrict: [
                'โพธาราม',
                'ดอนกระเบื้อง',
                'หนองโพ',
                'บ้านเลือก',
                'คลองตาคต',
                'บ้านฆ้อง',
                'บ้านสิงห์',
                'ดอนทราย',
                'เจ็ดเสมียน',
                'คลองข่อย',
                'ชำแระ',
                'สร้อยฟ้า',
                'ท่าชุมพล',
                'บางโตนด',
                'เตาปูน',
                'นางแก้ว',
                'ธรรมเสน',
                'เขาชะงุ้ม',
                'หนองกวาง'
            ],
            postalCodes: ['70120']
        },
        ปากท่อ: {
            subDistrict: [
                'ทุ่งหลวง',
                'วังมะนาว',
                'ดอนทราย',
                'หนองกระทุ่ม',
                'ปากท่อ',
                'ป่าไก่',
                'วัดยางงาม',
                'อ่างหิน',
                'บ่อกระดาน',
                'ยางหัก',
                'วันดาว',
                'ห้วยยางโทน'
            ],
            postalCodes: ['70140']
        },
        วัดเพลง: {
            subDistrict: ['เกาะศาลพระ', 'จอมประทัด', 'วัดเพลง'],
            postalCodes: ['70170']
        },
        บ้านคา: {
            subDistrict: ['บ้านคา', 'บ้านบึง', 'หนองพันจันทร์'],
            postalCodes: ['70180']
        }
    },
    กาญจนบุรี: {
        เมืองกาญจนบุรี: {
            subDistrict: [
                'บ้านเหนือ',
                'บ้านใต้',
                'ปากแพรก',
                'ท่ามะขาม',
                'แก่งเสี้ยน',
                'หนองบัว',
                'ลาดหญ้า',
                'วังด้ง',
                'ช่องสะเดา',
                'หนองหญ้า',
                'เกาะสำโรง',
                'บ้านเก่า',
                'วังเย็น'
            ],
            postalCodes: ['71000', '71190']
        },
        ไทรโยค: {
            subDistrict: [
                'ลุ่มสุ่ม',
                'ท่าเสา',
                'สิงห์',
                'ไทรโยค',
                'วังกระแจะ',
                'ศรีมงคล',
                'บ้องตี้'
            ],
            postalCodes: ['71150']
        },
        บ่อพลอย: {
            subDistrict: [
                'บ่อพลอย',
                'หนองกุ่ม',
                'หนองรี',
                'หลุมรัง',
                'ช่องด่าน',
                'หนองกร่าง'
            ],
            postalCodes: ['71160', '71220']
        },
        ศรีสวัสดิ์: {
            subDistrict: [
                'นาสวน',
                'ด่านแม่แฉลบ',
                'หนองเป็ด',
                'ท่ากระดาน',
                'เขาโจด',
                'แม่กระบุง'
            ],
            postalCodes: ['71250', '71220']
        },
        ท่ามะกา: {
            subDistrict: [
                'พงตึก',
                'ยางม่วง',
                'ดอนชะเอม',
                'ท่าไม้',
                'ตะคร้ำเอน',
                'ท่ามะกา',
                'ท่าเรือ',
                'โคกตะบอง',
                'ดอนขมิ้น',
                'อุโลกสี่หมื่น',
                'เขาสามสิบหาบ',
                'พระแท่น',
                'หวายเหนียว',
                'แสนตอ',
                'สนามแย้',
                'ท่าเสา',
                'หนองลาน'
            ],
            postalCodes: ['71120', '71130', '70190']
        },
        ท่าม่วง: {
            subDistrict: [
                'ท่าม่วง',
                'วังขนาย',
                'วังศาลา',
                'ท่าล้อ',
                'หนองขาว',
                'ทุ่งทอง',
                'เขาน้อย',
                'ม่วงชุม',
                'บ้านใหม่',
                'พังตรุ',
                'ท่าตะคร้อ',
                'รางสาลี่',
                'หนองตากยา'
            ],
            postalCodes: ['71110', '71000', '71130']
        },
        ทองผาภูมิ: {
            subDistrict: [
                'ท่าขนุน',
                'ปิล๊อก',
                'หินดาด',
                'ลิ่นถิ่น',
                'ชะแล',
                'ห้วยเขย่ง',
                'สหกรณ์นิคม'
            ],
            postalCodes: ['71180']
        },
        สังขละบุรี: {
            subDistrict: ['หนองลู', 'ปรังเผล', 'ไล่โว่'],
            postalCodes: ['71240']
        },
        พนมทวน: {
            subDistrict: [
                'พนมทวน',
                'หนองโรง',
                'ทุ่งสมอ',
                'ดอนเจดีย์',
                'พังตรุ',
                'รางหวาย',
                'หนองสาหร่าย',
                'ดอนตาเพชร'
            ],
            postalCodes: ['71140', '71170']
        },
        เลาขวัญ: {
            subDistrict: [
                'เลาขวัญ',
                'หนองโสน',
                'หนองประดู่',
                'หนองปลิง',
                'หนองนกแก้ว',
                'ทุ่งกระบ่ำ',
                'หนองฝ้าย'
            ],
            postalCodes: ['71210']
        },
        ด่านมะขามเตี้ย: {
            subDistrict: ['ด่านมะขามเตี้ย', 'กลอนโด', 'จรเข้เผือก', 'หนองไผ่'],
            postalCodes: ['71260']
        },
        หนองปรือ: {
            subDistrict: ['หนองปรือ', 'หนองปลาไหล', 'สมเด็จเจริญ'],
            postalCodes: ['71220']
        },
        ห้วยกระเจา: {
            subDistrict: ['ห้วยกระเจา', 'วังไผ่', 'ดอนแสลบ', 'สระลงเรือ'],
            postalCodes: ['71170']
        }
    },
    สุพรรณบุรี: {
        เมืองสุพรรณบุรี: {
            subDistrict: [
                'ท่าพี่เลี้ยง',
                'รั้วใหญ่',
                'ทับตีเหล็ก',
                'ท่าระหัด',
                'ไผ่ขวาง',
                'โคกโคเฒ่า',
                'ดอนตาล',
                'ดอนมะสังข์',
                'พิหารแดง',
                'ดอนกำยาน',
                'ดอนโพธิ์ทอง',
                'บ้านโพธิ์',
                'สระแก้ว',
                'ตลิ่งชัน',
                'บางกุ้ง',
                'ศาลาขาว',
                'สวนแตง',
                'สนามชัย',
                'โพธิ์พระยา',
                'สนามคลี'
            ],
            postalCodes: ['72000', '72230', '72210']
        },
        เดิมบางนางบวช: {
            subDistrict: [
                'เขาพระ',
                'เดิมบาง',
                'นางบวช',
                'เขาดิน',
                'ปากน้ำ',
                'ทุ่งคลี',
                'โคกช้าง',
                'หัวเขา',
                'หัวนา',
                'บ่อกรุ',
                'วังศรีราช',
                'ป่าสะแก',
                'ยางนอน',
                'หนองกระทุ่ม'
            ],
            postalCodes: ['72120']
        },
        ด่านช้าง: {
            subDistrict: [
                'หนองมะค่าโมง',
                'ด่านช้าง',
                'ห้วยขมิ้น',
                'องค์พระ',
                'วังคัน',
                'นิคมกระเสียว',
                'วังยาว'
            ],
            postalCodes: ['72180']
        },
        บางปลาม้า: {
            subDistrict: [
                'โคกคราม',
                'บางปลาม้า',
                'ตะค่า',
                'บางใหญ่',
                'กฤษณา',
                'สาลี',
                'ไผ่กองดิน',
                'องครักษ์',
                'จรเข้ใหญ่',
                'บ้านแหลม',
                'มะขามล้ม',
                'วังน้ำเย็น',
                'วัดโบสถ์',
                'วัดดาว'
            ],
            postalCodes: ['72150']
        },
        ศรีประจันต์: {
            subDistrict: [
                'ศรีประจันต์',
                'บ้านกร่าง',
                'มดแดง',
                'บางงาม',
                'ดอนปรู',
                'ปลายนา',
                'วังหว้า',
                'วังน้ำซับ',
                'วังยาง'
            ],
            postalCodes: ['72140']
        },
        ดอนเจดีย์: {
            subDistrict: [
                'ดอนเจดีย์',
                'หนองสาหร่าย',
                'ไร่รถ',
                'สระกระโจม',
                'ทะเลบก'
            ],
            postalCodes: ['72170', '72250']
        },
        สองพี่น้อง: {
            subDistrict: [
                'สองพี่น้อง',
                'บางเลน',
                'บางตาเถร',
                'บางตะเคียน',
                'บ้านกุ่ม',
                'หัวโพธิ์',
                'บางพลับ',
                'เนินพระปรางค์',
                'บ้านช้าง',
                'ต้นตาล',
                'ศรีสำราญ',
                'ทุ่งคอก',
                'หนองบ่อ',
                'บ่อสุพรรณ',
                'ดอนมะนาว'
            ],
            postalCodes: ['72110', '72190']
        },
        สามชุก: {
            subDistrict: [
                'ย่านยาว',
                'วังลึก',
                'สามชุก',
                'หนองผักนาก',
                'บ้านสระ',
                'หนองสะเดา',
                'กระเสียว'
            ],
            postalCodes: ['72130']
        },
        อู่ทอง: {
            subDistrict: [
                'อู่ทอง',
                'สระยายโสม',
                'จรเข้สามพัน',
                'บ้านดอน',
                'ยุ้งทะลาย',
                'ดอนมะเกลือ',
                'หนองโอ่ง',
                'ดอนคา',
                'พลับพลาไชย',
                'บ้านโข้ง',
                'เจดีย์',
                'สระพังลาน',
                'กระจัน'
            ],
            postalCodes: ['72160', '72220', '71170']
        },
        หนองหญ้าไซ: {
            subDistrict: [
                'หนองหญ้าไซ',
                'หนองราชวัตร',
                'หนองโพธิ์',
                'แจงงาม',
                'หนองขาม',
                'ทัพหลวง'
            ],
            postalCodes: ['72240']
        }
    },
    นครปฐม: {
        เมืองนครปฐม: {
            subDistrict: [
                'พระปฐมเจดีย์',
                'บางแขม',
                'พระประโทน',
                'ธรรมศาลา',
                'ตาก้อง',
                'มาบแค',
                'สนามจันทร์',
                'ดอนยายหอม',
                'ถนนขาด',
                'บ่อพลับ',
                'นครปฐม',
                'วังตะกู',
                'หนองปากโลง',
                'สามควายเผือก',
                'ทุ่งน้อย',
                'หนองดินแดง',
                'วังเย็น',
                'โพรงมะเดื่อ',
                'ลำพยา',
                'สระกะเทียม',
                'สวนป่าน',
                'ห้วยจรเข้',
                'ทัพหลวง',
                'หนองงูเหลือม',
                'บ้านยาง'
            ],
            postalCodes: ['73000']
        },
        กำแพงแสน: {
            subDistrict: [
                'ทุ่งกระพังโหม',
                'กระตีบ',
                'ทุ่งลูกนก',
                'ห้วยขวาง',
                'ทุ่งขวาง',
                'สระสี่มุม',
                'ทุ่งบัว',
                'ดอนข่อย',
                'สระพัฒนา',
                'ห้วยหมอนทอง',
                'ห้วยม่วง',
                'กำแพงแสน',
                'รางพิกุล',
                'หนองกระทุ่ม',
                'วังน้ำเขียว'
            ],
            postalCodes: ['73140', '73180']
        },
        นครชัยศรี: {
            subDistrict: [
                'นครชัยศรี',
                'บางกระเบา',
                'วัดแค',
                'ท่าตำหนัก',
                'บางแก้ว',
                'ท่ากระชับ',
                'ขุนแก้ว',
                'ท่าพระยา',
                'พะเนียด',
                'บางระกำ',
                'โคกพระเจดีย์',
                'ศรีษะทอง',
                'แหลมบัว',
                'ศรีมหาโพธิ์',
                'สัมปทวน',
                'วัดสำโรง',
                'ดอนแฝก',
                'ห้วยพลู',
                'วัดละมุด',
                'บางพระ',
                'บางแก้วฟ้า',
                'ลานตากฟ้า',
                'งิ้วราย',
                'ไทยาวาส'
            ],
            postalCodes: ['73120']
        },
        ดอนตูม: {
            subDistrict: [
                'สามง่าม',
                'ห้วยพระ',
                'ลำเหย',
                'ดอนพุทรา',
                'บ้านหลวง',
                'ดอนรวก',
                'ห้วยด้วน',
                'ลำลูกบัว'
            ],
            postalCodes: ['73150']
        },
        บางเลน: {
            subDistrict: [
                'บางเลน',
                'บางปลา',
                'บางหลวง',
                'บางภาษี',
                'บางระกำ',
                'บางไทรป่า',
                'หินมูล',
                'ไทรงาม',
                'ดอนตูม',
                'นิลเพชร',
                'บัวปากท่า',
                'คลองนกกระทุง',
                'นราภิรมย์',
                'ลำพญา',
                'ไผ่หูช้าง'
            ],
            postalCodes: ['73130', '73190']
        },
        สามพราน: {
            subDistrict: [
                'ท่าข้าม',
                'ทรงคนอง',
                'หอมเกร็ด',
                'บางกระทึก',
                'บางเตย',
                'สามพราน',
                'บางช้าง',
                'ไร่ขิง',
                'ท่าตลาด',
                'กระทุ่มล้ม',
                'คลองใหม่',
                'ตลาดจินดา',
                'คลองจินดา',
                'ยายชา',
                'บ้านใหม่',
                'อ้อมใหญ่'
            ],
            postalCodes: ['73110', '73210', '73220', '73160']
        },
        พุทธมณฑล: {
            subDistrict: ['ศาลายา', 'คลองโยง', 'มหาสวัสดิ์'],
            postalCodes: ['73170']
        }
    },
    สมุทรสาคร: {
        เมืองสมุทรสาคร: {
            subDistrict: [
                'มหาชัย',
                'ท่าฉลอม',
                'โกรกกราก',
                'บ้านบ่อ',
                'บางโทรัด',
                'กาหลง',
                'นาโคก',
                'ท่าจีน',
                'นาดี',
                'ท่าทราย',
                'คอกกระบือ',
                'บางน้ำจืด',
                'พันท้ายนรสิงห์',
                'โคกขาม',
                'บ้านเกาะ',
                'บางกระเจ้า',
                'บางหญ้าแพรก',
                'ชัยมงคล'
            ],
            postalCodes: ['74000']
        },
        กระทุ่มแบน: {
            subDistrict: [
                'ตลาดกระทุ่มแบน',
                'อ้อมน้อย',
                'ท่าไม้',
                'สวนหลวง',
                'บางยาง',
                'คลองมะเดื่อ',
                'หนองนกไข่',
                'ดอนไก่ดี',
                'แคราย',
                'ท่าเสา'
            ],
            postalCodes: ['74110', '74130']
        },
        บ้านแพ้ว: {
            subDistrict: [
                'บ้านแพ้ว',
                'หลักสาม',
                'ยกกระบัตร',
                'โรงเข้',
                'หนองสองห้อง',
                'หนองบัว',
                'หลักสอง',
                'เจ็ดริ้ว',
                'คลองตัน',
                'อำแพง',
                'สวนส้ม',
                'เกษตรพัฒนา'
            ],
            postalCodes: ['74120']
        }
    },
    สมุทรสงคราม: {
        เมืองสมุทรสงคราม: {
            subDistrict: [
                'แม่กลอง',
                'บางขันแตก',
                'ลาดใหญ่',
                'บ้านปรก',
                'บางแก้ว',
                'ท้ายหาด',
                'แหลมใหญ่',
                'คลองเขิน',
                'คลองโคน',
                'นางตะเคียน',
                'บางจะเกร็ง'
            ],
            postalCodes: ['75000']
        },
        บางคนที: {
            subDistrict: [
                'กระดังงา',
                'บางสะแก',
                'บางยี่รงค์',
                'โรงหีบ',
                'บางคนที',
                'ดอนมะโนรา',
                'บางพรม',
                'บางกุ้ง',
                'จอมปลวก',
                'บางนกแขวก',
                'ยายแพง',
                'บางกระบือ',
                'บ้านปราโมทย์'
            ],
            postalCodes: ['75120']
        },
        อัมพวา: {
            subDistrict: [
                'อัมพวา',
                'สวนหลวง',
                'ท่าคา',
                'วัดประดู่',
                'เหมืองใหม่',
                'บางช้าง',
                'แควอ้อม',
                'ปลายโพงพาง',
                'บางแค',
                'แพรกหนามแดง',
                'ยี่สาร',
                'บางนางลี่'
            ],
            postalCodes: ['75110']
        }
    },
    เพชรบุรี: {
        เมืองเพชรบุรี: {
            subDistrict: [
                'ท่าราบ',
                'คลองกระแชง',
                'บางจาน',
                'นาพันสาม',
                'ธงชัย',
                'บ้านกุ่ม',
                'หนองโสน',
                'ไร่ส้ม',
                'เวียงคอย',
                'บางจาก',
                'บ้านหม้อ',
                'ต้นมะม่วง',
                'ช่องสะแก',
                'นาวุ้ง',
                'สำมะโรง',
                'โพพระ',
                'หาดเจ้าสำราญ',
                'หัวสะพาน',
                'ต้นมะพร้าว',
                'วังตะโก',
                'โพไร่หวาน',
                'ดอนยาง',
                'หนองขนาน',
                'หนองพลับ'
            ],
            postalCodes: ['76000', '76100']
        },
        เขาย้อย: {
            subDistrict: [
                'เขาย้อย',
                'สระพัง',
                'บางเค็ม',
                'ทับคาง',
                'หนองปลาไหล',
                'หนองปรง',
                'หนองชุมพล',
                'ห้วยโรง',
                'ห้วยท่าช้าง',
                'หนองชุมพลเหนือ'
            ],
            postalCodes: ['76140']
        },
        หนองหญ้าปล้อง: {
            subDistrict: [
                'หนองหญ้าปล้อง',
                'ยางน้ำกลัดเหนือ',
                'ยางน้ำกลัดใต้',
                'ท่าตะคร้อ'
            ],
            postalCodes: ['76160']
        },
        ชะอำ: {
            subDistrict: [
                'ชะอำ',
                'บางเก่า',
                'นายาง',
                'เขาใหญ่',
                'หนองศาลา',
                'ห้วยทรายเหนือ',
                'ไร่ใหม่พัฒนา',
                'สามพระยา',
                'ดอนขุนห้วย'
            ],
            postalCodes: ['76120']
        },
        ท่ายาง: {
            subDistrict: [
                'ท่ายาง',
                'ท่าคอย',
                'ยางหย่อง',
                'หนองจอก',
                'มาบปลาเค้า',
                'ท่าไม้รวก',
                'วังไคร้',
                'กลัดหลวง',
                'ปึกเตียน',
                'เขากระปุก',
                'ท่าแลง',
                'บ้านในดง'
            ],
            postalCodes: ['76130']
        },
        บ้านลาด: {
            subDistrict: [
                'บ้านลาด',
                'บ้านหาด',
                'บ้านทาน',
                'ตำหรุ',
                'สมอพลือ',
                'ไร่มะขาม',
                'ท่าเสน',
                'หนองกระเจ็ด',
                'หนองกะปุ',
                'ลาดโพธิ์',
                'สะพานไกร',
                'ไร่โคก',
                'โรงเข้',
                'ไร่สะท้อน',
                'ห้วยข้อง',
                'ท่าช้าง',
                'ถ้ำรงค์',
                'ห้วยลึก'
            ],
            postalCodes: ['76150']
        },
        บ้านแหลม: {
            subDistrict: [
                'บ้านแหลม',
                'บางขุนไทร',
                'ปากทะเล',
                'บางแก้ว',
                'แหลมผักเบี้ย',
                'บางตะบูน',
                'บางตะบูนออก',
                'บางครก',
                'ท่าแร้ง',
                'ท่าแร้งออก'
            ],
            postalCodes: ['76110', '76100']
        },
        แก่งกระจาน: {
            subDistrict: [
                'แก่งกระจาน',
                'สองพี่น้อง',
                'วังจันทร์',
                'ป่าเด็ง',
                'พุสวรรค์',
                'ห้วยแม่เพรียง'
            ],
            postalCodes: ['76170']
        }
    },
    ประจวบคีรีขันธ์: {
        เมืองประจวบคีรีขันธ์: {
            subDistrict: [
                'ประจวบคีรีขันธ์',
                'เกาะหลัก',
                'คลองวาฬ',
                'ห้วยทราย',
                'อ่าวน้อย',
                'บ่อนอก'
            ],
            postalCodes: ['77000', '77210']
        },
        กุยบุรี: {
            subDistrict: [
                'กุยบุรี',
                'กุยเหนือ',
                'เขาแดง',
                'ดอนยายหนู',
                'สามกระทาย',
                'หาดขาม'
            ],
            postalCodes: ['77150']
        },
        ทับสะแก: {
            subDistrict: [
                'ทับสะแก',
                'อ่างทอง',
                'นาหูกวาง',
                'เขาล้าน',
                'ห้วยยาง',
                'แสงอรุณ'
            ],
            postalCodes: ['77130']
        },
        บางสะพาน: {
            subDistrict: [
                'กำเนิดนพคุณ',
                'พงศ์ประศาสน์',
                'ร่อนทอง',
                'ธงชัย',
                'ชัยเกษม',
                'ทองมงคล',
                'แม่รำพึง'
            ],
            postalCodes: ['77140', '77230', '77190']
        },
        บางสะพานน้อย: {
            subDistrict: [
                'ปากแพรก',
                'บางสะพาน',
                'ทรายทอง',
                'ช้างแรก',
                'ไชยราช'
            ],
            postalCodes: ['77170']
        },
        ปราณบุรี: {
            subDistrict: [
                'ปราณบุรี',
                'เขาน้อย',
                'ปากน้ำปราณ',
                'หนองตาแต้ม',
                'วังก์พง',
                'เขาจ้าว'
            ],
            postalCodes: ['77120', '77220']
        },
        หัวหิน: {
            subDistrict: [
                'หัวหิน',
                'หนองแก',
                'หินเหล็กไฟ',
                'หนองพลับ',
                'ทับใต้',
                'ห้วยสัตว์ใหญ่',
                'บึงนคร'
            ],
            postalCodes: ['77110']
        },
        สามร้อยยอด: {
            subDistrict: [
                'สามร้อยยอด',
                'ศิลาลอย',
                'ไร่เก่า',
                'ศาลาลัย',
                'ไร่ใหม่'
            ],
            postalCodes: ['77120', '77180']
        }
    },
    นครศรีธรรมราช: {
        เมืองนครศรีธรรมราช: {
            subDistrict: [
                'ในเมือง',
                'ท่าวัง',
                'คลัง',
                'ท่าไร่',
                'ปากนคร',
                'นาทราย',
                'กำแพงเซา',
                'ไชยมนตรี',
                'มะม่วงสองต้น',
                'นาเคียน',
                'ท่างิ้ว',
                'โพธิ์เสด็จ',
                'บางจาก',
                'ปากพูน',
                'ท่าซัก',
                'ท่าเรือ'
            ],
            postalCodes: ['80000', '80280', '80330']
        },
        พรหมคีรี: {
            subDistrict: [
                'พรหมโลก',
                'บ้านเกาะ',
                'อินคีรี',
                'ทอนหงส์',
                'นาเรียง'
            ],
            postalCodes: ['80320']
        },
        ลานสกา: {
            subDistrict: ['เขาแก้ว', 'ลานสกา', 'ท่าดี', 'กำโลน', 'ขุนทะเล'],
            postalCodes: ['80230']
        },
        ฉวาง: {
            subDistrict: [
                'ฉวาง',
                'ละอาย',
                'นาแว',
                'ไม้เรียง',
                'กะเปียด',
                'นากะชะ',
                'ห้วยปริก',
                'ไสหร้า',
                'นาเขลียง',
                'จันดี'
            ],
            postalCodes: ['80150', '80250', '80260']
        },
        พิปูน: {
            subDistrict: ['พิปูน', 'กะทูน', 'เขาพระ', 'ยางค้อม', 'ควนกลาง'],
            postalCodes: ['80270']
        },
        เชียรใหญ่: {
            subDistrict: [
                'เชียรใหญ่',
                'ท่าขนาน',
                'บ้านกลาง',
                'บ้านเนิน',
                'ไสหมาก',
                'ท้องลำเจียก',
                'เสือหึง',
                'การะเกด',
                'เขาพระบาท',
                'แม่เจ้าอยู่หัว'
            ],
            postalCodes: ['80190']
        },
        ชะอวด: {
            subDistrict: [
                'ชะอวด',
                'ท่าเสม็ด',
                'ท่าประจะ',
                'เคร็ง',
                'วังอ่าง',
                'บ้านตูล',
                'ขอนหาด',
                'เกาะขันธ์',
                'ควนหนองหงษ์',
                'เขาพระทอง',
                'นางหลง'
            ],
            postalCodes: ['80180']
        },
        ท่าศาลา: {
            subDistrict: [
                'ท่าศาลา',
                'กลาย',
                'ท่าขึ้น',
                'หัวตะพาน',
                'สระแก้ว',
                'โมคลาน',
                'ไทยบุรี',
                'ดอนตะโก',
                'ตลิ่งชัน',
                'โพธิ์ทอง'
            ],
            postalCodes: ['80160']
        },
        ทุ่งสง: {
            subDistrict: [
                'ปากแพรก',
                'ชะมาย',
                'หนองหงส์',
                'ควนกรด',
                'นาไม้ไผ่',
                'นาหลวงเสน',
                'เขาโร',
                'กะปาง',
                'ที่วัง',
                'น้ำตก',
                'ถ้ำใหญ่',
                'นาโพธิ์',
                'เขาขาว'
            ],
            postalCodes: ['80110', '80310']
        },
        นาบอน: {
            subDistrict: ['นาบอน', 'ทุ่งสง', 'แก้วแสน'],
            postalCodes: ['80220']
        },
        ทุ่งใหญ่: {
            subDistrict: [
                'ท่ายาง',
                'ทุ่งสัง',
                'ทุ่งใหญ่',
                'กุแหระ',
                'ปริก',
                'บางรูป',
                'กรุงหยัน'
            ],
            postalCodes: ['80240']
        },
        ปากพนัง: {
            subDistrict: [
                'ปากพนัง',
                'คลองน้อย',
                'ป่าระกำ',
                'ชะเมา',
                'คลองกระบือ',
                'เกาะทวด',
                'บ้านใหม่',
                'หูล่อง',
                'แหลมตะลุมพุก',
                'ปากพนังฝั่งตะวันตก',
                'บางศาลา',
                'บางพระ',
                'บางตะพง',
                'ปากพนังฝั่งตะวันออก',
                'บ้านเพิง',
                'ท่าพยา',
                'ปากแพรก',
                'ขนาบนาก'
            ],
            postalCodes: ['80140', '80330']
        },
        ร่อนพิบูลย์: {
            subDistrict: [
                'ร่อนพิบูลย์',
                'หินตก',
                'เสาธง',
                'ควนเกย',
                'ควนพัง',
                'ควนชุม'
            ],
            postalCodes: ['80130', '80350']
        },
        สิชล: {
            subDistrict: [
                'สิชล',
                'ทุ่งปรัง',
                'ฉลอง',
                'เสาเภา',
                'เปลี่ยน',
                'สี่ขีด',
                'เทพราช',
                'เขาน้อย',
                'ทุ่งใส'
            ],
            postalCodes: ['80120', '80340']
        },
        ขนอม: {
            subDistrict: ['ขนอม', 'ควนทอง', 'ท้องเนียน'],
            postalCodes: ['80210']
        },
        หัวไทร: {
            subDistrict: [
                'หัวไทร',
                'หน้าสตน',
                'ทรายขาว',
                'แหลม',
                'เขาพังไกร',
                'บ้านราม',
                'บางนบ',
                'ท่าซอม',
                'ควนชะลิก',
                'รามแก้ว',
                'เกาะเพชร'
            ],
            postalCodes: ['80170']
        },
        บางขัน: {
            subDistrict: ['บางขัน', 'บ้านลำนาว', 'วังหิน', 'บ้านนิคม'],
            postalCodes: ['80360']
        },
        ถ้ำพรรณรา: {
            subDistrict: ['ถ้ำพรรณรา', 'คลองเส', 'ดุสิต'],
            postalCodes: ['80260']
        },
        จุฬาภรณ์: {
            subDistrict: [
                'บ้านควนมุด',
                'บ้านชะอวด',
                'ควนหนองคว้า',
                'ทุ่งโพธิ์',
                'นาหมอบุญ',
                'สามตำบล'
            ],
            postalCodes: ['80180', '80130']
        },
        พระพรหม: {
            subDistrict: ['นาพรุ', 'นาสาร', 'ท้ายสำเภา', 'ช้างซ้าย'],
            postalCodes: ['80000']
        },
        นบพิตำ: {
            subDistrict: ['นบพิตำ', 'กรุงชิง', 'กะหรอ', 'นาเหรง'],
            postalCodes: ['80160']
        },
        ช้างกลาง: {
            subDistrict: ['ช้างกลาง', 'หลักช้าง', 'สวนขัน'],
            postalCodes: ['80250']
        },
        เฉลิมพระเกียรติ: {
            subDistrict: ['เชียรเขา', 'ดอนตรอ', 'สวนหลวง', 'ทางพูน'],
            postalCodes: ['80190', '80290']
        }
    },
    กระบี่: {
        เมืองกระบี่: {
            subDistrict: [
                'ปากน้ำ',
                'กระบี่ใหญ่',
                'กระบี่น้อย',
                'เขาคราม',
                'เขาทอง',
                'ทับปริก',
                'ไสไทย',
                'อ่าวนาง',
                'หนองทะเล',
                'คลองประสงค์'
            ],
            postalCodes: ['81000']
        },
        เขาพนม: {
            subDistrict: [
                'เขาพนม',
                'เขาดิน',
                'สินปุน',
                'พรุเตียว',
                'หน้าเขา',
                'โคกหาร'
            ],
            postalCodes: ['81140', '80240']
        },
        เกาะลันตา: {
            subDistrict: [
                'เกาะลันตาใหญ่',
                'เกาะลันตาน้อย',
                'เกาะกลาง',
                'คลองยาง',
                'ศาลาด่าน'
            ],
            postalCodes: ['81150', '81120']
        },
        คลองท่อม: {
            subDistrict: [
                'คลองท่อมใต้',
                'คลองท่อมเหนือ',
                'คลองพน',
                'ทรายขาว',
                'ห้วยน้ำขาว',
                'พรุดินนา',
                'เพหลา'
            ],
            postalCodes: ['81120', '81170']
        },
        อ่าวลึก: {
            subDistrict: [
                'อ่าวลึกใต้',
                'แหลมสัก',
                'นาเหนือ',
                'คลองหิน',
                'อ่าวลึกน้อย',
                'อ่าวลึกเหนือ',
                'เขาใหญ่',
                'คลองยา',
                'บ้านกลาง'
            ],
            postalCodes: ['81110']
        },
        ปลายพระยา: {
            subDistrict: ['ปลายพระยา', 'เขาเขน', 'เขาต่อ', 'คีรีวง'],
            postalCodes: ['81160']
        },
        ลำทับ: {
            subDistrict: ['ลำทับ', 'ดินอุดม', 'ทุ่งไทรทอง', 'ดินแดง'],
            postalCodes: ['81190']
        },
        เหนือคลอง: {
            subDistrict: [
                'เหนือคลอง',
                'เกาะศรีบอยา',
                'คลองขนาน',
                'คลองเขม้า',
                'โคกยาง',
                'ตลิ่งชัน',
                'ปกาสัย',
                'ห้วยยูง'
            ],
            postalCodes: ['81130']
        }
    },
    พังงา: {
        เมืองพังงา: {
            subDistrict: [
                'ท้ายช้าง',
                'นบปริง',
                'ถ้ำน้ำผุด',
                'บางเตย',
                'ตากแดด',
                'สองแพรก',
                'ทุ่งคาโงก',
                'เกาะปันหยี',
                'ป่ากอ'
            ],
            postalCodes: ['82000']
        },
        เกาะยาว: {
            subDistrict: ['เกาะยาวน้อย', 'เกาะยาวใหญ่', 'พรุใน'],
            postalCodes: ['82160', '83000']
        },
        กะปง: {
            subDistrict: ['กะปง', 'ท่านา', 'เหมาะ', 'เหล', 'รมณีย์'],
            postalCodes: ['82170']
        },
        ตะกั่วทุ่ง: {
            subDistrict: [
                'ถ้ำ',
                'กระโสม',
                'กะไหล',
                'ท่าอยู่',
                'หล่อยูง',
                'โคกกลอย',
                'คลองเคียน'
            ],
            postalCodes: ['82130', '82140']
        },
        ตะกั่วป่า: {
            subDistrict: [
                'ตะกั่วป่า',
                'บางนายสี',
                'บางไทร',
                'บางม่วง',
                'ตำตัว',
                'โคกเคียน',
                'คึกคัก',
                'เกาะคอเขา'
            ],
            postalCodes: ['82110', '82190']
        },
        คุระบุรี: {
            subDistrict: ['คุระ', 'บางวัน', 'เกาะพระทอง', 'แม่นางขาว'],
            postalCodes: ['82150']
        },
        ทับปุด: {
            subDistrict: [
                'ทับปุด',
                'มะรุ่ย',
                'บ่อแสน',
                'ถ้ำทองหลาง',
                'โคกเจริญ',
                'บางเหรียง'
            ],
            postalCodes: ['82180']
        },
        ท้ายเหมือง: {
            subDistrict: [
                'ท้ายเหมือง',
                'นาเตย',
                'บางทอง',
                'ทุ่งมะพร้าว',
                'ลำภี',
                'ลำแก่น'
            ],
            postalCodes: ['82120', '82210']
        }
    },
    ภูเก็ต: {
        เมืองภูเก็ต: {
            subDistrict: [
                'ตลาดใหญ่',
                'ตลาดเหนือ',
                'เกาะแก้ว',
                'รัษฎา',
                'วิชิต',
                'ฉลอง',
                'ราไวย์',
                'กะรน'
            ],
            postalCodes: ['83000', '83130', '83100']
        },
        กะทู้: {
            subDistrict: ['กะทู้', 'ป่าตอง', 'กมลา'],
            postalCodes: ['83120', '83150']
        },
        ถลาง: {
            subDistrict: [
                'เทพกระษัตรี',
                'ศรีสุนทร',
                'เชิงทะเล',
                'ป่าคลอก',
                'ไม้ขาว',
                'สาคู'
            ],
            postalCodes: ['83110']
        }
    },
    สุราษฎร์ธานี: {
        เมืองสุราษฎร์ธานี: {
            subDistrict: [
                'ตลาด',
                'มะขามเตี้ย',
                'วัดประดู่',
                'ขุนทะเล',
                'บางใบไม้',
                'บางชนะ',
                'คลองน้อย',
                'บางไทร',
                'บางโพธิ์',
                'บางกุ้ง',
                'คลองฉนาก'
            ],
            postalCodes: ['84000', '84100']
        },
        กาญจนดิษฐ์: {
            subDistrict: [
                'ท่าทองใหม่',
                'ท่าทอง',
                'กะแดะ',
                'ทุ่งกง',
                'กรูด',
                'ช้างซ้าย',
                'พลายวาส',
                'ป่าร่อน',
                'ตะเคียนทอง',
                'ช้างขวา',
                'ท่าอุแท',
                'ทุ่งรัง',
                'คลองสระ'
            ],
            postalCodes: ['84290', '84160']
        },
        ดอนสัก: {
            subDistrict: ['ดอนสัก', 'ชลคราม', 'ไชยคราม', 'ปากแพรก'],
            postalCodes: ['84220', '84160', '84340']
        },
        เกาะสมุย: {
            subDistrict: [
                'อ่างทอง',
                'ลิปะน้อย',
                'ตลิ่งงาม',
                'หน้าเมือง',
                'มะเร็ต',
                'บ่อผุด',
                'แม่น้ำ'
            ],
            postalCodes: ['84140', '84310', '84320', '84330']
        },
        เกาะพะงัน: {
            subDistrict: ['เกาะพะงัน', 'บ้านใต้', 'เกาะเต่า'],
            postalCodes: ['84280', '84360']
        },
        ไชยา: {
            subDistrict: [
                'ตลาดไชยา',
                'พุมเรียง',
                'เลม็ด',
                'เวียง',
                'ทุ่ง',
                'ป่าเว',
                'ตะกรบ',
                'โมถ่าย',
                'ปากหมาก'
            ],
            postalCodes: ['84110']
        },
        ท่าชนะ: {
            subDistrict: [
                'ท่าชนะ',
                'สมอทอง',
                'ประสงค์',
                'คันธุลี',
                'วัง',
                'คลองพา'
            ],
            postalCodes: ['84170']
        },
        คีรีรัฐนิคม: {
            subDistrict: [
                'ท่าขนอน',
                'บ้านยาง',
                'น้ำหัก',
                'กะเปา',
                'ท่ากระดาน',
                'ย่านยาว',
                'ถ้ำสิงขร',
                'บ้านทำเนียบ'
            ],
            postalCodes: ['84180']
        },
        บ้านตาขุน: {
            subDistrict: ['เขาวง', 'พะแสง', 'พรุไทย', 'เขาพัง'],
            postalCodes: ['84230']
        },
        พนม: {
            subDistrict: [
                'พนม',
                'ต้นยวน',
                'คลองศก',
                'พลูเถื่อน',
                'พังกาญจน์',
                'คลองชะอุ่น'
            ],
            postalCodes: ['84250']
        },
        ท่าฉาง: {
            subDistrict: [
                'ท่าฉาง',
                'ท่าเคย',
                'คลองไทร',
                'เขาถ่าน',
                'เสวียด',
                'ปากฉลุย'
            ],
            postalCodes: ['84150']
        },
        บ้านนาสาร: {
            subDistrict: [
                'นาสาร',
                'พรุพี',
                'ทุ่งเตา',
                'ลำพูน',
                'ท่าชี',
                'ควนศรี',
                'ควนสุบรรณ',
                'คลองปราบ',
                'น้ำพุ',
                'ทุ่งเตาใหม่',
                'เพิ่มพูนทรัพย์'
            ],
            postalCodes: ['84120', '84270']
        },
        บ้านนาเดิม: {
            subDistrict: ['บ้านนา', 'ท่าเรือ', 'ทรัพย์ทวี', 'นาใต้'],
            postalCodes: ['84240']
        },
        เคียนซา: {
            subDistrict: [
                'เคียนซา',
                'พ่วงพรมคร',
                'เขาตอก',
                'อรัญคามวารี',
                'บ้านเสด็จ'
            ],
            postalCodes: ['84260', '84210']
        },
        เวียงสระ: {
            subDistrict: [
                'เวียงสระ',
                'บ้านส้อง',
                'คลองฉนวน',
                'ทุ่งหลวง',
                'เขานิพันธ์'
            ],
            postalCodes: ['84190']
        },
        พระแสง: {
            subDistrict: [
                'อิปัน',
                'สินปุน',
                'บางสวรรค์',
                'ไทรขึง',
                'สินเจริญ',
                'ไทรโสภา',
                'สาคู'
            ],
            postalCodes: ['84210']
        },
        พุนพิน: {
            subDistrict: [
                'ท่าข้าม',
                'ท่าสะท้อน',
                'ลีเล็ด',
                'บางมะเดื่อ',
                'บางเดือน',
                'ท่าโรงช้าง',
                'กรูด',
                'พุนพิน',
                'บางงอน',
                'ศรีวิชัย',
                'น้ำรอบ',
                'มะลวน',
                'หัวเตย',
                'หนองไทร',
                'เขาหัวควาย',
                'ตะปาน'
            ],
            postalCodes: ['84130']
        },
        ชัยบุรี: {
            subDistrict: ['สองแพรก', 'ชัยบุรี', 'คลองน้อย', 'ไทรทอง'],
            postalCodes: ['84350']
        },
        วิภาวดี: {
            subDistrict: ['ตะกุกใต้', 'ตะกุกเหนือ'],
            postalCodes: ['84370']
        }
    },
    ระนอง: {
        เมืองระนอง: {
            subDistrict: [
                'เขานิเวศน์',
                'ราชกรูด',
                'หงาว',
                'บางริ้น',
                'ปากน้ำ',
                'บางนอน',
                'หาดส้มแป้น',
                'ทรายแดง',
                'เกาะพยาม'
            ],
            postalCodes: ['85000', '85130']
        },
        ละอุ่น: {
            subDistrict: [
                'ละอุ่นใต้',
                'ละอุ่นเหนือ',
                'บางพระใต้',
                'บางพระเหนือ',
                'บางแก้ว',
                'ในวงเหนือ',
                'ในวงใต้'
            ],
            postalCodes: ['85130']
        },
        กะเปอร์: {
            subDistrict: [
                'ม่วงกลวง',
                'กะเปอร์',
                'เชี่ยวเหลียง',
                'บ้านนา',
                'บางหิน'
            ],
            postalCodes: ['85120']
        },
        กระบุรี: {
            subDistrict: [
                'น้ำจืด',
                'น้ำจืดน้อย',
                'มะมุ',
                'ปากจั่น',
                'ลำเลียง',
                'จ.ป.ร.',
                'บางใหญ่'
            ],
            postalCodes: ['85110']
        },
        สุขสำราญ: {
            subDistrict: ['นาคา', 'กำพวน'],
            postalCodes: ['85120']
        }
    },
    ชุมพร: {
        เมืองชุมพร: {
            subDistrict: [
                'ท่าตะเภา',
                'ปากน้ำ',
                'ท่ายาง',
                'บางหมาก',
                'นาทุ่ง',
                'นาชะอัง',
                'ตากแดด',
                'บางลึก',
                'หาดพันไกร',
                'วังไผ่',
                'วังใหม่',
                'บ้านนา',
                'ขุนกระทิง',
                'ทุ่งคา',
                'วิสัยเหนือ',
                'หาดทรายรี',
                'ถ้ำสิงห์'
            ],
            postalCodes: ['86000', '86120', '86190', '86100']
        },
        ท่าแซะ: {
            subDistrict: [
                'ท่าแซะ',
                'คุริง',
                'สลุย',
                'นากระตาม',
                'รับร่อ',
                'ท่าข้าม',
                'หงษ์เจริญ',
                'หินแก้ว',
                'ทรัพย์อนันต์',
                'สองพี่น้อง'
            ],
            postalCodes: ['86140', '86190']
        },
        ปะทิว: {
            subDistrict: [
                'บางสน',
                'ทะเลทรัพย์',
                'สะพลี',
                'ชุมโค',
                'ดอนยาง',
                'ปากคลอง',
                'เขาไชยราช'
            ],
            postalCodes: ['86160', '86230', '86210']
        },
        หลังสวน: {
            subDistrict: [
                'หลังสวน',
                'ขันเงิน',
                'ท่ามะพลา',
                'นาขา',
                'นาพญา',
                'บ้านควน',
                'บางมะพร้าว',
                'บางน้ำจืด',
                'ปากน้ำ',
                'พ้อแดง',
                'แหลมทราย',
                'วังตะกอ',
                'หาดยาย'
            ],
            postalCodes: ['86110', '86150']
        },
        ละแม: {
            subDistrict: ['ละแม', 'ทุ่งหลวง', 'สวนแตง', 'ทุ่งคาวัด'],
            postalCodes: ['86170']
        },
        พะโต๊ะ: {
            subDistrict: ['พะโต๊ะ', 'ปากทรง', 'ปังหวาน', 'พระรักษ์'],
            postalCodes: ['86180']
        },
        สวี: {
            subDistrict: [
                'นาโพธิ์',
                'สวี',
                'ทุ่งระยะ',
                'ท่าหิน',
                'ปากแพรก',
                'ด่านสวี',
                'ครน',
                'วิสัยใต้',
                'นาสัก',
                'เขาทะลุ',
                'เขาค่าย'
            ],
            postalCodes: ['86130']
        },
        ทุ่งตะโก: {
            subDistrict: ['ปากตะโก', 'ทุ่งตะไคร', 'ตะโก', 'ช่องไม้แก้ว'],
            postalCodes: ['86220']
        }
    },
    สงขลา: {
        เมืองสงขลา: {
            subDistrict: [
                'บ่อยาง',
                'เขารูปช้าง',
                'เกาะแต้ว',
                'พะวง',
                'ทุ่งหวัง',
                'เกาะยอ'
            ],
            postalCodes: ['90000', '90100']
        },
        สทิงพระ: {
            subDistrict: [
                'จะทิ้งพระ',
                'กระดังงา',
                'สนามชัย',
                'ดีหลวง',
                'ชุมพล',
                'คลองรี',
                'คูขุด',
                'ท่าหิน',
                'วัดจันทร์',
                'บ่อแดง',
                'บ่อดาน'
            ],
            postalCodes: ['90190']
        },
        จะนะ: {
            subDistrict: [
                'บ้านนา',
                'ป่าชิง',
                'สะพานไม้แก่น',
                'สะกอม',
                'นาหว้า',
                'นาทับ',
                'น้ำขาว',
                'ขุนตัดหวาย',
                'ท่าหมอไทร',
                'จะโหนง',
                'คู',
                'แค',
                'คลองเปียะ',
                'ตลิ่งชัน'
            ],
            postalCodes: ['90130']
        },
        นาทวี: {
            subDistrict: [
                'นาทวี',
                'ฉาง',
                'นาหมอศรี',
                'คลองทราย',
                'ปลักหนู',
                'ท่าประดู่',
                'สะท้อน',
                'ทับช้าง',
                'ประกอบ',
                'คลองกวาง'
            ],
            postalCodes: ['90160']
        },
        เทพา: {
            subDistrict: [
                'เทพา',
                'ปากบาง',
                'เกาะสะบ้า',
                'ลำไพล',
                'ท่าม่วง',
                'วังใหญ่',
                'สะกอม'
            ],
            postalCodes: ['90150', '90260']
        },
        สะบ้าย้อย: {
            subDistrict: [
                'สะบ้าย้อย',
                'ทุ่งพอ',
                'เปียน',
                'บ้านโหนด',
                'จะแหน',
                'คูหา',
                'เขาแดง',
                'บาโหย',
                'ธารคีรี'
            ],
            postalCodes: ['90210']
        },
        ระโนด: {
            subDistrict: [
                'ระโนด',
                'คลองแดน',
                'ตะเครียะ',
                'ท่าบอน',
                'บ้านใหม่',
                'บ่อตรุ',
                'ปากแตระ',
                'พังยาง',
                'ระวะ',
                'วัดสน',
                'บ้านขาว',
                'แดนสงวน'
            ],
            postalCodes: ['90140']
        },
        กระแสสินธุ์: {
            subDistrict: ['เกาะใหญ่', 'โรง', 'เชิงแส', 'กระแสสินธุ์'],
            postalCodes: ['90270']
        },
        รัตภูมิ: {
            subDistrict: [
                'กำแพงเพชร',
                'ท่าชะมวง',
                'คูหาใต้',
                'ควนรู',
                'เขาพระ'
            ],
            postalCodes: ['90180']
        },
        สะเดา: {
            subDistrict: [
                'สะเดา',
                'ปริก',
                'พังลา',
                'สำนักแต้ว',
                'ทุ่งหมอ',
                'ท่าโพธิ์',
                'ปาดังเบซาร์',
                'สำนักขาม',
                'เขามีเกียรติ'
            ],
            postalCodes: ['90120', '90170', '90240', '90320']
        },
        หาดใหญ่: {
            subDistrict: [
                'หาดใหญ่',
                'ควนลัง',
                'คูเต่า',
                'คอหงส์',
                'คลองแห',
                'คลองอู่ตะเภา',
                'ฉลุง',
                'ทุ่งใหญ่',
                'ทุ่งตำเสา',
                'ท่าข้าม',
                'น้ำน้อย',
                'บ้านพรุ',
                'พะตง'
            ],
            postalCodes: ['90110', '90250', '90230']
        },
        นาหม่อม: {
            subDistrict: ['นาหม่อม', 'พิจิตร', 'ทุ่งขมิ้น', 'คลองหรัง'],
            postalCodes: ['90310']
        },
        ควนเนียง: {
            subDistrict: ['รัตภูมิ', 'ควนโส', 'ห้วยลึก', 'บางเหรียง'],
            postalCodes: ['90220']
        },
        บางกล่ำ: {
            subDistrict: ['บางกล่ำ', 'ท่าช้าง', 'แม่ทอม', 'บ้านหาร'],
            postalCodes: ['90110']
        },
        สิงหนคร: {
            subDistrict: [
                'ชิงโค',
                'สทิงหม้อ',
                'ทำนบ',
                'รำแดง',
                'วัดขนุน',
                'ชะแล้',
                'ปากรอ',
                'ป่าขาด',
                'หัวเขา',
                'บางเขียด',
                'ม่วงงาม'
            ],
            postalCodes: ['90280', '90330']
        },
        คลองหอยโข่ง: {
            subDistrict: ['คลองหอยโข่ง', 'ทุ่งลาน', 'โคกม่วง', 'คลองหลา'],
            postalCodes: ['90230', '90110']
        }
    },
    สตูล: {
        เมืองสตูล: {
            subDistrict: [
                'พิมาน',
                'คลองขุด',
                'ควนขัน',
                'บ้านควน',
                'ฉลุง',
                'เกาะสาหร่าย',
                'ตันหยงโป',
                'เจ๊ะบิลัง',
                'ตำมะลัง',
                'ปูยู',
                'ควนโพธิ์',
                'เกตรี'
            ],
            postalCodes: ['91000', '91140']
        },
        ควนโดน: {
            subDistrict: ['ควนโดน', 'ควนสตอ', 'ย่านซื่อ', 'วังประจัน'],
            postalCodes: ['91160']
        },
        ควนกาหลง: {
            subDistrict: ['ทุ่งนุ้ย', 'ควนกาหลง', 'อุใดเจริญ'],
            postalCodes: ['91130']
        },
        ท่าแพ: {
            subDistrict: ['ท่าแพ', 'แป-ระ', 'สาคร', 'ท่าเรือ'],
            postalCodes: ['91150']
        },
        ละงู: {
            subDistrict: [
                'กำแพง',
                'ละงู',
                'เขาขาว',
                'ปากน้ำ',
                'น้ำผุด',
                'แหลมสน'
            ],
            postalCodes: ['91110']
        },
        ทุ่งหว้า: {
            subDistrict: [
                'ทุ่งหว้า',
                'นาทอน',
                'ขอนคลาน',
                'ทุ่งบุหลัง',
                'ป่าแก่บ่อหิน'
            ],
            postalCodes: ['91120']
        },
        มะนัง: {
            subDistrict: ['ปาล์มพัฒนา', 'นิคมพัฒนา'],
            postalCodes: ['91130']
        }
    },
    ตรัง: {
        เมืองตรัง: {
            subDistrict: [
                'ทับเที่ยง',
                'นาพละ',
                'บ้านควน',
                'นาบินหลา',
                'ควนปริง',
                'นาโยงใต้',
                'บางรัก',
                'โคกหล่อ',
                'นาโต๊ะหมิง',
                'หนองตรุด',
                'น้ำผุด',
                'นาตาล่วง',
                'บ้านโพธิ์',
                'นาท่ามเหนือ',
                'นาท่ามใต้'
            ],
            postalCodes: ['92000', '92170', '92190']
        },
        กันตัง: {
            subDistrict: [
                'กันตัง',
                'ควนธานี',
                'บางหมาก',
                'บางเป้า',
                'วังวน',
                'กันตังใต้',
                'โคกยาง',
                'คลองลุ',
                'ย่านซื่อ',
                'บ่อน้ำร้อน',
                'บางสัก',
                'นาเกลือ',
                'เกาะลิบง',
                'คลองชีล้อม'
            ],
            postalCodes: ['92110']
        },
        ย่านตาขาว: {
            subDistrict: [
                'ย่านตาขาว',
                'หนองบ่อ',
                'นาชุมเห็ด',
                'ในควน',
                'โพรงจระเข้',
                'ทุ่งกระบือ',
                'ทุ่งค่าย',
                'เกาะเปียะ'
            ],
            postalCodes: ['92140']
        },
        ปะเหลียน: {
            subDistrict: [
                'ท่าข้าม',
                'ทุ่งยาว',
                'ปะเหลียน',
                'บางด้วน',
                'บ้านนา',
                'สุโสะ',
                'ลิพัง',
                'เกาะสุกร',
                'ท่าพญา',
                'แหลมสอม'
            ],
            postalCodes: ['92120', '92180', '92140']
        },
        สิเกา: {
            subDistrict: [
                'บ่อหิน',
                'เขาไม้แก้ว',
                'กะลาเส',
                'ไม้ฝาด',
                'นาเมืองเพชร'
            ],
            postalCodes: ['92150', '92000']
        },
        ห้วยยอด: {
            subDistrict: [
                'ห้วยยอด',
                'หนองช้างแล่น',
                'บางดี',
                'บางกุ้ง',
                'เขากอบ',
                'เขาขาว',
                'เขาปูน',
                'ปากแจ่ม',
                'ปากคม',
                'ท่างิ้ว',
                'ลำภูรา',
                'นาวง',
                'ห้วยนาง',
                'ในเตา',
                'ทุ่งต่อ',
                'วังคีรี'
            ],
            postalCodes: ['92130', '92210', '92190']
        },
        วังวิเศษ: {
            subDistrict: [
                'เขาวิเศษ',
                'วังมะปราง',
                'อ่าวตง',
                'ท่าสะบ้า',
                'วังมะปรางเหนือ'
            ],
            postalCodes: ['92220', '92000']
        },
        นาโยง: {
            subDistrict: [
                'นาโยงเหนือ',
                'ช่อง',
                'ละมอ',
                'โคกสะบ้า',
                'นาหมื่นศรี',
                'นาข้าวเสีย'
            ],
            postalCodes: ['92170']
        },
        รัษฎา: {
            subDistrict: ['ควนเมา', 'คลองปาง', 'หนองบัว', 'หนองปรือ', 'เขาไพร'],
            postalCodes: ['92160', '92130']
        },
        หาดสำราญ: {
            subDistrict: ['หาดสำราญ', 'บ้าหวี', 'ตะเสะ'],
            postalCodes: ['92120']
        }
    },
    พัทลุง: {
        เมืองพัทลุง: {
            subDistrict: [
                'คูหาสวรรค์',
                'เขาเจียก',
                'ท่ามิหรำ',
                'โคกชะงาย',
                'นาท่อม',
                'ปรางหมู่',
                'ท่าแค',
                'ลำปำ',
                'ตำนาน',
                'ควนมะพร้าว',
                'ร่มเมือง',
                'ชัยบุรี',
                'นาโหนด',
                'พญาขัน'
            ],
            postalCodes: ['93000']
        },
        กงหรา: {
            subDistrict: [
                'กงหรา',
                'ชะรัด',
                'คลองเฉลิม',
                'คลองทรายขาว',
                'สมหวัง'
            ],
            postalCodes: ['93180', '93000']
        },
        เขาชัยสน: {
            subDistrict: [
                'เขาชัยสน',
                'ควนขนุน',
                'จองถนน',
                'หานโพธิ์',
                'โคกม่วง'
            ],
            postalCodes: ['93130']
        },
        ตะโหมด: {
            subDistrict: ['แม่ขรี', 'ตะโหมด', 'คลองใหญ่'],
            postalCodes: ['93160']
        },
        ควนขนุน: {
            subDistrict: [
                'ควนขนุน',
                'ทะเลน้อย',
                'นาขยาด',
                'พนมวังก์',
                'แหลมโตนด',
                'ปันแต',
                'โตนดด้วน',
                'ดอนทราย',
                'มะกอกเหนือ',
                'พนางตุง',
                'ชะมวง',
                'แพรกหา'
            ],
            postalCodes: ['93110', '93150']
        },
        ปากพะยูน: {
            subDistrict: [
                'ปากพะยูน',
                'ดอนประดู่',
                'เกาะนางคำ',
                'เกาะหมาก',
                'ฝาละมี',
                'หารเทา',
                'ดอนทราย'
            ],
            postalCodes: ['93120']
        },
        ศรีบรรพต: {
            subDistrict: ['เขาย่า', 'เขาปู่', 'ตะแพน'],
            postalCodes: ['93190']
        },
        ป่าบอน: {
            subDistrict: ['ป่าบอน', 'โคกทราย', 'หนองธง', 'ทุ่งนารี', 'วังใหม่'],
            postalCodes: ['93170']
        },
        บางแก้ว: {
            subDistrict: ['ท่ามะเดื่อ', 'นาปะขอ', 'โคกสัก'],
            postalCodes: ['93140']
        },
        ป่าพะยอม: {
            subDistrict: ['ป่าพะยอม', 'ลานข่อย', 'เกาะเต่า', 'บ้านพร้าว'],
            postalCodes: ['93210']
        },
        ศรีนครินทร์: {
            subDistrict: ['ชุมพล', 'บ้านนา', 'อ่างทอง', 'ลำสินธุ์'],
            postalCodes: ['93000']
        }
    },
    ปัตตานี: {
        เมืองปัตตานี: {
            subDistrict: [
                'สะบารัง',
                'อาเนาะรู',
                'จะบังติกอ',
                'บานา',
                'ตันหยงลุโละ',
                'คลองมานิง',
                'กะมิยอ',
                'บาราโหม',
                'ปะกาฮะรัง',
                'รูสะมิแล',
                'ตะลุโบะ',
                'บาราเฮาะ',
                'ปุยุด'
            ],
            postalCodes: ['94000']
        },
        โคกโพธิ์: {
            subDistrict: [
                'โคกโพธิ์',
                'มะกรูด',
                'บางโกระ',
                'ป่าบอน',
                'ทรายขาว',
                'นาประดู่',
                'ปากล่อ',
                'ทุ่งพลา',
                'ท่าเรือ',
                'นาเกตุ',
                'ควนโนรี',
                'ช้างให้ตก'
            ],
            postalCodes: ['94120', '94180']
        },
        หนองจิก: {
            subDistrict: [
                'เกาะเปาะ',
                'คอลอตันหยง',
                'ดอนรัก',
                'ดาโต๊ะ',
                'ตุยง',
                'ท่ากำชำ',
                'บ่อทอง',
                'บางเขา',
                'บางตาวา',
                'ปุโละปุโย',
                'ยาบี',
                'ลิปะสะโง'
            ],
            postalCodes: ['94170']
        },
        ปะนาเระ: {
            subDistrict: [
                'ปะนาเระ',
                'ท่าข้าม',
                'บ้านนอก',
                'ดอน',
                'ควน',
                'ท่าน้ำ',
                'คอกกระบือ',
                'พ่อมิ่ง',
                'บ้านกลาง',
                'บ้านน้ำบ่อ'
            ],
            postalCodes: ['94130', '94190']
        },
        มายอ: {
            subDistrict: [
                'มายอ',
                'ถนน',
                'ตรัง',
                'กระหวะ',
                'ลุโบะยิไร',
                'ลางา',
                'กระเสาะ',
                'เกาะจัน',
                'ปะโด',
                'สาคอบน',
                'สาคอใต้',
                'สะกำ',
                'ปานัน'
            ],
            postalCodes: ['94140', '94190']
        },
        ทุ่งยางแดง: {
            subDistrict: ['ตะโละแมะนา', 'พิเทน', 'น้ำดำ', 'ปากู'],
            postalCodes: ['94140']
        },
        สายบุรี: {
            subDistrict: [
                'ตะลุบัน',
                'ตะบิ้ง',
                'ปะเสยะวอ',
                'บางเก่า',
                'บือเระ',
                'เตราะบอน',
                'กะดุนง',
                'ละหาร',
                'มะนังดาลำ',
                'แป้น',
                'ทุ่งคล้า'
            ],
            postalCodes: ['94110', '94190']
        },
        ไม้แก่น: {
            subDistrict: ['ไทรทอง', 'ไม้แก่น', 'ตะโละไกรทอง', 'ดอนทราย'],
            postalCodes: ['94220']
        },
        ยะหริ่ง: {
            subDistrict: [
                'ตะโละ',
                'ตะโละกาโปร์',
                'ตันหยงดาลอ',
                'ตันหยงจึงงา',
                'ตอหลัง',
                'ตาแกะ',
                'ตาลีอายร์',
                'ยามู',
                'บางปู',
                'หนองแรต',
                'ปิยามุมัง',
                'ปุลากง',
                'บาโลย',
                'สาบัน',
                'มะนังยง',
                'ราตาปันยัง',
                'จะรัง',
                'แหลมโพธิ์'
            ],
            postalCodes: ['94150', '94190']
        },
        ยะรัง: {
            subDistrict: [
                'ยะรัง',
                'สะดาวา',
                'ประจัน',
                'สะนอ',
                'ระแว้ง',
                'ปิตูมุดี',
                'วัด',
                'กระโด',
                'คลองใหม่',
                'เมาะมาวี',
                'กอลำ',
                'เขาตูม'
            ],
            postalCodes: ['94160']
        },
        กะพ้อ: {
            subDistrict: ['กะรุบี', 'ตะโละดือรามัน', 'ปล่องหอย'],
            postalCodes: ['94230']
        },
        แม่ลาน: {
            subDistrict: ['แม่ลาน', 'ม่วงเตี้ย', 'ป่าไร่'],
            postalCodes: ['94180']
        }
    },
    ยะลา: {
        เมืองยะลา: {
            subDistrict: [
                'สะเตง',
                'บุดี',
                'ยุโป',
                'ลิดล',
                'ยะลา',
                'ท่าสาป',
                'ลำใหม่',
                'หน้าถ้ำ',
                'ลำพะยา',
                'เปาะเส้ง',
                'พร่อน',
                'บันนังสาเรง',
                'สะเตงนอก',
                'ตาเซะ'
            ],
            postalCodes: ['95000', '95160']
        },
        เบตง: {
            subDistrict: [
                'เบตง',
                'ยะรม',
                'ตาเนาะแมเราะ',
                'อัยเยอร์เวง',
                'ธารน้ำทิพย์'
            ],
            postalCodes: ['95110']
        },
        บันนังสตา: {
            subDistrict: [
                'บันนังสตา',
                'บาเจาะ',
                'ตาเนาะปูเต๊ะ',
                'ถ้ำทะลุ',
                'ตลิ่งชัน',
                'เขื่อนบางลาง'
            ],
            postalCodes: ['95130']
        },
        ธารโต: {
            subDistrict: ['ธารโต', 'บ้านแหร', 'แม่หวาด', 'คีรีเขต'],
            postalCodes: ['95150', '95170']
        },
        ยะหา: {
            subDistrict: [
                'ยะหา',
                'ละแอ',
                'ปะแต',
                'บาโร๊ะ',
                'ตาชี',
                'บาโงยซิแน',
                'กาตอง'
            ],
            postalCodes: ['95120']
        },
        รามัน: {
            subDistrict: [
                'กายูบอเกาะ',
                'กาลูปัง',
                'กาลอ',
                'กอตอตือร๊ะ',
                'โกตาบารู',
                'เกะรอ',
                'จะกว๊ะ',
                'ท่าธง',
                'เนินงาม',
                'บาลอ',
                'บาโงย',
                'บือมัง',
                'ยะต๊ะ',
                'วังพญา',
                'อาซ่อง',
                'ตะโล๊ะหะลอ'
            ],
            postalCodes: ['95140']
        },
        กาบัง: {
            subDistrict: ['กาบัง', 'บาละ'],
            postalCodes: ['95120']
        },
        กรงปินัง: {
            subDistrict: ['กรงปินัง', 'สะเอะ', 'ห้วยกระทิง', 'ปุโรง'],
            postalCodes: ['95000']
        }
    },
    นราธิวาส: {
        เมืองนราธิวาส: {
            subDistrict: [
                'บางนาค',
                'ลำภู',
                'มะนังตายอ',
                'บางปอ',
                'กะลุวอ',
                'กะลุวอเหนือ',
                'โคกเคียน'
            ],
            postalCodes: ['96000']
        },
        ตากใบ: {
            subDistrict: [
                'เจ๊ะเห',
                'ไพรวัน',
                'พร่อน',
                'ศาลาใหม่',
                'บางขุนทอง',
                'เกาะสะท้อน',
                'นานาค',
                'โฆษิต'
            ],
            postalCodes: ['96110']
        },
        บาเจาะ: {
            subDistrict: [
                'บาเจาะ',
                'ลุโบะสาวอ',
                'กาเยาะมาตี',
                'ปะลุกาสาเมาะ',
                'บาเระเหนือ',
                'บาเระใต้'
            ],
            postalCodes: ['96170']
        },
        ยี่งอ: {
            subDistrict: [
                'ยี่งอ',
                'ละหาร',
                'จอเบาะ',
                'ลุโบะบายะ',
                'ลุโบะบือซา',
                'ตะปอเยาะ'
            ],
            postalCodes: ['96180']
        },
        ระแงะ: {
            subDistrict: [
                'ตันหยงมัส',
                'ตันหยงลิมอ',
                'บองอ',
                'กาลิซา',
                'บาโงสะโต',
                'เฉลิม',
                'มะรือโบตก'
            ],
            postalCodes: ['96130', '96220']
        },
        รือเสาะ: {
            subDistrict: [
                'รือเสาะ',
                'สาวอ',
                'เรียง',
                'สามัคคี',
                'บาตง',
                'ลาโละ',
                'รือเสาะออก',
                'โคกสะตอ',
                'สุวารี'
            ],
            postalCodes: ['96150']
        },
        ศรีสาคร: {
            subDistrict: [
                'ซากอ',
                'ตะมะยูง',
                'ศรีสาคร',
                'เชิงคีรี',
                'กาหลง',
                'ศรีบรรพต'
            ],
            postalCodes: ['96210']
        },
        แว้ง: {
            subDistrict: [
                'แว้ง',
                'กายูคละ',
                'ฆอเลาะ',
                'โละจูด',
                'แม่ดง',
                'เอราวัณ'
            ],
            postalCodes: ['96160']
        },
        สุคิริน: {
            subDistrict: ['มาโมง', 'สุคิริน', 'เกียร์', 'ภูเขาทอง', 'ร่มไทร'],
            postalCodes: ['96190']
        },
        'สุไหงโก-ลก': {
            subDistrict: ['สุไหงโก-ลก', 'ปาเสมัส', 'มูโนะ', 'ปูโยะ'],
            postalCodes: ['96120']
        },
        สุไหงปาดี: {
            subDistrict: [
                'ปะลุรู',
                'สุไหงปาดี',
                'โต๊ะเด็ง',
                'สากอ',
                'ริโก๋',
                'กาวะ'
            ],
            postalCodes: ['96140']
        },
        จะแนะ: {
            subDistrict: ['จะแนะ', 'ดุซงญอ', 'ผดุงมาตร', 'ช้างเผือก'],
            postalCodes: ['96220']
        },
        เจาะไอร้อง: {
            subDistrict: ['จวบ', 'บูกิต', 'มะรือโบออก'],
            postalCodes: ['96130']
        }
    }
};
